-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /cluster/home/kahrens/ddml_applied/GWG/Output/GWG_232_2.txt
  log type:  text
 opened on:  10 Dec 2023, 19:14:53

. 
. which ddml
/cluster/home/kahrens/ado/plus/d/ddml.ado
*! ddml v1.4.3
*! last edited: 17aug2023
*! authors: aa/ms

. which pystacked
/cluster/home/kahrens/ado/plus/p/pystacked.ado
*! pystacked v0.7.5
*! last edited: 7aug2023
*! authors: aa/ms

. 
. set seed `seed'

. local folder out_`seed'

. 
. use "../Data/gender_gap_ML_processed", clear

. 
. cap mkdir `folder'

. 
. *****************************************************************************
> ***
. ***  controls
. *****************************************************************************
> ***
. 
. // create squared age and tenure here
. gen age_r2 = age_r^2

. gen tenure2 = tenure^2
(2 missing values generated)

. 
. // no base categories
. global continuous                                                            
>                                                            ///
>         age_r                                                                
>                                                                    /// no mis
> sing
>         yrsqual         /* years of education (derived) */                   
>                                    /// 355 missing
>         /// leavedu             /* age when left education (derived) */      
>                            /// 1,081 missing
>         pvlit1          /* literacy score: plausible value 1 (also 2-10 avail
> ) */       /// no missing
>         pvnum1          /* numeracy score: plausible value 1 (also 2-10 avail
> ) */       /// no missing
>         tenure          /* tenure = years in work for current employer */    
>                    /// 2 missing
>                                                                              
>                                                                            //

. // add second order terms here
. global continuous $continuous age_r2 tenure2

. 
. global discrete0                                                             
>                                                            ///             
>         b_q01a          /* education, highest level attained */              
>                            /// no missing
>         b_q01b          /* area of study */                                  
>                                                    /// 434 missing
>         d_q06c          /* part of a larger organization */                  
>                                    /// 13 missing
>         d_q08a          /* management position */                            
>                                            /// no missing
>         d_q09           /* type of contract */                               
>                                            /// 12 missing
>         d_q10_t1        /* hours per week at this job or business */         
>                    /// 1 missing
>         d_q14           /* job satisfaction */                               
>                                            /// 1 missing
>         i_q08           /* health status */                                  
>                                                    /// 2 missing
>         j_q02a          /* living with a partner */                          
>                                            /// 899 missing
>         j_q03d1_c       /* age of youngest child */                          
>                                            /// 2,718 missing
>         j_q04c1_c       /* immigration: age */                               
>                                            /// 4,375 missing
>         j_q06b          /* mother's highest level of educ */                 
>                            /// 445 missing
>         j_q07b          /* father's highest level of educ */                 
>                            /// 515 missing
>         j_q03b          /* number of children*/                              
>                                            /// 1,856 missing
>         impar           /* immigration: parents */                           
>                                            /// 21 missing
>         imgen           /* immigration: generation */                        
>                                    /// 344 missing
>         nfe12jr         /* informal job-related educ in prev 12 months */    
>                    /// 116 missing
>         nfe12njr        /* informal non-job-related educ in prev 12 months */
>            /// 116 missing
>                                                                              
>                                                                            //
>                                                                              
>                                                          

. global personality                                                           
>                                                            ///
>         i_q04b          /* Learning strategies, Relate new ideas into real li
> fe */      /// 16 missing
>         i_q04d          /* Learning strategies, Like learning new things */  
>                    /// no missing
>         i_q04h          /* Learning strategies, Attribute something new */   
>                    /// 10 missing
>         i_q04j          /* Learning strategies, Deal with difficult things */
>            /// no missing
>         i_q04l          /* Learning strategies, Fit different ideas together 
> */         /// 5 missing
>         i_q04m          /* Learning strategies, Looking for additional info *
> /          /// 1 missing
>         i_q05f          /* Cultural engagement, Voluntary non-profit work */ 
>            /// no missing
>         i_q06a          /* Political efficacy, No influence on the government
>  */        /// 14 missing
>         i_q07a          /* Social trust, Trust only few people */            
>                            /// 4 missing
>         i_q07b          /* Social trust, Other people take advantage of you *
> /          /// 6 missing
>                                                                              
>                                                                            //

. global discrete $discrete0                                                   
>                                                    ///
>         new_reg_tl2     /* geographical region */                            
>                                            /// 2 missing
>         new_isco1c      /* occupation */                                     
>                                                    /// no missing
>         new_isic1c      /* industry */                                       
>                                                    // no missing

. 
. global X_simple                                                         ///
>         i.(b_q01a d_q10_t1 j_q03b)                              ///
>         c.($continuous)

. 
. global X_fullinteracted                                         ///
>         i.($discrete0 )                                                 ///
>         i.new_isco1c#i.new_isic1c#i.new_reg_tl2 ///
>         c.($continuous)                  

.         
. global X_cont                                                           ///
>         c.($continuous)##i.($discrete)

. 
. global X_expanded                                                       ///
>         i.($discrete)                                                   ///
>         c.($continuous)                                                 ///
>         c.age_r#i.($discrete)                                   ///
>         c.tenure#i.($discrete)

. 
.         
. 
. *****************************************************************************
> ***
. ***  estimation sample
. *****************************************************************************
> ***
. 
. gen byte touse=1

. markout touse lnearn $X_expanded

. keep if touse
(53 observations deleted)

. 
. 
. *****************************************************************************
> ***
. ***  learners
. *****************************************************************************
> ***
. 
. global cores = 5

. 
. global rf1 min_samples_leaf(1)  max_features(sqrt) n_estimators(500)

. global rf2 min_samples_leaf(50)  max_features(sqrt) n_estimators(500)

. global rf3 min_samples_leaf(100)  max_features(sqrt) n_estimators(500)

. global grad1 n_estimators(500) n_iter_no_change(10)  

. global grad2 n_estimators(500)  

. global nnet1 hidden_layer_sizes(40 20 1 20 50) early_stopping 

. global nnet2 hidden_layer_sizes(30 30 30) early_stopping  

. 
. global pystring_reg0                                                         
>    || ///
>                                         m(ols)                               
>                            || ///
>                                         m(ols) xvars($X_simple)              
>            || ///
>                                         m(lassocv)                           
>                            || ///
>                                         m(ridgecv)                           
>                            || ///
>                                         m(lassocv)      xvars($X_cont)       
>            || ///
>                                         m(ridgecv)      xvars($X_cont)       
>            || ///
>                                         m(rf) opt($rf1)                      
>                    || ///
>                                         m(rf) opt($rf2)                      
>                    || ///
>                                         m(rf) opt($rf3)                      
>                    || ///
>                                         m(gradboost) opt($grad1)             
>            || ///
>                                         m(gradboost) opt($grad2)             
>            || ///
>                                         m(nnet) opt($nnet1)                  
>            || ///
>                                         m(nnet) opt($nnet2)                  
>            || //

. 
. global pystring_reg  $pystring_reg0 , type(reg) njobs($cores) 

.  
. global pystring_class0                                                       
>            || ///
>                                         m(logit)                             
>                            || ///
>                                         m(logit) xvars($X_simple)            
>            || ///
>                                         m(lassocv)                           
>                            || ///
>                                         m(ridgecv)                           
>                            || ///
>                                         m(lassocv)      xvars($X_cont)       
>            || ///
>                                         m(ridgecv)      xvars($X_cont)       
>            || ///
>                                         m(rf) opt($rf1)                      
>                    || ///
>                                         m(rf) opt($rf2)                      
>                    || ///
>                                         m(rf) opt($rf3)                      
>                    || ///
>                                         m(gradboost) opt($grad1)             
>            || ///
>                                         m(gradboost) opt($grad2)             
>            || ///
>                                         m(nnet) opt($nnet1)                  
>            || ///
>                                         m(nnet) opt($nnet2)                  
>            || //                   

.                                 
. global pystring_class $pystring_class0 , type(class) njobs($cores)

.                                         
. global R =1  

. global K=10 

. global L =13

.         
. *****************************************************************************
> *  
. *** ddml: estimation                                                         
>                                               ***
. *****************************************************************************
> *
. 
. if (`estimator'==1) {
. 
.         ddml init partial,  reps($R) kfolds($K)
.         ddml E[Y|X]: pystacked lnearn $X_expanded $pystring_reg
.         ddml E[D|X]: pystacked gender_r $X_expanded $pystring_reg
.         ddml crossfit, shortstack poolstack
.         ddml estimate, robust
.         
.         foreach mat in lnearn_mse gender_r_mse {
  2.                         ddml extract, show(mse)
  3.                         mat `mat' = r(`mat')
  4.                         mat list `mat'
  5.                                 preserve
  6.                                 svmat `mat'
  7.                                 keep `mat'*
  8.                                 keep if _n<=$L
  9.                                 gen stack_type = "conventional" if _n==1
 10.                                 replace stack_type = "pooled" if _n==2
 11.                                 replace stack_type = "short" if _n==3
 12.                                 gen model = "plm"
 13.                                 list if _n<=$L
 14.                                 save `folder'/`mat'_plm_mse, replace
 15.                                 restore 
 16.         }       
. 
.         cap drop mse_*
.         foreach var of varlist Y1_* {
  2.                  cap drop sqerr_`var'
  3.                  gen double sqerr_`var'=(lnearn-`var')^2
  4.                  sum sqerr_`var', meanonly
  5.                  gen double mse_`var'=r(mean) if _n ==1 
  6.         }
.         foreach var of varlist D1_* {
  2.                  cap drop sqerr_`var'
  3.                  gen double sqerr_`var'=(gender_r-`var')^2
  4.                  sum sqerr_`var', meanonly
  5.                  gen double mse_`var'=r(mean) if _n ==1 
  6.         }
.         preserve
.                 keep mse_*
.                 keep if _n==1
.                 save `folder'/plm_mse, replace
.         restore
.         cap drop mse_*
. 
.         ** initialize results file
.         regsave gender_r using `folder'/results.dta, ci addlabel(model,partia
> l,seed,`seed',final,init,learner,-99) replace
. 
.         foreach final in nnls1 singlebest ols avg {
  2. 
.                 ddml estimate, robust finalest(`final')
  3.         
.                         // regular stacking results
.                         ddml estimate, mname(m0) spec(st) replay  
  4.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,partial,seed,`seed',final,`final',learner,-1) append
  5.                         
.                         // shortstacking results
.                         ddml estimate, mname(m0) spec(ss) replay 
  6.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,partial,seed,`seed',final,`final',learner,-2) append
  7.                         
.                         // poolstacking results
.                         ddml estimate, mname(m0) spec(ps) replay  
  8.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,partial,seed,`seed',final,`final',learner,-3) append     
  9.                 
.                         // pystacked weights
.                         ddml extract, show(stweights)   
 10.                         foreach mat in Y1_pystacked_w_mn D1_pystacked_w_mn
>  {
 11.                                         ddml extract, show(stweights)   
 12.                                         mat `mat' = r(`mat')
 13.                                         mat list `mat'
 14.                                                 preserve
 15.                                                 svmat `mat'
 16.                                                 keep `mat'*
 17.                                                 list if _n<=4
 18.                                                 save `folder'/`mat'_`final
> '_regular, replace
 19.                                                 restore
 20.                         }       
 21.                         // shortstacked weights
.                         ddml extract, show(ssweights)
 22.                         foreach mat in Y_lnearn_ss D_gender_r_ss {
 23.                                         qui ddml extract, show(ssweights)
 24.                                         mat `mat' = r(`mat')
 25.                                         mat list `mat'
 26.                                                 preserve
 27.                                                 svmat `mat'
 28.                                                 keep `mat'*
 29.                                                 list if _n<=4
 30.                                                 save `folder'/`mat'_`final
> '_short, replace
 31.                                                 restore
 32.                         }       
 33.                         // poolstacked weights
. 
.                         foreach mat in Y_lnearn_ps D_gender_r_ps {
 34.                                         qui ddml extract, show(psweights)
 35.                                         mat `mat' = r(`mat')
 36.                                         mat list `mat'
 37.                                                 preserve
 38.                                                 svmat `mat'
 39.                                                 keep `mat'*
 40.                                                 list if _n<=4
 41.                                                 save `folder'/`mat'_`final
> '_pooled, replace
 42.                                                 restore
 43.                         }       
 44.         
.         }
. 
.         forvalues i = 1(1)$L {
  2.                         ddml estimate, y(Y1_pystacked_L`i'_1) ///
>                                                         d(D1_pystacked_L`i'_1
> ) robust
  3.                         regsave gender_r using `folder'/results.dta, ci //
> /
>                                                 addlabel(model,partial,seed,`
> seed',final,indiv,learner,`i') ///
>                                                 append
  4.         }
. 
. }

.         
. *****************************************************************************
> *  
. *** interactive: estimation                                                  
>                                       ***
. *****************************************************************************
> *
.         
. if (`estimator'==2) {   
. 
.         ddml init interactive, kfolds($K) reps($R)
.         ddml E[Y|X,D]: pystacked lnearn $X_expanded $pystring_reg
Learner Y1_pystacked added successfully.
.         ddml E[D|X]: pystacked gender_r $X_expanded $pystring_class
Learner D1_pystacked added successfully.
.         ddml crossfit, shortstack poolstack
Cross-fitting E[y|X,D] equation: lnearn
Cross-fitting fold 1 2 3 4 5 6 7 8 9 10 ...completed cross-fitting...completed 
> short-stacking...completed pooled-stacking
Cross-fitting E[D|X] equation: gender_r
Cross-fitting fold 1 2 3 4 5 6 7 8 9 10 ...completed cross-fitting...completed 
> short-stacking...completed pooled-stacking
.         ddml estimate, robust atet


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.071    (0.030)
  ss  1  [shortstack]          [ss]          [ss]    -0.066    (0.031)
  ps  1   [poolstack]          [ps]          [ps]    -0.074    (0.027)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0664318   .0313114    -2.12   0.034    -.1278011   -.0050626
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 7 propensity scores trimmed to lower limit .01.

. 
.         cap drop mse_*
.         foreach var of varlist Y1_pystacked0* {
  2.                  cap drop sqerr_`var'
  3.                  gen double sqerr_`var'=(lnearn-`var')^2 if gender_r==0
  4.                  sum sqerr_`var' if gender_r==0, meanonly
  5.                  gen double mse_`var'=r(mean) if _n ==1 
  6.         }
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
.         foreach var of varlist Y1_pystacked1* {
  2.                  cap drop sqerr_`var'
  3.                  gen double sqerr_`var'=(lnearn-`var')^2 if gender_r==1
  4.                  sum sqerr_`var' if gender_r==1, meanonly
  5.                  gen double mse_`var'=r(mean) if _n ==1 
  6.         }
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
.         foreach var of varlist D1_* {
  2.                  cap drop sqerr_`var'
  3.                  gen double sqerr_`var'=(gender_r-`var')^2
  4.                  sum sqerr_`var', meanonly
  5.                  gen double mse_`var'=r(mean) if _n ==1 
  6.         }
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
.         preserve
.                 keep mse_*
.                 keep if _n==1
(4,835 observations deleted)
.                 save `folder'/inter_mse, replace
(note: file out_232/inter_mse.dta not found)
file out_232/inter_mse.dta saved
.         restore
.         cap drop mse_*
.         
.         local mat gender_r_mse
.                         ddml extract, show(mse)

MSEs for gender_r:
                 rep   full smp      fold 1      fold 2      fold 3      fold 4
>       fold 5      fold 6      fold 7      fold 8      fold 9     fold 10 
    D1_pystacked   1      0.155       0.156       0.148       0.154       0.153
>        0.145       0.158       0.146       0.174       0.153       0.162  
   D_gender_r_ps   1      0.154       0.155       0.148       0.154       0.153
>        0.145       0.158       0.145       0.173       0.153       0.161  
   D_gender_r_ss   1      0.154       0.154       0.148       0.154       0.153
>        0.145       0.158       0.145       0.173       0.153       0.160  

MSEs for lnearn:
                D=  rep   full smp      fold 1      fold 2      fold 3      fol
> d 4      fold 5      fold 6      fold 7      fold 8      fold 9     fold 10 
    Y1_pystacked 0    1      0.225       0.198       0.200       0.552       0.
> 138       0.140       0.194       0.215       0.259       0.143       0.206  
    Y1_pystacked 1    1      0.175       0.220       0.236       0.186       0.
> 141       0.119       0.181       0.201       0.169       0.150       0.145  
     Y_lnearn_ps 0    1      8.299       8.212       8.229       8.191       8.
> 321       8.490       8.684       7.954       8.410       8.280       8.201  
     Y_lnearn_ps 1    1      7.486       7.413       7.425       7.627       7.
> 530       7.627       7.407       7.459       7.556       7.445       7.363  
     Y_lnearn_ss 0    1      0.223       0.196       0.198       0.539       0.
> 136       0.140       0.193       0.214       0.255       0.143       0.204  
     Y_lnearn_ss 1    1      0.174       0.210       0.237       0.185       0.
> 140       0.120       0.179       0.201       0.171       0.149       0.145  
.                         mat `mat' = r(`mat')
.                         mat list `mat'

gender_r_mse[3,12]
                      rep  full_sample        fold1        fold2        fold3
D1_pystacked            1     .1549924     .1561224     .1480895    .15432422
D_gender_r~s            1    .15441958     .1548987    .14792015     .1543197
D_gender_r~s            1    .15426738    .15395313    .14763151    .15410569

                    fold4        fold5        fold6        fold7        fold8
D1_pystacked    .15336921    .14514872    .15788645    .14620103    .17353362
D_gender_r~s    .15251548    .14485493      .157684    .14527455    .17276341
D_gender_r~s    .15316216    .14453314    .15769783    .14503897    .17309059

                    fold9       fold10
D1_pystacked    .15308703    .16220703
D_gender_r~s    .15320413    .16080613
D_gender_r~s    .15335617    .16014958
.                                 preserve
.                                 svmat `mat'
.                                 keep `mat'*
.                                 keep if _n<=$L
(4,823 observations deleted)
.                                 gen stack_type = "conventional" if _n==1
(12 missing values generated)
.                                 replace stack_type = "pooled" if _n==2
(1 real change made)
.                                 replace stack_type = "short" if _n==3
(1 real change made)
.                                 gen model = "interactive"
.                                 list if _n<=$L

     +-----------------------------------------------------------------+
  1. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        1 | .1549924 | .1561224 | .1480895 | .1543242 | .1533692 |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     | .1451487 | .1578865 |  .146201 | .1735336 |  .153087 |  .162207 |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |          conventional          |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  2. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        1 | .1544196 | .1548987 | .1479202 | .1543197 | .1525155 |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     | .1448549 |  .157684 | .1452745 | .1727634 | .1532041 | .1608061 |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                pooled          |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  3. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        1 | .1542674 | .1539531 | .1476315 | .1541057 | .1531622 |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     | .1445331 | .1576978 |  .145039 | .1730906 | .1533562 | .1601496 |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                 short          |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  4. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  5. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  6. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  7. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  8. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  9. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 10. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 11. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 12. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 13. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+
.                                 save `folder'/`mat'_inter_gender_mse, replace
(note: file out_232/gender_r_mse_inter_gender_mse.dta not found)
file out_232/gender_r_mse_inter_gender_mse.dta saved
.                                 restore 
.                                 
.         local mat lnearn_mse
.                         ddml extract, show(mse)

MSEs for gender_r:
                 rep   full smp      fold 1      fold 2      fold 3      fold 4
>       fold 5      fold 6      fold 7      fold 8      fold 9     fold 10 
    D1_pystacked   1      0.155       0.156       0.148       0.154       0.153
>        0.145       0.158       0.146       0.174       0.153       0.162  
   D_gender_r_ps   1      0.154       0.155       0.148       0.154       0.153
>        0.145       0.158       0.145       0.173       0.153       0.161  
   D_gender_r_ss   1      0.154       0.154       0.148       0.154       0.153
>        0.145       0.158       0.145       0.173       0.153       0.160  

MSEs for lnearn:
                D=  rep   full smp      fold 1      fold 2      fold 3      fol
> d 4      fold 5      fold 6      fold 7      fold 8      fold 9     fold 10 
    Y1_pystacked 0    1      0.225       0.198       0.200       0.552       0.
> 138       0.140       0.194       0.215       0.259       0.143       0.206  
    Y1_pystacked 1    1      0.175       0.220       0.236       0.186       0.
> 141       0.119       0.181       0.201       0.169       0.150       0.145  
     Y_lnearn_ps 0    1      8.299       8.212       8.229       8.191       8.
> 321       8.490       8.684       7.954       8.410       8.280       8.201  
     Y_lnearn_ps 1    1      7.486       7.413       7.425       7.627       7.
> 530       7.627       7.407       7.459       7.556       7.445       7.363  
     Y_lnearn_ss 0    1      0.223       0.196       0.198       0.539       0.
> 136       0.140       0.193       0.214       0.255       0.143       0.204  
     Y_lnearn_ss 1    1      0.174       0.210       0.237       0.185       0.
> 140       0.120       0.179       0.201       0.171       0.149       0.145  
.                         mat `mat' = r(`mat')
.                         mat list `mat'

lnearn_mse[6,13]
                    D=0/1          rep  full_sample        fold1        fold2
Y1_pystacked            0            1    .22544354    .19821299    .19966651
Y1_pystacked            1            1    .17491166    .21994121    .23589071
 Y_lnearn_ps            0            1    8.2988173    8.2122699    8.2290789
 Y_lnearn_ps            1            1    7.4855398    7.4133186    7.4248548
 Y_lnearn_ss            0            1    .22287655    .19641924    .19831594
 Y_lnearn_ss            1            1    .17393117    .21029449    .23660101

                    fold3        fold4        fold5        fold6        fold7
Y1_pystacked    .55166778    .13789876    .13972511    .19386129    .21529912
Y1_pystacked    .18565508    .14119525    .11926786    .18124807    .20103728
 Y_lnearn_ps    8.1913932    8.3206078    8.4899961     8.683516    7.9538381
 Y_lnearn_ps    7.6270687    7.5299529    7.6272598    7.4071493    7.4592593
 Y_lnearn_ss    .53904423    .13630944    .13969804    .19332639    .21377842
 Y_lnearn_ss    .18502295    .14013413    .11961868    .17939875    .20101884

                    fold8        fold9       fold10
Y1_pystacked    .25856933    .14290208    .20610292
Y1_pystacked     .1686777    .14995702    .14465694
 Y_lnearn_ps    8.4098837    8.2800366     8.200603
 Y_lnearn_ps    7.5555934    7.4454328    7.3626337
 Y_lnearn_ss    .25497135     .1432412    .20352271
 Y_lnearn_ss    .17142607     .1488376    .14524117
.                                 preserve
.                                 svmat `mat'
.                                 keep `mat'*
.                                 keep if _n<=(2*$L)
(4,810 observations deleted)
.                                 gen stack_type = "conventional" if _n<=2
(24 missing values generated)
.                                 replace stack_type = "pooled" if _n>=3 & _n<=
> 4
(2 real changes made)
.                                 replace stack_type = "short" if _n>4
(22 real changes made)
.                                 gen model = "interactive"
.                                 list if _n<=(2*$L)

     +-----------------------------------------------------------------+
  1. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        0 |        1 | .2254435 |  .198213 | .1996665 | .5516677 |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     | .1378988 | .1397251 | .1938613 | .2152991 | .2585693 | .1429021 |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |     .2061029     |     conventional      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  2. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        1 |        1 | .1749117 | .2199412 | .2358907 | .1856551 |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     | .1411953 | .1192679 | .1812481 | .2010373 | .1686777 |  .149957 |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |     .1446569     |     conventional      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  3. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        0 |        1 | 8.298818 |  8.21227 | 8.229079 | 8.191393 |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     | 8.320608 | 8.489996 | 8.683517 | 7.953838 | 8.409883 | 8.280037 |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |     8.200603     |           pooled      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  4. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        1 |        1 |  7.48554 | 7.413319 | 7.424855 | 7.627069 |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     | 7.529953 |  7.62726 | 7.407149 |  7.45926 | 7.555593 | 7.445433 |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |     7.362634     |           pooled      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  5. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        0 |        1 | .2228765 | .1964192 | .1983159 | .5390442 |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     | .1363094 |  .139698 | .1933264 | .2137784 | .2549714 | .1432412 |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |     .2035227     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  6. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        1 |        1 | .1739312 | .2102945 |  .236601 |  .185023 |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     | .1401341 | .1196187 | .1793987 | .2010188 | .1714261 | .1488376 |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |     .1452412     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  7. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  8. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  9. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 10. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 11. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 12. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 13. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 14. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 15. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 16. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 17. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 18. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 19. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 20. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 21. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 22. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 23. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 24. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 25. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 26. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+
.                                 save `folder'/`mat'_inter_lnearn_mse, replace
(note: file out_232/lnearn_mse_inter_lnearn_mse.dta not found)
file out_232/lnearn_mse_inter_lnearn_mse.dta saved
.                                 restore 
.         
.         foreach final in nnls1 singlebest ols avg {
  2. 
.                 ddml estimate, robust finalest(`final') atet
  3.         
.                         // regular stacking results
.                         ddml estimate, mname(m0) spec(st) replay atet
  4.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,interactive,seed,`seed',final,`final',learner,-1) append
  5.                         
.                         // shortstacking results
.                         ddml estimate, mname(m0) spec(ss) replay atet
  6.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,interactive,seed,`seed',final,`final',learner,-2) append
  7.                         
.                         // poolstacking results
.                         ddml estimate, mname(m0) spec(ps) replay atet
  8.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,interactive,seed,`seed',final,`final',learner,-3) append
  9.                 
.                         // pystacked weights
.                         ddml extract, show(stweights)
 10.                         foreach mat in Y1_pystacked_w_mn D1_pystacked_w_mn
>  {
 11.                                         ddml extract, show(stweights)
 12.                                         mat `mat' = r(`mat')
 13.                                         mat list `mat'
 14.                                                 preserve
 15.                                                 svmat `mat'
 16.                                                 keep `mat'*
 17.                                                 list if _n<=8
 18.                                                 save `folder'/`mat'_`final
> '_regular_ia, replace
 19.                                                 restore
 20.                         }       
 21.                         // shortstacked weights
.                         ddml extract, show(ssweights)
 22.                         foreach mat in Y_lnearn_ss D_gender_r_ss {
 23.                                         ddml extract, show(ssweights)
 24.                                         mat `mat' = r(`mat')
 25.                                         mat list `mat'
 26.                                                 preserve
 27.                                                 svmat `mat'
 28.                                                 keep `mat'*
 29.                                                 list if _n<=8
 30.                                                 save `folder'/`mat'_`final
> '_short_ia, replace
 31.                                                 restore
 32.                         }       
 33.                         // poolstacked weights
.                         ddml extract, show(psweights)
 34.                         foreach mat in Y_lnearn_ps D_gender_r_ps {
 35.                                         ddml extract, show(psweights)
 36.                                         mat `mat' = r(`mat')
 37.                                         mat list `mat'
 38.                                                 preserve
 39.                                                 svmat `mat'
 40.                                                 keep `mat'*
 41.                                                 list if _n<=8
 42.                                                 save `folder'/`mat'_`final
> '_pooled_ia, replace
 43.                                                 restore
 44.                         }       
 45.         
.         }


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.071    (0.030)
  ss  1  [shortstack]          [ss]          [ss]    -0.066    (0.031)
  ps  1   [poolstack]          [ps]          [ps]    -0.074    (0.027)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0664318   .0313114    -2.12   0.034    -.1278011   -.0050626
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 7 propensity scores trimmed to lower limit .01.



Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.071    (0.030)
  ss  1  [shortstack]          [ss]          [ss]    -0.066    (0.031)
  ps  1   [poolstack]          [ps]          [ps]    -0.074    (0.027)

Stacking DDML model (ATET)
E[y|X,D=0]   = Y1_pystacked0_1                     Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1
E[D|X]       = D1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0705326   .0298804    -2.36   0.018    -.1290971   -.0119681
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 6 propensity scores trimmed to lower limit .01.

(note: variable final was str5, now str10 to accommodate using data's values)
file out_232/results.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  ss  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.066    (0.031)
  ss  1  [shortstack]          [ss]          [ss]    -0.066    (0.031)
  ps  1   [poolstack]          [ps]          [ps]    -0.074    (0.027)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0664318   .0313114    -2.12   0.034    -.1278011   -.0050626
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 7 propensity scores trimmed to lower limit .01.

(note: variable final was str5, now str10 to accommodate using data's values)
file out_232/results.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  ps  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.074    (0.027)
  ss  1  [shortstack]          [ss]          [ss]    -0.066    (0.031)
  ps  1   [poolstack]          [ps]          [ps]    -0.074    (0.027)

Poolstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ps0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ps1
E[D|X]       = D_gender_r_ps_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0737664   .0273365    -2.70   0.007     -.127345   -.0201879
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 6 propensity scores trimmed to lower limit .01.

(note: variable final was str5, now str10 to accommodate using data's values)
file out_232/results.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .23017664    .23017664
    logit            2    1.218e-16    1.218e-16
  lassocv            3    .13861171    .13861171
  ridgecv            4    .05950646    .05950646
  lassocv            5    .03282575    .03282575
  ridgecv            6    .00042859    .00042859
       rf            7    .26321295    .26321295
       rf            8    2.765e-17    2.765e-17
       rf            9    4.433e-17    4.433e-17
gradboost           10    .04734108    .04734108
gradboost           11    .21203858    .21203858
     nnet           12    5.263e-17    5.263e-17
     nnet           13    .01585824    .01585824

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .02074992    .02074992
      ols            2            0    .00384675    .00384675
  lassocv            3            0    .09058348    .09058348
  ridgecv            4            0    .19069337    .19069337
  lassocv            5            0    .03927587    .03927587
  ridgecv            6            0    .00005983    .00005983
       rf            7            0    .43873399    .43873399
       rf            8            0    7.914e-17    7.914e-17
       rf            9            0    8.042e-17    8.042e-17
gradboost           10            0    .03568207    .03568207
gradboost           11            0     .1607869     .1607869
     nnet           12            0    .00901073    .00901073
     nnet           13            0    .01057709    .01057709
      ols            1            1    .01444399    .01444399
      ols            2            1    3.028e-17    3.028e-17
  lassocv            3            1    .11670196    .11670196
  ridgecv            4            1    .05006137    .05006137
  lassocv            5            1    .12598011    .12598011
  ridgecv            6            1    .05589062    .05589062
       rf            7            1    .51578663    .51578663
       rf            8            1    6.696e-17    6.696e-17
       rf            9            1    8.435e-17    8.435e-17
gradboost           10            1    .01362793    .01362793
gradboost           11            1    .06024887    .06024887
     nnet           12            1     .0225768     .0225768
     nnet           13            1    .02468172    .02468172

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .23017664    .23017664
    logit            2    1.218e-16    1.218e-16
  lassocv            3    .13861171    .13861171
  ridgecv            4    .05950646    .05950646
  lassocv            5    .03282575    .03282575
  ridgecv            6    .00042859    .00042859
       rf            7    .26321295    .26321295
       rf            8    2.765e-17    2.765e-17
       rf            9    4.433e-17    4.433e-17
gradboost           10    .04734108    .04734108
gradboost           11    .21203858    .21203858
     nnet           12    5.263e-17    5.263e-17
     nnet           13    .01585824    .01585824

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .02074992    .02074992
      ols            2            0    .00384675    .00384675
  lassocv            3            0    .09058348    .09058348
  ridgecv            4            0    .19069337    .19069337
  lassocv            5            0    .03927587    .03927587
  ridgecv            6            0    .00005983    .00005983
       rf            7            0    .43873399    .43873399
       rf            8            0    7.914e-17    7.914e-17
       rf            9            0    8.042e-17    8.042e-17
gradboost           10            0    .03568207    .03568207
gradboost           11            0     .1607869     .1607869
     nnet           12            0    .00901073    .00901073
     nnet           13            0    .01057709    .01057709
      ols            1            1    .01444399    .01444399
      ols            2            1    3.028e-17    3.028e-17
  lassocv            3            1    .11670196    .11670196
  ridgecv            4            1    .05006137    .05006137
  lassocv            5            1    .12598011    .12598011
  ridgecv            6            1    .05589062    .05589062
       rf            7            1    .51578663    .51578663
       rf            8            1    6.696e-17    6.696e-17
       rf            9            1    8.435e-17    8.435e-17
gradboost           10            1    .01362793    .01362793
gradboost           11            1    .06024887    .06024887
     nnet           12            1     .0225768     .0225768
     nnet           13            1    .02468172    .02468172

Y1_pystacked_w_mn[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .02074992    .02074992
      ols            2            0    .00384675    .00384675
  lassocv            3            0    .09058348    .09058348
  ridgecv            4            0    .19069337    .19069337
  lassocv            5            0    .03927587    .03927587
  ridgecv            6            0    .00005983    .00005983
       rf            7            0    .43873399    .43873399
       rf            8            0    7.914e-17    7.914e-17
       rf            9            0    8.042e-17    8.042e-17
gradboost           10            0    .03568207    .03568207
gradboost           11            0     .1607869     .1607869
     nnet           12            0    .00901073    .00901073
     nnet           13            0    .01057709    .01057709
      ols            1            1    .01444399    .01444399
      ols            2            1    3.028e-17    3.028e-17
  lassocv            3            1    .11670196    .11670196
  ridgecv            4            1    .05006137    .05006137
  lassocv            5            1    .12598011    .12598011
  ridgecv            6            1    .05589062    .05589062
       rf            7            1    .51578663    .51578663
       rf            8            1    6.696e-17    6.696e-17
       rf            9            1    8.435e-17    8.435e-17
gradboost           10            1    .01362793    .01362793
gradboost           11            1    .06024887    .06024887
     nnet           12            1     .0225768     .0225768
     nnet           13            1    .02468172    .02468172

      +-------------------------------------------+
      | Y1_pys~1   Y1_pys~2   Y1_pys~3   Y1_pys~4 |
      |-------------------------------------------|
   1. |        1          0   .0207499   .0207499 |
   2. |        2          0   .0038467   .0038467 |
   3. |        3          0   .0905835   .0905835 |
   4. |        4          0   .1906934   .1906934 |
   5. |        5          0   .0392759   .0392759 |
      |-------------------------------------------|
   6. |        6          0   .0000598   .0000598 |
   7. |        7          0    .438734    .438734 |
   8. |        8          0   7.91e-17   7.91e-17 |
      +-------------------------------------------+
(note: file out_232/Y1_pystacked_w_mn_nnls1_regular_ia.dta not found)
file out_232/Y1_pystacked_w_mn_nnls1_regular_ia.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .23017664    .23017664
    logit            2    1.218e-16    1.218e-16
  lassocv            3    .13861171    .13861171
  ridgecv            4    .05950646    .05950646
  lassocv            5    .03282575    .03282575
  ridgecv            6    .00042859    .00042859
       rf            7    .26321295    .26321295
       rf            8    2.765e-17    2.765e-17
       rf            9    4.433e-17    4.433e-17
gradboost           10    .04734108    .04734108
gradboost           11    .21203858    .21203858
     nnet           12    5.263e-17    5.263e-17
     nnet           13    .01585824    .01585824

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .02074992    .02074992
      ols            2            0    .00384675    .00384675
  lassocv            3            0    .09058348    .09058348
  ridgecv            4            0    .19069337    .19069337
  lassocv            5            0    .03927587    .03927587
  ridgecv            6            0    .00005983    .00005983
       rf            7            0    .43873399    .43873399
       rf            8            0    7.914e-17    7.914e-17
       rf            9            0    8.042e-17    8.042e-17
gradboost           10            0    .03568207    .03568207
gradboost           11            0     .1607869     .1607869
     nnet           12            0    .00901073    .00901073
     nnet           13            0    .01057709    .01057709
      ols            1            1    .01444399    .01444399
      ols            2            1    3.028e-17    3.028e-17
  lassocv            3            1    .11670196    .11670196
  ridgecv            4            1    .05006137    .05006137
  lassocv            5            1    .12598011    .12598011
  ridgecv            6            1    .05589062    .05589062
       rf            7            1    .51578663    .51578663
       rf            8            1    6.696e-17    6.696e-17
       rf            9            1    8.435e-17    8.435e-17
gradboost           10            1    .01362793    .01362793
gradboost           11            1    .06024887    .06024887
     nnet           12            1     .0225768     .0225768
     nnet           13            1    .02468172    .02468172

D1_pystacked_w_mn[13,3]
               learner  mean_weight        rep_1
    logit            1    .23017664    .23017664
    logit            2    1.218e-16    1.218e-16
  lassocv            3    .13861171    .13861171
  ridgecv            4    .05950646    .05950646
  lassocv            5    .03282575    .03282575
  ridgecv            6    .00042859    .00042859
       rf            7    .26321295    .26321295
       rf            8    2.765e-17    2.765e-17
       rf            9    4.433e-17    4.433e-17
gradboost           10    .04734108    .04734108
gradboost           11    .21203858    .21203858
     nnet           12    5.263e-17    5.263e-17
     nnet           13    .01585824    .01585824

      +--------------------------------+
      | D1_pys~1   D1_pys~2   D1_pys~3 |
      |--------------------------------|
   1. |        1   .2301766   .2301766 |
   2. |        2   1.22e-16   1.22e-16 |
   3. |        3   .1386117   .1386117 |
   4. |        4   .0595065   .0595065 |
   5. |        5   .0328258   .0328258 |
      |--------------------------------|
   6. |        6   .0004286   .0004286 |
   7. |        7   .2632129   .2632129 |
   8. |        8   2.77e-17   2.77e-17 |
      +--------------------------------+
(note: file out_232/D1_pystacked_w_mn_nnls1_regular_ia.dta not found)
file out_232/D1_pystacked_w_mn_nnls1_regular_ia.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .19940157    .19940157
    logit            2    2.560e-17    2.560e-17
  lassocv            3    .08331843    .08331843
  ridgecv            4    .09365901    .09365901
  lassocv            5    8.485e-17    8.485e-17
  ridgecv            6    3.662e-17    3.662e-17
       rf            7    .26280113    .26280113
       rf            8    7.845e-18    7.845e-18
       rf            9    4.698e-17    4.698e-17
gradboost           10    6.081e-17    6.081e-17
gradboost           11    .30639791    .30639791
     nnet           12    1.035e-16    1.035e-16
     nnet           13    .05442195    .05442195

short-stacked weights across resamples for lnearn
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0     .0079237     .0079237
      ols            2            0    2.740e-16    2.740e-16
  lassocv            3            0    .11095249    .11095249
  ridgecv            4            0    .17734155    .17734155
  lassocv            5            0    6.367e-18    6.367e-18
  ridgecv            6            0            0            0
       rf            7            0    .48269065    .48269065
       rf            8            0            0            0
       rf            9            0    2.086e-16    2.086e-16
gradboost           10            0    3.330e-17    3.330e-17
gradboost           11            0    .19013204    .19013204
     nnet           12            0    2.327e-16    2.327e-16
     nnet           13            0    .03095957    .03095957
      ols            1            1    .02083174    .02083174
      ols            2            1    7.436e-17    7.436e-17
  lassocv            3            1    .02579814    .02579814
  ridgecv            4            1            0            0
  lassocv            5            1    .22798357    .22798357
  ridgecv            6            1     .0860897     .0860897
       rf            7            1    .56359249    .56359249
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1    .02432458    .02432458
     nnet           12            1            0            0
     nnet           13            1    .05137978    .05137978

short-stacked weights across resamples for gender_r
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .19940157    .19940157
    logit            2    2.560e-17    2.560e-17
  lassocv            3    .08331843    .08331843
  ridgecv            4    .09365901    .09365901
  lassocv            5    8.485e-17    8.485e-17
  ridgecv            6    3.662e-17    3.662e-17
       rf            7    .26280113    .26280113
       rf            8    7.845e-18    7.845e-18
       rf            9    4.698e-17    4.698e-17
gradboost           10    6.081e-17    6.081e-17
gradboost           11    .30639791    .30639791
     nnet           12    1.035e-16    1.035e-16
     nnet           13    .05442195    .05442195

short-stacked weights across resamples for lnearn
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0     .0079237     .0079237
      ols            2            0    2.740e-16    2.740e-16
  lassocv            3            0    .11095249    .11095249
  ridgecv            4            0    .17734155    .17734155
  lassocv            5            0    6.367e-18    6.367e-18
  ridgecv            6            0            0            0
       rf            7            0    .48269065    .48269065
       rf            8            0            0            0
       rf            9            0    2.086e-16    2.086e-16
gradboost           10            0    3.330e-17    3.330e-17
gradboost           11            0    .19013204    .19013204
     nnet           12            0    2.327e-16    2.327e-16
     nnet           13            0    .03095957    .03095957
      ols            1            1    .02083174    .02083174
      ols            2            1    7.436e-17    7.436e-17
  lassocv            3            1    .02579814    .02579814
  ridgecv            4            1            0            0
  lassocv            5            1    .22798357    .22798357
  ridgecv            6            1     .0860897     .0860897
       rf            7            1    .56359249    .56359249
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1    .02432458    .02432458
     nnet           12            1            0            0
     nnet           13            1    .05137978    .05137978

Y_lnearn_ss[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0     .0079237     .0079237
      ols            2            0    2.740e-16    2.740e-16
  lassocv            3            0    .11095249    .11095249
  ridgecv            4            0    .17734155    .17734155
  lassocv            5            0    6.367e-18    6.367e-18
  ridgecv            6            0            0            0
       rf            7            0    .48269065    .48269065
       rf            8            0            0            0
       rf            9            0    2.086e-16    2.086e-16
gradboost           10            0    3.330e-17    3.330e-17
gradboost           11            0    .19013204    .19013204
     nnet           12            0    2.327e-16    2.327e-16
     nnet           13            0    .03095957    .03095957
      ols            1            1    .02083174    .02083174
      ols            2            1    7.436e-17    7.436e-17
  lassocv            3            1    .02579814    .02579814
  ridgecv            4            1            0            0
  lassocv            5            1    .22798357    .22798357
  ridgecv            6            1     .0860897     .0860897
       rf            7            1    .56359249    .56359249
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1    .02432458    .02432458
     nnet           12            1            0            0
     nnet           13            1    .05137978    .05137978

      +-------------------------------------------------------------------+
      | Y_lne~1_1   Y_lne~0_1   Y_lne~s1   Y_lnea~2   Y_lnea~3   Y_lnea~4 |
      |-------------------------------------------------------------------|
   1. | 2.5104393   2.7263376          1          0   .0079237   .0079237 |
   2. |  3.012253   3.2502484          2          0   2.74e-16   2.74e-16 |
   3. | 2.8340781   2.8540215          3          0   .1109525   .1109525 |
   4. | 2.5082076   2.5358795          4          0   .1773416   .1773416 |
   5. | 3.1387071   3.1131955          5          0   6.37e-18   6.37e-18 |
      |-------------------------------------------------------------------|
   6. | 2.5708495    2.714363          6          0          0          0 |
   7. | 2.4554447   2.7025838          7          0   .4826906   .4826906 |
   8. |  2.617336   2.7603398          8          0          0          0 |
      +-------------------------------------------------------------------+
(note: file out_232/Y_lnearn_ss_nnls1_short_ia.dta not found)
file out_232/Y_lnearn_ss_nnls1_short_ia.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .19940157    .19940157
    logit            2    2.560e-17    2.560e-17
  lassocv            3    .08331843    .08331843
  ridgecv            4    .09365901    .09365901
  lassocv            5    8.485e-17    8.485e-17
  ridgecv            6    3.662e-17    3.662e-17
       rf            7    .26280113    .26280113
       rf            8    7.845e-18    7.845e-18
       rf            9    4.698e-17    4.698e-17
gradboost           10    6.081e-17    6.081e-17
gradboost           11    .30639791    .30639791
     nnet           12    1.035e-16    1.035e-16
     nnet           13    .05442195    .05442195

short-stacked weights across resamples for lnearn
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0     .0079237     .0079237
      ols            2            0    2.740e-16    2.740e-16
  lassocv            3            0    .11095249    .11095249
  ridgecv            4            0    .17734155    .17734155
  lassocv            5            0    6.367e-18    6.367e-18
  ridgecv            6            0            0            0
       rf            7            0    .48269065    .48269065
       rf            8            0            0            0
       rf            9            0    2.086e-16    2.086e-16
gradboost           10            0    3.330e-17    3.330e-17
gradboost           11            0    .19013204    .19013204
     nnet           12            0    2.327e-16    2.327e-16
     nnet           13            0    .03095957    .03095957
      ols            1            1    .02083174    .02083174
      ols            2            1    7.436e-17    7.436e-17
  lassocv            3            1    .02579814    .02579814
  ridgecv            4            1            0            0
  lassocv            5            1    .22798357    .22798357
  ridgecv            6            1     .0860897     .0860897
       rf            7            1    .56359249    .56359249
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1    .02432458    .02432458
     nnet           12            1            0            0
     nnet           13            1    .05137978    .05137978

D_gender_r_ss[13,3]
               learner  mean_weight        rep_1
    logit            1    .19940157    .19940157
    logit            2    2.560e-17    2.560e-17
  lassocv            3    .08331843    .08331843
  ridgecv            4    .09365901    .09365901
  lassocv            5    8.485e-17    8.485e-17
  ridgecv            6    3.662e-17    3.662e-17
       rf            7    .26280113    .26280113
       rf            8    7.845e-18    7.845e-18
       rf            9    4.698e-17    4.698e-17
gradboost           10    6.081e-17    6.081e-17
gradboost           11    .30639791    .30639791
     nnet           12    1.035e-16    1.035e-16
     nnet           13    .05442195    .05442195

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .80204087          1   .1994016   .1994016 |
   2. | .39762614          2   2.56e-17   2.56e-17 |
   3. | .09485327          3   .0833184   .0833184 |
   4. | .20426802          4    .093659    .093659 |
   5. | .47719515          5   8.49e-17   8.49e-17 |
      |--------------------------------------------|
   6. | .84397355          6   3.66e-17   3.66e-17 |
   7. | .80803526          7   .2628011   .2628011 |
   8. | .88619549          8   7.84e-18   7.84e-18 |
      +--------------------------------------------+
(note: file out_232/D_gender_r_ss_nnls1_short_ia.dta not found)
file out_232/D_gender_r_ss_nnls1_short_ia.dta saved

pool-stacked weights across resamples for gender_r
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .25043817    .25043817
    logit            2    7.514e-16    7.514e-16
  lassocv            3    .17501211    .17501211
  ridgecv            4    .04580804    .04580804
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7    .28456166    .28456166
       rf            8    4.264e-16    4.264e-16
       rf            9            0            0
gradboost           10    .00702041    .00702041
gradboost           11    .23094861    .23094861
     nnet           12    7.958e-16    7.958e-16
     nnet           13      .006211      .006211

pool-stacked weights across resamples for lnearn
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .01327507    .01327507
      ols            2            0    5.721e-16    5.721e-16
  lassocv            3            0    .11550615    .11550615
  ridgecv            4            0    .21568201    .21568201
  lassocv            5            0            0            0
  ridgecv            6            0    3.600e-16    3.600e-16
       rf            7            0    .47231138    .47231138
       rf            8            0            0            0
       rf            9            0    3.543e-17    3.543e-17
gradboost           10            0    1.652e-16    1.652e-16
gradboost           11            0    .17883172    .17883172
     nnet           12            0            0            0
     nnet           13            0    .00439367    .00439367
      ols            1            1    .00948481    .00948481
      ols            2            1    1.318e-16    1.318e-16
  lassocv            3            1    .24309138    .24309138
  ridgecv            4            1    .05158534    .05158534
  lassocv            5            1     .0279994     .0279994
  ridgecv            6            1      .030056      .030056
       rf            7            1     .5401405     .5401405
       rf            8            1            0            0
       rf            9            1    7.340e-17    7.340e-17
gradboost           10            1    6.647e-18    6.647e-18
gradboost           11            1    .07125498    .07125498
     nnet           12            1            0            0
     nnet           13            1     .0263876     .0263876

pool-stacked weights across resamples for gender_r
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .25043817    .25043817
    logit            2    7.514e-16    7.514e-16
  lassocv            3    .17501211    .17501211
  ridgecv            4    .04580804    .04580804
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7    .28456166    .28456166
       rf            8    4.264e-16    4.264e-16
       rf            9            0            0
gradboost           10    .00702041    .00702041
gradboost           11    .23094861    .23094861
     nnet           12    7.958e-16    7.958e-16
     nnet           13      .006211      .006211

pool-stacked weights across resamples for lnearn
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .01327507    .01327507
      ols            2            0    5.721e-16    5.721e-16
  lassocv            3            0    .11550615    .11550615
  ridgecv            4            0    .21568201    .21568201
  lassocv            5            0            0            0
  ridgecv            6            0    3.600e-16    3.600e-16
       rf            7            0    .47231138    .47231138
       rf            8            0            0            0
       rf            9            0    3.543e-17    3.543e-17
gradboost           10            0    1.652e-16    1.652e-16
gradboost           11            0    .17883172    .17883172
     nnet           12            0            0            0
     nnet           13            0    .00439367    .00439367
      ols            1            1    .00948481    .00948481
      ols            2            1    1.318e-16    1.318e-16
  lassocv            3            1    .24309138    .24309138
  ridgecv            4            1    .05158534    .05158534
  lassocv            5            1     .0279994     .0279994
  ridgecv            6            1      .030056      .030056
       rf            7            1     .5401405     .5401405
       rf            8            1            0            0
       rf            9            1    7.340e-17    7.340e-17
gradboost           10            1    6.647e-18    6.647e-18
gradboost           11            1    .07125498    .07125498
     nnet           12            1            0            0
     nnet           13            1     .0263876     .0263876

Y_lnearn_ps[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .01327507    .01327507
      ols            2            0    5.721e-16    5.721e-16
  lassocv            3            0    .11550615    .11550615
  ridgecv            4            0    .21568201    .21568201
  lassocv            5            0            0            0
  ridgecv            6            0    3.600e-16    3.600e-16
       rf            7            0    .47231138    .47231138
       rf            8            0            0            0
       rf            9            0    3.543e-17    3.543e-17
gradboost           10            0    1.652e-16    1.652e-16
gradboost           11            0    .17883172    .17883172
     nnet           12            0            0            0
     nnet           13            0    .00439367    .00439367
      ols            1            1    .00948481    .00948481
      ols            2            1    1.318e-16    1.318e-16
  lassocv            3            1    .24309138    .24309138
  ridgecv            4            1    .05158534    .05158534
  lassocv            5            1     .0279994     .0279994
  ridgecv            6            1      .030056      .030056
       rf            7            1     .5401405     .5401405
       rf            8            1            0            0
       rf            9            1    7.340e-17    7.340e-17
gradboost           10            1    6.647e-18    6.647e-18
gradboost           11            1    .07125498    .07125498
     nnet           12            1            0            0
     nnet           13            1     .0263876     .0263876

      +-------------------------------------------------------------------+
      | Y_lne~1_1   Y_lne~0_1   Y_lne~s1   Y_lnea~2   Y_lnea~3   Y_lnea~4 |
      |-------------------------------------------------------------------|
   1. | 2.5194837   2.7258667          1          0   .0132751   .0132751 |
   2. | 3.0094251   3.2471907          2          0   5.72e-16   5.72e-16 |
   3. | 2.8275724   2.8585633          3          0   .1155061   .1155061 |
   4. |  2.485817   2.5300391          4          0    .215682    .215682 |
   5. | 3.1527821   3.1115878          5          0          0          0 |
      |-------------------------------------------------------------------|
   6. | 2.5640307   2.7132379          6          0   3.60e-16   3.60e-16 |
   7. | 2.4453562   2.6671097          7          0   .4723114   .4723114 |
   8. |  2.625576   2.7437865          8          0          0          0 |
      +-------------------------------------------------------------------+
(note: file out_232/Y_lnearn_ps_nnls1_pooled_ia.dta not found)
file out_232/Y_lnearn_ps_nnls1_pooled_ia.dta saved

pool-stacked weights across resamples for gender_r
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .25043817    .25043817
    logit            2    7.514e-16    7.514e-16
  lassocv            3    .17501211    .17501211
  ridgecv            4    .04580804    .04580804
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7    .28456166    .28456166
       rf            8    4.264e-16    4.264e-16
       rf            9            0            0
gradboost           10    .00702041    .00702041
gradboost           11    .23094861    .23094861
     nnet           12    7.958e-16    7.958e-16
     nnet           13      .006211      .006211

pool-stacked weights across resamples for lnearn
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .01327507    .01327507
      ols            2            0    5.721e-16    5.721e-16
  lassocv            3            0    .11550615    .11550615
  ridgecv            4            0    .21568201    .21568201
  lassocv            5            0            0            0
  ridgecv            6            0    3.600e-16    3.600e-16
       rf            7            0    .47231138    .47231138
       rf            8            0            0            0
       rf            9            0    3.543e-17    3.543e-17
gradboost           10            0    1.652e-16    1.652e-16
gradboost           11            0    .17883172    .17883172
     nnet           12            0            0            0
     nnet           13            0    .00439367    .00439367
      ols            1            1    .00948481    .00948481
      ols            2            1    1.318e-16    1.318e-16
  lassocv            3            1    .24309138    .24309138
  ridgecv            4            1    .05158534    .05158534
  lassocv            5            1     .0279994     .0279994
  ridgecv            6            1      .030056      .030056
       rf            7            1     .5401405     .5401405
       rf            8            1            0            0
       rf            9            1    7.340e-17    7.340e-17
gradboost           10            1    6.647e-18    6.647e-18
gradboost           11            1    .07125498    .07125498
     nnet           12            1            0            0
     nnet           13            1     .0263876     .0263876

D_gender_r_ps[13,3]
               learner  mean_weight        rep_1
    logit            1    .25043817    .25043817
    logit            2    7.514e-16    7.514e-16
  lassocv            3    .17501211    .17501211
  ridgecv            4    .04580804    .04580804
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7    .28456166    .28456166
       rf            8    4.264e-16    4.264e-16
       rf            9            0            0
gradboost           10    .00702041    .00702041
gradboost           11    .23094861    .23094861
     nnet           12    7.958e-16    7.958e-16
     nnet           13      .006211      .006211

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .78560307          1   .2504382   .2504382 |
   2. | .39249821          2   7.51e-16   7.51e-16 |
   3. | .09846955          3   .1750121   .1750121 |
   4. | .19184951          4    .045808    .045808 |
   5. | .47612522          5          0          0 |
      |--------------------------------------------|
   6. | .85260022          6          0          0 |
   7. | .81154017          7   .2845617   .2845617 |
   8. | .86750206          8   4.26e-16   4.26e-16 |
      +--------------------------------------------+
(note: file out_232/D_gender_r_ps_nnls1_pooled_ia.dta not found)
file out_232/D_gender_r_ps_nnls1_pooled_ia.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.086    (0.026)
  ss  1  [shortstack]          [ss]          [ss]    -0.094    (0.028)
  ps  1   [poolstack]          [ps]          [ps]    -0.094    (0.028)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0935647   .0275501    -3.40   0.001    -.1475619   -.0395675
------------------------------------------------------------------------------
Stacking final estimator: singlebest
Warning: 78 propensity scores trimmed to lower limit .01.
Warning: 9 propensity scores trimmed to upper limit .99.
Warning: . resamples had propensity scores trimmed to upper limit .99.



Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.086    (0.026)
  ss  1  [shortstack]          [ss]          [ss]    -0.094    (0.028)
  ps  1   [poolstack]          [ps]          [ps]    -0.094    (0.028)

Stacking DDML model (ATET)
E[y|X,D=0]   = Y1_pystacked0_1                     Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1
E[D|X]       = D1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0864655   .0260836    -3.31   0.001    -.1375884   -.0353427
------------------------------------------------------------------------------
Stacking final estimator: singlebest
Warning: 59 propensity scores trimmed to lower limit .01.
Warning: 8 propensity scores trimmed to upper limit .99.
Warning: . resamples had propensity scores trimmed to upper limit .99.

file out_232/results.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  ss  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.094    (0.028)
  ss  1  [shortstack]          [ss]          [ss]    -0.094    (0.028)
  ps  1   [poolstack]          [ps]          [ps]    -0.094    (0.028)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0935647   .0275501    -3.40   0.001    -.1475619   -.0395675
------------------------------------------------------------------------------
Stacking final estimator: singlebest
Warning: 78 propensity scores trimmed to lower limit .01.
Warning: 9 propensity scores trimmed to upper limit .99.
Warning: . resamples had propensity scores trimmed to upper limit .99.

file out_232/results.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  ps  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.094    (0.028)
  ss  1  [shortstack]          [ss]          [ss]    -0.094    (0.028)
  ps  1   [poolstack]          [ps]          [ps]    -0.094    (0.028)

Poolstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ps0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ps1
E[D|X]       = D_gender_r_ps_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0935647   .0275501    -3.40   0.001    -.1475619   -.0395675
------------------------------------------------------------------------------
Stacking final estimator: singlebest
Warning: 78 propensity scores trimmed to lower limit .01.
Warning: 9 propensity scores trimmed to upper limit .99.
Warning: . resamples had propensity scores trimmed to upper limit .99.

file out_232/results.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3           .8           .8
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7           .1           .1
       rf            8            0            0
       rf            9            0            0
gradboost           10           .1           .1
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0           .1           .1
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0           .9           .9
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3           .8           .8
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7           .1           .1
       rf            8            0            0
       rf            9            0            0
gradboost           10           .1           .1
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0           .1           .1
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0           .9           .9
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

Y1_pystacked_w_mn[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0           .1           .1
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0           .9           .9
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

      +-------------------------------------------+
      | Y1_pys~1   Y1_pys~2   Y1_pys~3   Y1_pys~4 |
      |-------------------------------------------|
   1. |        1          0          0          0 |
   2. |        2          0          0          0 |
   3. |        3          0         .1         .1 |
   4. |        4          0          0          0 |
   5. |        5          0          0          0 |
      |-------------------------------------------|
   6. |        6          0          0          0 |
   7. |        7          0         .9         .9 |
   8. |        8          0          0          0 |
      +-------------------------------------------+
(note: file out_232/Y1_pystacked_w_mn_singlebest_regular_ia.dta not found)
file out_232/Y1_pystacked_w_mn_singlebest_regular_ia.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3           .8           .8
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7           .1           .1
       rf            8            0            0
       rf            9            0            0
gradboost           10           .1           .1
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0           .1           .1
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0           .9           .9
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

D1_pystacked_w_mn[13,3]
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3           .8           .8
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7           .1           .1
       rf            8            0            0
       rf            9            0            0
gradboost           10           .1           .1
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

      +--------------------------------+
      | D1_pys~1   D1_pys~2   D1_pys~3 |
      |--------------------------------|
   1. |        1          0          0 |
   2. |        2          0          0 |
   3. |        3         .8         .8 |
   4. |        4          0          0 |
   5. |        5          0          0 |
      |--------------------------------|
   6. |        6          0          0 |
   7. |        7         .1         .1 |
   8. |        8          0          0 |
      +--------------------------------+
(note: file out_232/D1_pystacked_w_mn_singlebest_regular_ia.dta not found)
file out_232/D1_pystacked_w_mn_singlebest_regular_ia.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3            1            1
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

short-stacked weights across resamples for lnearn
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

short-stacked weights across resamples for gender_r
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3            1            1
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

short-stacked weights across resamples for lnearn
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

Y_lnearn_ss[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

      +-------------------------------------------------------------------+
      | Y_lne~1_1   Y_lne~0_1   Y_lne~s1   Y_lnea~2   Y_lnea~3   Y_lnea~4 |
      |-------------------------------------------------------------------|
   1. | 2.4606366    2.774261          1          0          0          0 |
   2. | 2.9369659   3.2050664          2          0          0          0 |
   3. | 2.9452271   2.8940651          3          0          0          0 |
   4. | 2.5057282   2.5605819          4          0          0          0 |
   5. | 3.1451075   3.1146574          5          0          0          0 |
      |-------------------------------------------------------------------|
   6. | 2.5192864   2.7101343          6          0          0          0 |
   7. | 2.5129912    2.782444          7          0          1          1 |
   8. | 2.6615963     2.82815          8          0          0          0 |
      +-------------------------------------------------------------------+
(note: file out_232/Y_lnearn_ss_singlebest_short_ia.dta not found)
file out_232/Y_lnearn_ss_singlebest_short_ia.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3            1            1
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

short-stacked weights across resamples for lnearn
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

D_gender_r_ss[13,3]
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3            1            1
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. |  .7272442          1          0          0 |
   2. | .30991644          2          0          0 |
   3. |  .0808067          3          1          1 |
   4. | .23426078          4          0          0 |
   5. | .51405257          5          0          0 |
      |--------------------------------------------|
   6. | .84836167          6          0          0 |
   7. | .86755884          7          0          0 |
   8. | .79829979          8          0          0 |
      +--------------------------------------------+
(note: file out_232/D_gender_r_ss_singlebest_short_ia.dta not found)
file out_232/D_gender_r_ss_singlebest_short_ia.dta saved

pool-stacked weights across resamples for gender_r
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3            1            1
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

pool-stacked weights across resamples for lnearn
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

pool-stacked weights across resamples for gender_r
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3            1            1
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

pool-stacked weights across resamples for lnearn
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

Y_lnearn_ps[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

      +-------------------------------------------------------------------+
      | Y_lne~1_1   Y_lne~0_1   Y_lne~s1   Y_lnea~2   Y_lnea~3   Y_lnea~4 |
      |-------------------------------------------------------------------|
   1. | 2.4606366    2.774261          1          0          0          0 |
   2. | 2.9369659   3.2050664          2          0          0          0 |
   3. | 2.9452271   2.8940651          3          0          0          0 |
   4. | 2.5057282   2.5605819          4          0          0          0 |
   5. | 3.1451075   3.1146574          5          0          0          0 |
      |-------------------------------------------------------------------|
   6. | 2.5192864   2.7101343          6          0          0          0 |
   7. | 2.5129912    2.782444          7          0          1          1 |
   8. | 2.6615963     2.82815          8          0          0          0 |
      +-------------------------------------------------------------------+
(note: file out_232/Y_lnearn_ps_singlebest_pooled_ia.dta not found)
file out_232/Y_lnearn_ps_singlebest_pooled_ia.dta saved

pool-stacked weights across resamples for gender_r
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3            1            1
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

pool-stacked weights across resamples for lnearn
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

D_gender_r_ps[13,3]
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3            1            1
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. |  .7272442          1          0          0 |
   2. | .30991644          2          0          0 |
   3. |  .0808067          3          1          1 |
   4. | .23426078          4          0          0 |
   5. | .51405257          5          0          0 |
      |--------------------------------------------|
   6. | .84836167          6          0          0 |
   7. | .86755884          7          0          0 |
   8. | .79829979          8          0          0 |
      +--------------------------------------------+
(note: file out_232/D_gender_r_ps_singlebest_pooled_ia.dta not found)
file out_232/D_gender_r_ps_singlebest_pooled_ia.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked     0.187    (0.159)
  ss  1  [shortstack]          [ss]          [ss]     0.042    (0.093)
  ps  1   [poolstack]          [ps]          [ps]     0.142    (0.099)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |   .0422831   .0927549     0.46   0.648    -.1395131    .2240793
------------------------------------------------------------------------------
Stacking final estimator: ols
Warning: 454 propensity scores trimmed to upper limit .99.
Warning: . resamples had propensity scores trimmed to upper limit .99.



Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked     0.187    (0.159)
  ss  1  [shortstack]          [ss]          [ss]     0.042    (0.093)
  ps  1   [poolstack]          [ps]          [ps]     0.142    (0.099)

Stacking DDML model (ATET)
E[y|X,D=0]   = Y1_pystacked0_1                     Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1
E[D|X]       = D1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |   .1869103   .1592467     1.17   0.241    -.1252076    .4990281
------------------------------------------------------------------------------
Stacking final estimator: ols
Warning: 2518 propensity scores trimmed to lower limit .01.
Warning: 346 propensity scores trimmed to upper limit .99.
Warning: . resamples had propensity scores trimmed to upper limit .99.

(note: variable final was str3, now str10 to accommodate using data's values)
file out_232/results.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  ss  1  Y1_pystacked  Y1_pystacked  D1_pystacked     0.042    (0.093)
  ss  1  [shortstack]          [ss]          [ss]     0.042    (0.093)
  ps  1   [poolstack]          [ps]          [ps]     0.142    (0.099)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |   .0422831   .0927549     0.46   0.648    -.1395131    .2240793
------------------------------------------------------------------------------
Stacking final estimator: ols
Warning: 454 propensity scores trimmed to upper limit .99.
Warning: . resamples had propensity scores trimmed to upper limit .99.

(note: variable final was str3, now str10 to accommodate using data's values)
file out_232/results.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  ps  1  Y1_pystacked  Y1_pystacked  D1_pystacked     0.142    (0.099)
  ss  1  [shortstack]          [ss]          [ss]     0.042    (0.093)
  ps  1   [poolstack]          [ps]          [ps]     0.142    (0.099)

Poolstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ps0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ps1
E[D|X]       = D_gender_r_ps_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |   .1416654   .0987506     1.43   0.151    -.0518823     .335213
------------------------------------------------------------------------------
Stacking final estimator: ols
Warning: 13 propensity scores trimmed to lower limit .01.
Warning: 224 propensity scores trimmed to upper limit .99.
Warning: . resamples had propensity scores trimmed to upper limit .99.

(note: variable final was str3, now str10 to accommodate using data's values)
file out_232/results.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1     .1915834     .1915834
    logit            2    .08831734    .08831734
  lassocv            3    .30589082    .30589082
  ridgecv            4    .02555218    .02555218
  lassocv            5   -.06803841   -.06803841
  ridgecv            6    .01713255    .01713255
       rf            7    .39790313    .39790313
       rf            8    .12471561    .12471561
       rf            9   -.27351302   -.27351302
gradboost           10     .1026537     .1026537
gradboost           11    .14546793    .14546793
     nnet           12   -1.9529832   -1.9529832
     nnet           13    .01017439    .01017439

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .03000137    .03000137
      ols            2            0   -.05601545   -.05601545
  lassocv            3            0   -.05078283   -.05078283
  ridgecv            4            0    .61798497    .61798497
  lassocv            5            0   -.01484194   -.01484194
  ridgecv            6            0   -.14554102   -.14554102
       rf            7            0    .67974008    .67974008
       rf            8            0   -.07541603   -.07541603
       rf            9            0   -.02318452   -.02318452
gradboost           10            0    .04161758    .04161758
gradboost           11            0    .09076404    .09076404
     nnet           12            0   -.02664728   -.02664728
     nnet           13            0    .00044905    .00044905
      ols            1            1    .00078698    .00078698
      ols            2            1   -.01751382   -.01751382
  lassocv            3            1   -.00327192   -.00327192
  ridgecv            4            1    .23066694    .23066694
  lassocv            5            1    .18769583    .18769583
  ridgecv            6            1   -.00617197   -.00617197
       rf            7            1    .52515268    .52515268
       rf            8            1    .52745611    .52745611
       rf            9            1   -.41186616   -.41186616
gradboost           10            1   -.05814488   -.05814488
gradboost           11            1    .05560918    .05560918
     nnet           12            1   -.14923347   -.14923347
     nnet           13            1    .01610263    .01610263

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1     .1915834     .1915834
    logit            2    .08831734    .08831734
  lassocv            3    .30589082    .30589082
  ridgecv            4    .02555218    .02555218
  lassocv            5   -.06803841   -.06803841
  ridgecv            6    .01713255    .01713255
       rf            7    .39790313    .39790313
       rf            8    .12471561    .12471561
       rf            9   -.27351302   -.27351302
gradboost           10     .1026537     .1026537
gradboost           11    .14546793    .14546793
     nnet           12   -1.9529832   -1.9529832
     nnet           13    .01017439    .01017439

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .03000137    .03000137
      ols            2            0   -.05601545   -.05601545
  lassocv            3            0   -.05078283   -.05078283
  ridgecv            4            0    .61798497    .61798497
  lassocv            5            0   -.01484194   -.01484194
  ridgecv            6            0   -.14554102   -.14554102
       rf            7            0    .67974008    .67974008
       rf            8            0   -.07541603   -.07541603
       rf            9            0   -.02318452   -.02318452
gradboost           10            0    .04161758    .04161758
gradboost           11            0    .09076404    .09076404
     nnet           12            0   -.02664728   -.02664728
     nnet           13            0    .00044905    .00044905
      ols            1            1    .00078698    .00078698
      ols            2            1   -.01751382   -.01751382
  lassocv            3            1   -.00327192   -.00327192
  ridgecv            4            1    .23066694    .23066694
  lassocv            5            1    .18769583    .18769583
  ridgecv            6            1   -.00617197   -.00617197
       rf            7            1    .52515268    .52515268
       rf            8            1    .52745611    .52745611
       rf            9            1   -.41186616   -.41186616
gradboost           10            1   -.05814488   -.05814488
gradboost           11            1    .05560918    .05560918
     nnet           12            1   -.14923347   -.14923347
     nnet           13            1    .01610263    .01610263

Y1_pystacked_w_mn[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .03000137    .03000137
      ols            2            0   -.05601545   -.05601545
  lassocv            3            0   -.05078283   -.05078283
  ridgecv            4            0    .61798497    .61798497
  lassocv            5            0   -.01484194   -.01484194
  ridgecv            6            0   -.14554102   -.14554102
       rf            7            0    .67974008    .67974008
       rf            8            0   -.07541603   -.07541603
       rf            9            0   -.02318452   -.02318452
gradboost           10            0    .04161758    .04161758
gradboost           11            0    .09076404    .09076404
     nnet           12            0   -.02664728   -.02664728
     nnet           13            0    .00044905    .00044905
      ols            1            1    .00078698    .00078698
      ols            2            1   -.01751382   -.01751382
  lassocv            3            1   -.00327192   -.00327192
  ridgecv            4            1    .23066694    .23066694
  lassocv            5            1    .18769583    .18769583
  ridgecv            6            1   -.00617197   -.00617197
       rf            7            1    .52515268    .52515268
       rf            8            1    .52745611    .52745611
       rf            9            1   -.41186616   -.41186616
gradboost           10            1   -.05814488   -.05814488
gradboost           11            1    .05560918    .05560918
     nnet           12            1   -.14923347   -.14923347
     nnet           13            1    .01610263    .01610263

      +---------------------------------------------+
      | Y1_pys~1   Y1_pys~2   Y1_pyst~3   Y1_pyst~4 |
      |---------------------------------------------|
   1. |        1          0    .0300014    .0300014 |
   2. |        2          0   -.0560155   -.0560155 |
   3. |        3          0   -.0507828   -.0507828 |
   4. |        4          0     .617985     .617985 |
   5. |        5          0   -.0148419   -.0148419 |
      |---------------------------------------------|
   6. |        6          0    -.145541    -.145541 |
   7. |        7          0    .6797401    .6797401 |
   8. |        8          0    -.075416    -.075416 |
      +---------------------------------------------+
(note: file out_232/Y1_pystacked_w_mn_ols_regular_ia.dta not found)
file out_232/Y1_pystacked_w_mn_ols_regular_ia.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1     .1915834     .1915834
    logit            2    .08831734    .08831734
  lassocv            3    .30589082    .30589082
  ridgecv            4    .02555218    .02555218
  lassocv            5   -.06803841   -.06803841
  ridgecv            6    .01713255    .01713255
       rf            7    .39790313    .39790313
       rf            8    .12471561    .12471561
       rf            9   -.27351302   -.27351302
gradboost           10     .1026537     .1026537
gradboost           11    .14546793    .14546793
     nnet           12   -1.9529832   -1.9529832
     nnet           13    .01017439    .01017439

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .03000137    .03000137
      ols            2            0   -.05601545   -.05601545
  lassocv            3            0   -.05078283   -.05078283
  ridgecv            4            0    .61798497    .61798497
  lassocv            5            0   -.01484194   -.01484194
  ridgecv            6            0   -.14554102   -.14554102
       rf            7            0    .67974008    .67974008
       rf            8            0   -.07541603   -.07541603
       rf            9            0   -.02318452   -.02318452
gradboost           10            0    .04161758    .04161758
gradboost           11            0    .09076404    .09076404
     nnet           12            0   -.02664728   -.02664728
     nnet           13            0    .00044905    .00044905
      ols            1            1    .00078698    .00078698
      ols            2            1   -.01751382   -.01751382
  lassocv            3            1   -.00327192   -.00327192
  ridgecv            4            1    .23066694    .23066694
  lassocv            5            1    .18769583    .18769583
  ridgecv            6            1   -.00617197   -.00617197
       rf            7            1    .52515268    .52515268
       rf            8            1    .52745611    .52745611
       rf            9            1   -.41186616   -.41186616
gradboost           10            1   -.05814488   -.05814488
gradboost           11            1    .05560918    .05560918
     nnet           12            1   -.14923347   -.14923347
     nnet           13            1    .01610263    .01610263

D1_pystacked_w_mn[13,3]
               learner  mean_weight        rep_1
    logit            1     .1915834     .1915834
    logit            2    .08831734    .08831734
  lassocv            3    .30589082    .30589082
  ridgecv            4    .02555218    .02555218
  lassocv            5   -.06803841   -.06803841
  ridgecv            6    .01713255    .01713255
       rf            7    .39790313    .39790313
       rf            8    .12471561    .12471561
       rf            9   -.27351302   -.27351302
gradboost           10     .1026537     .1026537
gradboost           11    .14546793    .14546793
     nnet           12   -1.9529832   -1.9529832
     nnet           13    .01017439    .01017439

      +----------------------------------+
      | D1_pys~1   D1_pyst~2   D1_pyst~3 |
      |----------------------------------|
   1. |        1    .1915834    .1915834 |
   2. |        2    .0883173    .0883173 |
   3. |        3    .3058908    .3058908 |
   4. |        4    .0255522    .0255522 |
   5. |        5   -.0680384   -.0680384 |
      |----------------------------------|
   6. |        6    .0171326    .0171326 |
   7. |        7    .3979031    .3979031 |
   8. |        8    .1247156    .1247156 |
      +----------------------------------+
(note: file out_232/D1_pystacked_w_mn_ols_regular_ia.dta not found)
file out_232/D1_pystacked_w_mn_ols_regular_ia.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .17384963    .17384963
    logit            2    .05636582    .05636582
  lassocv            3    .10351229    .10351229
  ridgecv            4    .41053851    .41053851
  lassocv            5    .09411435    .09411435
  ridgecv            6   -.45104066   -.45104066
       rf            7    .38233636    .38233636
       rf            8    .11281776    .11281776
       rf            9   -.22025456   -.22025456
gradboost           10    .08710843    .08710843
gradboost           11    .23102307    .23102307
     nnet           12    .07342353    .07342353
     nnet           13    .05925167    .05925167

short-stacked weights across resamples for lnearn
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .00669843    .00669843
      ols            2            0     -.095943     -.095943
  lassocv            3            0    .01958048    .01958048
  ridgecv            4            0    .50554384    .50554384
  lassocv            5            0   -.03692554   -.03692554
  ridgecv            6            0   -.09353436   -.09353436
       rf            7            0    .87269409    .87269409
       rf            8            0    -.0286954    -.0286954
       rf            9            0    -.2172001    -.2172001
gradboost           10            0     -.069883     -.069883
gradboost           11            0    .13376263    .13376263
     nnet           12            0    -.0146647    -.0146647
     nnet           13            0    .02104902    .02104902
      ols            1            1    .01269069    .01269069
      ols            2            1   -.04876634   -.04876634
  lassocv            3            1    -.2011131    -.2011131
  ridgecv            4            1    .29585757    .29585757
  lassocv            5            1    .34444907    .34444907
  ridgecv            6            1   -.05223818   -.05223818
       rf            7            1    .51741788    .51741788
       rf            8            1     .6643783     .6643783
       rf            9            1   -.46247341   -.46247341
gradboost           10            1   -.09411393   -.09411393
gradboost           11            1    .02979441    .02979441
     nnet           12            1    .03484225    .03484225
     nnet           13            1    .04458442    .04458442

short-stacked weights across resamples for gender_r
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .17384963    .17384963
    logit            2    .05636582    .05636582
  lassocv            3    .10351229    .10351229
  ridgecv            4    .41053851    .41053851
  lassocv            5    .09411435    .09411435
  ridgecv            6   -.45104066   -.45104066
       rf            7    .38233636    .38233636
       rf            8    .11281776    .11281776
       rf            9   -.22025456   -.22025456
gradboost           10    .08710843    .08710843
gradboost           11    .23102307    .23102307
     nnet           12    .07342353    .07342353
     nnet           13    .05925167    .05925167

short-stacked weights across resamples for lnearn
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .00669843    .00669843
      ols            2            0     -.095943     -.095943
  lassocv            3            0    .01958048    .01958048
  ridgecv            4            0    .50554384    .50554384
  lassocv            5            0   -.03692554   -.03692554
  ridgecv            6            0   -.09353436   -.09353436
       rf            7            0    .87269409    .87269409
       rf            8            0    -.0286954    -.0286954
       rf            9            0    -.2172001    -.2172001
gradboost           10            0     -.069883     -.069883
gradboost           11            0    .13376263    .13376263
     nnet           12            0    -.0146647    -.0146647
     nnet           13            0    .02104902    .02104902
      ols            1            1    .01269069    .01269069
      ols            2            1   -.04876634   -.04876634
  lassocv            3            1    -.2011131    -.2011131
  ridgecv            4            1    .29585757    .29585757
  lassocv            5            1    .34444907    .34444907
  ridgecv            6            1   -.05223818   -.05223818
       rf            7            1    .51741788    .51741788
       rf            8            1     .6643783     .6643783
       rf            9            1   -.46247341   -.46247341
gradboost           10            1   -.09411393   -.09411393
gradboost           11            1    .02979441    .02979441
     nnet           12            1    .03484225    .03484225
     nnet           13            1    .04458442    .04458442

Y_lnearn_ss[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .00669843    .00669843
      ols            2            0     -.095943     -.095943
  lassocv            3            0    .01958048    .01958048
  ridgecv            4            0    .50554384    .50554384
  lassocv            5            0   -.03692554   -.03692554
  ridgecv            6            0   -.09353436   -.09353436
       rf            7            0    .87269409    .87269409
       rf            8            0    -.0286954    -.0286954
       rf            9            0    -.2172001    -.2172001
gradboost           10            0     -.069883     -.069883
gradboost           11            0    .13376263    .13376263
     nnet           12            0    -.0146647    -.0146647
     nnet           13            0    .02104902    .02104902
      ols            1            1    .01269069    .01269069
      ols            2            1   -.04876634   -.04876634
  lassocv            3            1    -.2011131    -.2011131
  ridgecv            4            1    .29585757    .29585757
  lassocv            5            1    .34444907    .34444907
  ridgecv            6            1   -.05223818   -.05223818
       rf            7            1    .51741788    .51741788
       rf            8            1     .6643783     .6643783
       rf            9            1   -.46247341   -.46247341
gradboost           10            1   -.09411393   -.09411393
gradboost           11            1    .02979441    .02979441
     nnet           12            1    .03484225    .03484225
     nnet           13            1    .04458442    .04458442

      +---------------------------------------------------------------------+
      | Y_lne~1_1   Y_lne~0_1   Y_lne~s1   Y_lnea~2   Y_lnear~3   Y_lnear~4 |
      |---------------------------------------------------------------------|
   1. | 2.7185606   2.7031354          1          0    .0066984    .0066984 |
   2. | 3.2320821   3.2522808          2          0    -.095943    -.095943 |
   3. | 3.0478257   2.8909748          3          0    .0195805    .0195805 |
   4. | 2.7135913   2.5243667          4          0    .5055438    .5055438 |
   5. | 3.4321861   3.0996314          5          0   -.0369255   -.0369255 |
      |---------------------------------------------------------------------|
   6. | 2.7934888   2.7016787          6          0   -.0935344   -.0935344 |
   7. | 2.6281836   2.7112114          7          0    .8726941    .8726941 |
   8. | 2.8402559   2.7582604          8          0   -.0286954   -.0286954 |
      +---------------------------------------------------------------------+
(note: file out_232/Y_lnearn_ss_ols_short_ia.dta not found)
file out_232/Y_lnearn_ss_ols_short_ia.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .17384963    .17384963
    logit            2    .05636582    .05636582
  lassocv            3    .10351229    .10351229
  ridgecv            4    .41053851    .41053851
  lassocv            5    .09411435    .09411435
  ridgecv            6   -.45104066   -.45104066
       rf            7    .38233636    .38233636
       rf            8    .11281776    .11281776
       rf            9   -.22025456   -.22025456
gradboost           10    .08710843    .08710843
gradboost           11    .23102307    .23102307
     nnet           12    .07342353    .07342353
     nnet           13    .05925167    .05925167

short-stacked weights across resamples for lnearn
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .00669843    .00669843
      ols            2            0     -.095943     -.095943
  lassocv            3            0    .01958048    .01958048
  ridgecv            4            0    .50554384    .50554384
  lassocv            5            0   -.03692554   -.03692554
  ridgecv            6            0   -.09353436   -.09353436
       rf            7            0    .87269409    .87269409
       rf            8            0    -.0286954    -.0286954
       rf            9            0    -.2172001    -.2172001
gradboost           10            0     -.069883     -.069883
gradboost           11            0    .13376263    .13376263
     nnet           12            0    -.0146647    -.0146647
     nnet           13            0    .02104902    .02104902
      ols            1            1    .01269069    .01269069
      ols            2            1   -.04876634   -.04876634
  lassocv            3            1    -.2011131    -.2011131
  ridgecv            4            1    .29585757    .29585757
  lassocv            5            1    .34444907    .34444907
  ridgecv            6            1   -.05223818   -.05223818
       rf            7            1    .51741788    .51741788
       rf            8            1     .6643783     .6643783
       rf            9            1   -.46247341   -.46247341
gradboost           10            1   -.09411393   -.09411393
gradboost           11            1    .02979441    .02979441
     nnet           12            1    .03484225    .03484225
     nnet           13            1    .04458442    .04458442

D_gender_r_ss[13,3]
               learner  mean_weight        rep_1
    logit            1    .17384963    .17384963
    logit            2    .05636582    .05636582
  lassocv            3    .10351229    .10351229
  ridgecv            4    .41053851    .41053851
  lassocv            5    .09411435    .09411435
  ridgecv            6   -.45104066   -.45104066
       rf            7    .38233636    .38233636
       rf            8    .11281776    .11281776
       rf            9   -.22025456   -.22025456
gradboost           10    .08710843    .08710843
gradboost           11    .23102307    .23102307
     nnet           12    .07342353    .07342353
     nnet           13    .05925167    .05925167

      +----------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gende~2   D_gende~3 |
      |----------------------------------------------|
   1. | .83775296          1    .1738496    .1738496 |
   2. | .43399812          2    .0563658    .0563658 |
   3. | .13136113          3    .1035123    .1035123 |
   4. |  .2239115          4    .4105385    .4105385 |
   5. |  .5186263          5    .0941143    .0941143 |
      |----------------------------------------------|
   6. | .93159555          6   -.4510407   -.4510407 |
   7. | .89745297          7    .3823363    .3823363 |
   8. | .93860591          8    .1128178    .1128178 |
      +----------------------------------------------+
(note: file out_232/D_gender_r_ss_ols_short_ia.dta not found)
file out_232/D_gender_r_ss_ols_short_ia.dta saved

pool-stacked weights across resamples for gender_r
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .19935424    .19935424
    logit            2    .08908542    .08908542
  lassocv            3    .18072059    .18072059
  ridgecv            4    .10285548    .10285548
  lassocv            5     .0161907     .0161907
  ridgecv            6   -.03330583   -.03330583
       rf            7    .40258471    .40258471
       rf            8    .12225284    .12225284
       rf            9   -.26844698   -.26844698
gradboost           10     .1040633     .1040633
gradboost           11    .14706554    .14706554
     nnet           12   -.00310541   -.00310541
     nnet           13    .00834444    .00834444

pool-stacked weights across resamples for lnearn
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .01257426    .01257426
      ols            2            0   -.06041506   -.06041506
  lassocv            3            0    .05880598    .05880598
  ridgecv            4            0    .46510118    .46510118
  lassocv            5            0   -.08055725   -.08055725
  ridgecv            6            0   -.05093994   -.05093994
       rf            7            0     .7057117     .7057117
       rf            8            0   -.05543082   -.05543082
       rf            9            0   -.05368163   -.05368163
gradboost           10            0    .03439572    .03439572
gradboost           11            0    .09908414    .09908414
     nnet           12            0   -.00124302   -.00124302
     nnet           13            0     .0006848     .0006848
      ols            1            1    .00702476    .00702476
      ols            2            1   -.02227999   -.02227999
  lassocv            3            1    .08125231    .08125231
  ridgecv            4            1    .27820869    .27820869
  lassocv            5            1    .07566864    .07566864
  ridgecv            6            1   -.03306887   -.03306887
       rf            7            1    .53850022    .53850022
       rf            8            1    .53108522    .53108522
       rf            9            1   -.40811394   -.40811394
gradboost           10            1   -.05314465   -.05314465
gradboost           11            1    .05220584    .05220584
     nnet           12            1    .00126664    .00126664
     nnet           13            1    .02225883    .02225883

pool-stacked weights across resamples for gender_r
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .19935424    .19935424
    logit            2    .08908542    .08908542
  lassocv            3    .18072059    .18072059
  ridgecv            4    .10285548    .10285548
  lassocv            5     .0161907     .0161907
  ridgecv            6   -.03330583   -.03330583
       rf            7    .40258471    .40258471
       rf            8    .12225284    .12225284
       rf            9   -.26844698   -.26844698
gradboost           10     .1040633     .1040633
gradboost           11    .14706554    .14706554
     nnet           12   -.00310541   -.00310541
     nnet           13    .00834444    .00834444

pool-stacked weights across resamples for lnearn
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .01257426    .01257426
      ols            2            0   -.06041506   -.06041506
  lassocv            3            0    .05880598    .05880598
  ridgecv            4            0    .46510118    .46510118
  lassocv            5            0   -.08055725   -.08055725
  ridgecv            6            0   -.05093994   -.05093994
       rf            7            0     .7057117     .7057117
       rf            8            0   -.05543082   -.05543082
       rf            9            0   -.05368163   -.05368163
gradboost           10            0    .03439572    .03439572
gradboost           11            0    .09908414    .09908414
     nnet           12            0   -.00124302   -.00124302
     nnet           13            0     .0006848     .0006848
      ols            1            1    .00702476    .00702476
      ols            2            1   -.02227999   -.02227999
  lassocv            3            1    .08125231    .08125231
  ridgecv            4            1    .27820869    .27820869
  lassocv            5            1    .07566864    .07566864
  ridgecv            6            1   -.03306887   -.03306887
       rf            7            1    .53850022    .53850022
       rf            8            1    .53108522    .53108522
       rf            9            1   -.40811394   -.40811394
gradboost           10            1   -.05314465   -.05314465
gradboost           11            1    .05220584    .05220584
     nnet           12            1    .00126664    .00126664
     nnet           13            1    .02225883    .02225883

Y_lnearn_ps[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .01257426    .01257426
      ols            2            0   -.06041506   -.06041506
  lassocv            3            0    .05880598    .05880598
  ridgecv            4            0    .46510118    .46510118
  lassocv            5            0   -.08055725   -.08055725
  ridgecv            6            0   -.05093994   -.05093994
       rf            7            0     .7057117     .7057117
       rf            8            0   -.05543082   -.05543082
       rf            9            0   -.05368163   -.05368163
gradboost           10            0    .03439572    .03439572
gradboost           11            0    .09908414    .09908414
     nnet           12            0   -.00124302   -.00124302
     nnet           13            0     .0006848     .0006848
      ols            1            1    .00702476    .00702476
      ols            2            1   -.02227999   -.02227999
  lassocv            3            1    .08125231    .08125231
  ridgecv            4            1    .27820869    .27820869
  lassocv            5            1    .07566864    .07566864
  ridgecv            6            1   -.03306887   -.03306887
       rf            7            1    .53850022    .53850022
       rf            8            1    .53108522    .53108522
       rf            9            1   -.40811394   -.40811394
gradboost           10            1   -.05314465   -.05314465
gradboost           11            1    .05220584    .05220584
     nnet           12            1    .00126664    .00126664
     nnet           13            1    .02225883    .02225883

      +---------------------------------------------------------------------+
      | Y_lne~1_1   Y_lne~0_1   Y_lne~s1   Y_lnea~2   Y_lnear~3   Y_lnear~4 |
      |---------------------------------------------------------------------|
   1. | 2.6877565    2.923756          1          0    .0125743    .0125743 |
   2. | 3.2042424   3.4634016          2          0   -.0604151   -.0604151 |
   3. | 3.0187945    3.078362          3          0     .058806     .058806 |
   4. |  2.653598    2.716931          4          0    .4651012    .4651012 |
   5. |  3.396933   3.3393912          5          0   -.0805572   -.0805572 |
      |---------------------------------------------------------------------|
   6. |  2.746833   2.9072781          6          0   -.0509399   -.0509399 |
   7. | 2.5947855   2.8906531          7          0    .7057117    .7057117 |
   8. | 2.8146535   2.9496281          8          0   -.0554308   -.0554308 |
      +---------------------------------------------------------------------+
(note: file out_232/Y_lnearn_ps_ols_pooled_ia.dta not found)
file out_232/Y_lnearn_ps_ols_pooled_ia.dta saved

pool-stacked weights across resamples for gender_r
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .19935424    .19935424
    logit            2    .08908542    .08908542
  lassocv            3    .18072059    .18072059
  ridgecv            4    .10285548    .10285548
  lassocv            5     .0161907     .0161907
  ridgecv            6   -.03330583   -.03330583
       rf            7    .40258471    .40258471
       rf            8    .12225284    .12225284
       rf            9   -.26844698   -.26844698
gradboost           10     .1040633     .1040633
gradboost           11    .14706554    .14706554
     nnet           12   -.00310541   -.00310541
     nnet           13    .00834444    .00834444

pool-stacked weights across resamples for lnearn
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .01257426    .01257426
      ols            2            0   -.06041506   -.06041506
  lassocv            3            0    .05880598    .05880598
  ridgecv            4            0    .46510118    .46510118
  lassocv            5            0   -.08055725   -.08055725
  ridgecv            6            0   -.05093994   -.05093994
       rf            7            0     .7057117     .7057117
       rf            8            0   -.05543082   -.05543082
       rf            9            0   -.05368163   -.05368163
gradboost           10            0    .03439572    .03439572
gradboost           11            0    .09908414    .09908414
     nnet           12            0   -.00124302   -.00124302
     nnet           13            0     .0006848     .0006848
      ols            1            1    .00702476    .00702476
      ols            2            1   -.02227999   -.02227999
  lassocv            3            1    .08125231    .08125231
  ridgecv            4            1    .27820869    .27820869
  lassocv            5            1    .07566864    .07566864
  ridgecv            6            1   -.03306887   -.03306887
       rf            7            1    .53850022    .53850022
       rf            8            1    .53108522    .53108522
       rf            9            1   -.40811394   -.40811394
gradboost           10            1   -.05314465   -.05314465
gradboost           11            1    .05220584    .05220584
     nnet           12            1    .00126664    .00126664
     nnet           13            1    .02225883    .02225883

D_gender_r_ps[13,3]
               learner  mean_weight        rep_1
    logit            1    .19935424    .19935424
    logit            2    .08908542    .08908542
  lassocv            3    .18072059    .18072059
  ridgecv            4    .10285548    .10285548
  lassocv            5     .0161907     .0161907
  ridgecv            6   -.03330583   -.03330583
       rf            7    .40258471    .40258471
       rf            8    .12225284    .12225284
       rf            9   -.26844698   -.26844698
gradboost           10     .1040633     .1040633
gradboost           11    .14706554    .14706554
     nnet           12   -.00310541   -.00310541
     nnet           13    .00834444    .00834444

      +----------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gende~2   D_gende~3 |
      |----------------------------------------------|
   1. | .80958053          1    .1993542    .1993542 |
   2. | .42476851          2    .0890854    .0890854 |
   3. |  .1002232          3    .1807206    .1807206 |
   4. | .19288068          4    .1028555    .1028555 |
   5. | .50576267          5    .0161907    .0161907 |
      |----------------------------------------------|
   6. | .92343336          6   -.0333058   -.0333058 |
   7. | .88001603          7    .4025847    .4025847 |
   8. | .90024634          8    .1222528    .1222528 |
      +----------------------------------------------+
(note: file out_232/D_gender_r_ps_ols_pooled_ia.dta not found)
file out_232/D_gender_r_ps_ols_pooled_ia.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.097    (0.017)
  ss  1  [shortstack]          [ss]          [ss]    -0.097    (0.017)
  ps  1   [poolstack]          [ps]          [ps]    -0.097    (0.017)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0971276   .0165329    -5.87   0.000    -.1295316   -.0647237
------------------------------------------------------------------------------
Stacking final estimator: avg



Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.097    (0.017)
  ss  1  [shortstack]          [ss]          [ss]    -0.097    (0.017)
  ps  1   [poolstack]          [ps]          [ps]    -0.097    (0.017)

Stacking DDML model (ATET)
E[y|X,D=0]   = Y1_pystacked0_1                     Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1
E[D|X]       = D1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0971276   .0165329    -5.87   0.000    -.1295316   -.0647237
------------------------------------------------------------------------------
Stacking final estimator: avg

(note: variable final was str3, now str10 to accommodate using data's values)
file out_232/results.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  ss  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.097    (0.017)
  ss  1  [shortstack]          [ss]          [ss]    -0.097    (0.017)
  ps  1   [poolstack]          [ps]          [ps]    -0.097    (0.017)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0971276   .0165329    -5.87   0.000    -.1295316   -.0647237
------------------------------------------------------------------------------
Stacking final estimator: avg

(note: variable final was str3, now str10 to accommodate using data's values)
file out_232/results.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  ps  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.097    (0.017)
  ss  1  [shortstack]          [ss]          [ss]    -0.097    (0.017)
  ps  1   [poolstack]          [ps]          [ps]    -0.097    (0.017)

Poolstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ps0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ps1
E[D|X]       = D_gender_r_ps_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0971276   .0165329    -5.87   0.000    -.1295316   -.0647237
------------------------------------------------------------------------------
Stacking final estimator: avg

(note: variable final was str3, now str10 to accommodate using data's values)
file out_232/results.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

Y1_pystacked_w_mn[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

      +-------------------------------------------+
      | Y1_pys~1   Y1_pys~2   Y1_pys~3   Y1_pys~4 |
      |-------------------------------------------|
   1. |        1          0   .0769231   .0769231 |
   2. |        2          0   .0769231   .0769231 |
   3. |        3          0   .0769231   .0769231 |
   4. |        4          0   .0769231   .0769231 |
   5. |        5          0   .0769231   .0769231 |
      |-------------------------------------------|
   6. |        6          0   .0769231   .0769231 |
   7. |        7          0   .0769231   .0769231 |
   8. |        8          0   .0769231   .0769231 |
      +-------------------------------------------+
(note: file out_232/Y1_pystacked_w_mn_avg_regular_ia.dta not found)
file out_232/Y1_pystacked_w_mn_avg_regular_ia.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

D1_pystacked_w_mn[13,3]
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

      +--------------------------------+
      | D1_pys~1   D1_pys~2   D1_pys~3 |
      |--------------------------------|
   1. |        1   .0769231   .0769231 |
   2. |        2   .0769231   .0769231 |
   3. |        3   .0769231   .0769231 |
   4. |        4   .0769231   .0769231 |
   5. |        5   .0769231   .0769231 |
      |--------------------------------|
   6. |        6   .0769231   .0769231 |
   7. |        7   .0769231   .0769231 |
   8. |        8   .0769231   .0769231 |
      +--------------------------------+
(note: file out_232/D1_pystacked_w_mn_avg_regular_ia.dta not found)
file out_232/D1_pystacked_w_mn_avg_regular_ia.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

short-stacked weights across resamples for lnearn
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

short-stacked weights across resamples for gender_r
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

short-stacked weights across resamples for lnearn
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

Y_lnearn_ss[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

      +-------------------------------------------------------------------+
      | Y_lne~1_1   Y_lne~0_1   Y_lne~s1   Y_lnea~2   Y_lnea~3   Y_lnea~4 |
      |-------------------------------------------------------------------|
   1. | 2.5926732   2.7602942          1          0   .0769231   .0769231 |
   2. | 3.0410489   3.2046252          2          0   .0769231   .0769231 |
   3. | 2.7122774   2.8170781          3          0   .0769231   .0769231 |
   4. | 2.4994349    2.565498          4          0   .0769231   .0769231 |
   5. | 3.1085125   3.1194705          5          0   .0769231   .0769231 |
      |-------------------------------------------------------------------|
   6. | 2.6028828   2.7260173          6          0   .0769231   .0769231 |
   7. | 2.4176068   2.6597746          7          0   .0769231   .0769231 |
   8. | 2.6587493   2.7948979          8          0   .0769231   .0769231 |
      +-------------------------------------------------------------------+
(note: file out_232/Y_lnearn_ss_avg_short_ia.dta not found)
file out_232/Y_lnearn_ss_avg_short_ia.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

short-stacked weights across resamples for lnearn
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

D_gender_r_ss[13,3]
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .73654154          1   .0769231   .0769231 |
   2. | .41832373          2   .0769231   .0769231 |
   3. | .17747884          3   .0769231   .0769231 |
   4. | .32175668          4   .0769231   .0769231 |
   5. | .51979371          5   .0769231   .0769231 |
      |--------------------------------------------|
   6. | .78713788          6   .0769231   .0769231 |
   7. | .78779067          7   .0769231   .0769231 |
   8. | .80060378          8   .0769231   .0769231 |
      +--------------------------------------------+
(note: file out_232/D_gender_r_ss_avg_short_ia.dta not found)
file out_232/D_gender_r_ss_avg_short_ia.dta saved

pool-stacked weights across resamples for gender_r
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

pool-stacked weights across resamples for lnearn
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

pool-stacked weights across resamples for gender_r
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

pool-stacked weights across resamples for lnearn
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

Y_lnearn_ps[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

      +-------------------------------------------------------------------+
      | Y_lne~1_1   Y_lne~0_1   Y_lne~s1   Y_lnea~2   Y_lnea~3   Y_lnea~4 |
      |-------------------------------------------------------------------|
   1. | 2.5926732   2.7602942          1          0   .0769231   .0769231 |
   2. | 3.0410489   3.2046252          2          0   .0769231   .0769231 |
   3. | 2.7122774   2.8170781          3          0   .0769231   .0769231 |
   4. | 2.4994349    2.565498          4          0   .0769231   .0769231 |
   5. | 3.1085125   3.1194705          5          0   .0769231   .0769231 |
      |-------------------------------------------------------------------|
   6. | 2.6028828   2.7260173          6          0   .0769231   .0769231 |
   7. | 2.4176068   2.6597746          7          0   .0769231   .0769231 |
   8. | 2.6587493   2.7948979          8          0   .0769231   .0769231 |
      +-------------------------------------------------------------------+
(note: file out_232/Y_lnearn_ps_avg_pooled_ia.dta not found)
file out_232/Y_lnearn_ps_avg_pooled_ia.dta saved

pool-stacked weights across resamples for gender_r
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

pool-stacked weights across resamples for lnearn
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

D_gender_r_ps[13,3]
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .73654154          1   .0769231   .0769231 |
   2. | .41832373          2   .0769231   .0769231 |
   3. | .17747884          3   .0769231   .0769231 |
   4. | .32175668          4   .0769231   .0769231 |
   5. | .51979371          5   .0769231   .0769231 |
      |--------------------------------------------|
   6. | .78713788          6   .0769231   .0769231 |
   7. | .78779067          7   .0769231   .0769231 |
   8. | .80060378          8   .0769231   .0769231 |
      +--------------------------------------------+
(note: file out_232/D_gender_r_ps_avg_pooled_ia.dta not found)
file out_232/D_gender_r_ps_avg_pooled_ia.dta saved
. 
.         forvalues i = 1(1)$L {
  2.                         ddml estimate, y1(Y1_pystacked1_L`i'_1) y0(Y1_pyst
> acked0_L`i'_1) ///
>                                                         d(D1_pystacked_L`i'_1
> ) robust atet foldvar(m0_sample_1  )
  3.                         regsave gender_r using `folder'/results.dta, ci //
> /
>                                                 addlabel(model,interactive,se
> ed,`seed',final,indiv,learner,`i') ///
>                                                 append
  4.         }

E[y|X,D=0]   = Y1_pystacked0_L1_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L1_1
E[D|X]       = D1_pystacked_L1_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1322707   .0825814    -1.60   0.109    -.2941273     .029586
------------------------------------------------------------------------------
Warning: 151 propensity scores trimmed to lower limit ..
Warning: 49 propensity scores trimmed to upper limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_232/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L2_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L2_1
E[D|X]       = D1_pystacked_L2_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1188567   .0165693    -7.17   0.000    -.1513318   -.0863815
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_232/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L3_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L3_1
E[D|X]       = D1_pystacked_L3_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0848081   .0283594    -2.99   0.003    -.1403914   -.0292247
------------------------------------------------------------------------------
Warning: 78 propensity scores trimmed to lower limit ..
Warning: 9 propensity scores trimmed to upper limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_232/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L4_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L4_1
E[D|X]       = D1_pystacked_L4_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0835447   .0695443    -1.20   0.230    -.2198491    .0527597
------------------------------------------------------------------------------
Warning: 92 propensity scores trimmed to lower limit ..
Warning: 27 propensity scores trimmed to upper limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_232/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L5_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L5_1
E[D|X]       = D1_pystacked_L5_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0220097   .0734477    -0.30   0.764    -.1659645    .1219451
------------------------------------------------------------------------------
Warning: 121 propensity scores trimmed to lower limit ..
Warning: 30 propensity scores trimmed to upper limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_232/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L6_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L6_1
E[D|X]       = D1_pystacked_L6_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1749955   .1741429    -1.00   0.315    -.5163092    .1663183
------------------------------------------------------------------------------
Warning: 67 propensity scores trimmed to lower limit ..
Warning: 16 propensity scores trimmed to upper limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_232/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L7_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L7_1
E[D|X]       = D1_pystacked_L7_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0761292   .0245977    -3.09   0.002    -.1243397   -.0279187
------------------------------------------------------------------------------
Warning: 3 propensity scores trimmed to lower limit ..
Warning: 2 propensity scores trimmed to upper limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_232/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L8_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L8_1
E[D|X]       = D1_pystacked_L8_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1053935   .0155561    -6.78   0.000    -.1358828   -.0749042
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_232/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L9_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L9_1
E[D|X]       = D1_pystacked_L9_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1097043   .0148632    -7.38   0.000    -.1388356   -.0805731
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_232/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L10_1                 Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L10_1
E[D|X]       = D1_pystacked_L10_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0738322   .0185336    -3.98   0.000    -.1101574    -.037507
------------------------------------------------------------------------------
Warning: 2 propensity scores trimmed to lower limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_232/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L11_1                 Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L11_1
E[D|X]       = D1_pystacked_L11_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0310226    .049019    -0.63   0.527    -.1270982    .0650529
------------------------------------------------------------------------------
Warning: 92 propensity scores trimmed to lower limit ..
Warning: 22 propensity scores trimmed to upper limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_232/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L12_1                 Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L12_1
E[D|X]       = D1_pystacked_L12_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1053254   .0155978    -6.75   0.000    -.1358966   -.0747543
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_232/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L13_1                 Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L13_1
E[D|X]       = D1_pystacked_L13_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0105379   .3110696    -0.03   0.973     -.620223    .5991472
------------------------------------------------------------------------------
Warning: 180 propensity scores trimmed to lower limit ..
Warning: 110 propensity scores trimmed to upper limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_232/results.dta saved
. 
. }       

.         
. *****************************************************************************
> *  
. *** interactive NX: short-stacking                                           
>                                       ***
. *****************************************************************************
> *
. 
. if (`estimator'==3) {
. 
. gen one = 1     
. 
.         cap drop y0base*
.         cap drop dbase*
.         cap drop y1base*
. 
.         *** no cross-fitting
.         pystacked lnearn $X_expanded   $pystring_reg0  if gender_r == 0, type
> (reg) njobs($cores)  
.                 mat nxw_ia_y0 = e(weights)
.                 mat list nxw_ia_y0
.                                 preserve
.                                 svmat nxw_ia_y0
.                                 keep nxw_ia_y0*
.                                 save `folder'/nxw_ia_y0, replace
.                                 restore
.         predict y0base0, xb
.         predict y0base, base
. 
.         pystacked lnearn $X_expanded  $pystring_reg0 if gender_r == 1  , type
> (reg) njobs($cores)  
.                 mat nxw_ia_y1 = e(weights)
.                 mat list nxw_ia_y1
.                                 preserve
.                                 svmat nxw_ia_y1
.                                 keep nxw_ia_y1*
.                                 save `folder'/nxw_ia_y1, replace
.                                 restore
.         predict y1base0, xb
.         predict y1base, base
. 
.         pystacked gender_r $X_expanded $pystring_class  
.                 mat nxw_ia_d = e(weights)
.                 mat list nxw_ia_d
.                                 preserve
.                                 svmat nxw_ia_d
.                                 keep nxw_ia_d*
.                                 save `folder'/nxw_ia_d, replace
.                                 restore         
.         predict dbase0, pr
.         predict dbase, base pr
.         
.         forvalues i = 0(1)$L {
  2.                         _estimate_ate interactive, yname(lnearn) dname(gen
> der_r) ///
>                                                 y0(y0base`i') y1(y1base`i') d
> (dbase`i') ///
>                                                 atet foldid(one) robust model
> (interactive)
  3.                         regsave gender_r using `folder'/results.dta, ///
>                                                 ci addlabel(model,nxinter,see
> d,`seed',final,nx,learner,`i') append
  4.         }
.                 
. }

.         
. *****************************************************************************
> *  
. *** partial NX: short-stacking                                               
>                                       ***
. *****************************************************************************
> *
. 
. if (`estimator'==4) {
.         
. cap gen one = 1 
. 
.         cap drop Ybase* 
.         cap drop Dbase*
. 
.         *** no cross-fitting
.         pystacked lnearn $X_expanded $pystring_reg 
.                 mat nxw_y = e(weights)
.                 mat list nxw_y
.                                 preserve
.                                 svmat nxw_y
.                                 keep nxw_y*
.                                 save `folder'/nxw_y, replace
.                                 restore
.         predict Ybase0
.         predict Ybase, basexb
. 
.         pystacked gender_r $X_expanded $pystring_reg 
.                 mat nxw_d = e(weights)
.                 mat list nxw_d
.                                 preserve
.                                 svmat nxw_d
.                                 keep nxw_d*
.                                 save `folder'/nxw_d, replace
.                                 restore         
.         predict Dbase0
.         predict Dbase, basexb
. 
.         forvalues i = 0(1)$L {
  2.                 cap drop Ytil
  3.                 cap drop Dtil
  4.                 gen Ytil = lnearn - Ybase`i'
  5.                 gen Dtil = gender_r - Dbase`i'
  6.                 reg Ytil Dtil, robust
  7.                 regsave Dtil using `folder'/results.dta, ///
>                         ci addlabel(model,nxpartial,seed,`seed',final,nx,lear
> ner,`i') append
  8.         }
. 
. }

.         
. cap log close
