-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /cluster/home/kahrens/ddml_applied/GWG/Output/GWG_53356_2.txt
  log type:  text
 opened on:  10 Dec 2023, 19:14:51

. 
. which ddml
/cluster/home/kahrens/ado/plus/d/ddml.ado
*! ddml v1.4.3
*! last edited: 17aug2023
*! authors: aa/ms

. which pystacked
/cluster/home/kahrens/ado/plus/p/pystacked.ado
*! pystacked v0.7.5
*! last edited: 7aug2023
*! authors: aa/ms

. 
. set seed `seed'

. local folder out_`seed'

. 
. use "../Data/gender_gap_ML_processed", clear

. 
. cap mkdir `folder'

. 
. *****************************************************************************
> ***
. ***  controls
. *****************************************************************************
> ***
. 
. // create squared age and tenure here
. gen age_r2 = age_r^2

. gen tenure2 = tenure^2
(2 missing values generated)

. 
. // no base categories
. global continuous                                                            
>                                                            ///
>         age_r                                                                
>                                                                    /// no mis
> sing
>         yrsqual         /* years of education (derived) */                   
>                                    /// 355 missing
>         /// leavedu             /* age when left education (derived) */      
>                            /// 1,081 missing
>         pvlit1          /* literacy score: plausible value 1 (also 2-10 avail
> ) */       /// no missing
>         pvnum1          /* numeracy score: plausible value 1 (also 2-10 avail
> ) */       /// no missing
>         tenure          /* tenure = years in work for current employer */    
>                    /// 2 missing
>                                                                              
>                                                                            //

. // add second order terms here
. global continuous $continuous age_r2 tenure2

. 
. global discrete0                                                             
>                                                            ///             
>         b_q01a          /* education, highest level attained */              
>                            /// no missing
>         b_q01b          /* area of study */                                  
>                                                    /// 434 missing
>         d_q06c          /* part of a larger organization */                  
>                                    /// 13 missing
>         d_q08a          /* management position */                            
>                                            /// no missing
>         d_q09           /* type of contract */                               
>                                            /// 12 missing
>         d_q10_t1        /* hours per week at this job or business */         
>                    /// 1 missing
>         d_q14           /* job satisfaction */                               
>                                            /// 1 missing
>         i_q08           /* health status */                                  
>                                                    /// 2 missing
>         j_q02a          /* living with a partner */                          
>                                            /// 899 missing
>         j_q03d1_c       /* age of youngest child */                          
>                                            /// 2,718 missing
>         j_q04c1_c       /* immigration: age */                               
>                                            /// 4,375 missing
>         j_q06b          /* mother's highest level of educ */                 
>                            /// 445 missing
>         j_q07b          /* father's highest level of educ */                 
>                            /// 515 missing
>         j_q03b          /* number of children*/                              
>                                            /// 1,856 missing
>         impar           /* immigration: parents */                           
>                                            /// 21 missing
>         imgen           /* immigration: generation */                        
>                                    /// 344 missing
>         nfe12jr         /* informal job-related educ in prev 12 months */    
>                    /// 116 missing
>         nfe12njr        /* informal non-job-related educ in prev 12 months */
>            /// 116 missing
>                                                                              
>                                                                            //
>                                                                              
>                                                          

. global personality                                                           
>                                                            ///
>         i_q04b          /* Learning strategies, Relate new ideas into real li
> fe */      /// 16 missing
>         i_q04d          /* Learning strategies, Like learning new things */  
>                    /// no missing
>         i_q04h          /* Learning strategies, Attribute something new */   
>                    /// 10 missing
>         i_q04j          /* Learning strategies, Deal with difficult things */
>            /// no missing
>         i_q04l          /* Learning strategies, Fit different ideas together 
> */         /// 5 missing
>         i_q04m          /* Learning strategies, Looking for additional info *
> /          /// 1 missing
>         i_q05f          /* Cultural engagement, Voluntary non-profit work */ 
>            /// no missing
>         i_q06a          /* Political efficacy, No influence on the government
>  */        /// 14 missing
>         i_q07a          /* Social trust, Trust only few people */            
>                            /// 4 missing
>         i_q07b          /* Social trust, Other people take advantage of you *
> /          /// 6 missing
>                                                                              
>                                                                            //

. global discrete $discrete0                                                   
>                                                    ///
>         new_reg_tl2     /* geographical region */                            
>                                            /// 2 missing
>         new_isco1c      /* occupation */                                     
>                                                    /// no missing
>         new_isic1c      /* industry */                                       
>                                                    // no missing

. 
. global X_simple                                                         ///
>         i.(b_q01a d_q10_t1 j_q03b)                              ///
>         c.($continuous)

. 
. global X_fullinteracted                                         ///
>         i.($discrete0 )                                                 ///
>         i.new_isco1c#i.new_isic1c#i.new_reg_tl2 ///
>         c.($continuous)                  

.         
. global X_cont                                                           ///
>         c.($continuous)##i.($discrete)

. 
. global X_expanded                                                       ///
>         i.($discrete)                                                   ///
>         c.($continuous)                                                 ///
>         c.age_r#i.($discrete)                                   ///
>         c.tenure#i.($discrete)

. 
.         
. 
. *****************************************************************************
> ***
. ***  estimation sample
. *****************************************************************************
> ***
. 
. gen byte touse=1

. markout touse lnearn $X_expanded

. keep if touse
(53 observations deleted)

. 
. 
. *****************************************************************************
> ***
. ***  learners
. *****************************************************************************
> ***
. 
. global cores = 5

. 
. global rf1 min_samples_leaf(1)  max_features(sqrt) n_estimators(500)

. global rf2 min_samples_leaf(50)  max_features(sqrt) n_estimators(500)

. global rf3 min_samples_leaf(100)  max_features(sqrt) n_estimators(500)

. global grad1 n_estimators(500) n_iter_no_change(10)  

. global grad2 n_estimators(500)  

. global nnet1 hidden_layer_sizes(40 20 1 20 50) early_stopping 

. global nnet2 hidden_layer_sizes(30 30 30) early_stopping  

. 
. global pystring_reg0                                                         
>    || ///
>                                         m(ols)                               
>                            || ///
>                                         m(ols) xvars($X_simple)              
>            || ///
>                                         m(lassocv)                           
>                            || ///
>                                         m(ridgecv)                           
>                            || ///
>                                         m(lassocv)      xvars($X_cont)       
>            || ///
>                                         m(ridgecv)      xvars($X_cont)       
>            || ///
>                                         m(rf) opt($rf1)                      
>                    || ///
>                                         m(rf) opt($rf2)                      
>                    || ///
>                                         m(rf) opt($rf3)                      
>                    || ///
>                                         m(gradboost) opt($grad1)             
>            || ///
>                                         m(gradboost) opt($grad2)             
>            || ///
>                                         m(nnet) opt($nnet1)                  
>            || ///
>                                         m(nnet) opt($nnet2)                  
>            || //

. 
. global pystring_reg  $pystring_reg0 , type(reg) njobs($cores) 

.  
. global pystring_class0                                                       
>            || ///
>                                         m(logit)                             
>                            || ///
>                                         m(logit) xvars($X_simple)            
>            || ///
>                                         m(lassocv)                           
>                            || ///
>                                         m(ridgecv)                           
>                            || ///
>                                         m(lassocv)      xvars($X_cont)       
>            || ///
>                                         m(ridgecv)      xvars($X_cont)       
>            || ///
>                                         m(rf) opt($rf1)                      
>                    || ///
>                                         m(rf) opt($rf2)                      
>                    || ///
>                                         m(rf) opt($rf3)                      
>                    || ///
>                                         m(gradboost) opt($grad1)             
>            || ///
>                                         m(gradboost) opt($grad2)             
>            || ///
>                                         m(nnet) opt($nnet1)                  
>            || ///
>                                         m(nnet) opt($nnet2)                  
>            || //                   

.                                 
. global pystring_class $pystring_class0 , type(class) njobs($cores)

.                                         
. global R =1  

. global K=10 

. global L =13

.         
. *****************************************************************************
> *  
. *** ddml: estimation                                                         
>                                               ***
. *****************************************************************************
> *
. 
. if (`estimator'==1) {
. 
.         ddml init partial,  reps($R) kfolds($K)
.         ddml E[Y|X]: pystacked lnearn $X_expanded $pystring_reg
.         ddml E[D|X]: pystacked gender_r $X_expanded $pystring_reg
.         ddml crossfit, shortstack poolstack
.         ddml estimate, robust
.         
.         foreach mat in lnearn_mse gender_r_mse {
  2.                         ddml extract, show(mse)
  3.                         mat `mat' = r(`mat')
  4.                         mat list `mat'
  5.                                 preserve
  6.                                 svmat `mat'
  7.                                 keep `mat'*
  8.                                 keep if _n<=$L
  9.                                 gen stack_type = "conventional" if _n==1
 10.                                 replace stack_type = "pooled" if _n==2
 11.                                 replace stack_type = "short" if _n==3
 12.                                 gen model = "plm"
 13.                                 list if _n<=$L
 14.                                 save `folder'/`mat'_plm_mse, replace
 15.                                 restore 
 16.         }       
. 
.         cap drop mse_*
.         foreach var of varlist Y1_* {
  2.                  cap drop sqerr_`var'
  3.                  gen double sqerr_`var'=(lnearn-`var')^2
  4.                  sum sqerr_`var', meanonly
  5.                  gen double mse_`var'=r(mean) if _n ==1 
  6.         }
.         foreach var of varlist D1_* {
  2.                  cap drop sqerr_`var'
  3.                  gen double sqerr_`var'=(gender_r-`var')^2
  4.                  sum sqerr_`var', meanonly
  5.                  gen double mse_`var'=r(mean) if _n ==1 
  6.         }
.         preserve
.                 keep mse_*
.                 keep if _n==1
.                 save `folder'/plm_mse, replace
.         restore
.         cap drop mse_*
. 
.         ** initialize results file
.         regsave gender_r using `folder'/results.dta, ci addlabel(model,partia
> l,seed,`seed',final,init,learner,-99) replace
. 
.         foreach final in nnls1 singlebest ols avg {
  2. 
.                 ddml estimate, robust finalest(`final')
  3.         
.                         // regular stacking results
.                         ddml estimate, mname(m0) spec(st) replay  
  4.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,partial,seed,`seed',final,`final',learner,-1) append
  5.                         
.                         // shortstacking results
.                         ddml estimate, mname(m0) spec(ss) replay 
  6.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,partial,seed,`seed',final,`final',learner,-2) append
  7.                         
.                         // poolstacking results
.                         ddml estimate, mname(m0) spec(ps) replay  
  8.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,partial,seed,`seed',final,`final',learner,-3) append     
  9.                 
.                         // pystacked weights
.                         ddml extract, show(stweights)   
 10.                         foreach mat in Y1_pystacked_w_mn D1_pystacked_w_mn
>  {
 11.                                         ddml extract, show(stweights)   
 12.                                         mat `mat' = r(`mat')
 13.                                         mat list `mat'
 14.                                                 preserve
 15.                                                 svmat `mat'
 16.                                                 keep `mat'*
 17.                                                 list if _n<=4
 18.                                                 save `folder'/`mat'_`final
> '_regular, replace
 19.                                                 restore
 20.                         }       
 21.                         // shortstacked weights
.                         ddml extract, show(ssweights)
 22.                         foreach mat in Y_lnearn_ss D_gender_r_ss {
 23.                                         qui ddml extract, show(ssweights)
 24.                                         mat `mat' = r(`mat')
 25.                                         mat list `mat'
 26.                                                 preserve
 27.                                                 svmat `mat'
 28.                                                 keep `mat'*
 29.                                                 list if _n<=4
 30.                                                 save `folder'/`mat'_`final
> '_short, replace
 31.                                                 restore
 32.                         }       
 33.                         // poolstacked weights
. 
.                         foreach mat in Y_lnearn_ps D_gender_r_ps {
 34.                                         qui ddml extract, show(psweights)
 35.                                         mat `mat' = r(`mat')
 36.                                         mat list `mat'
 37.                                                 preserve
 38.                                                 svmat `mat'
 39.                                                 keep `mat'*
 40.                                                 list if _n<=4
 41.                                                 save `folder'/`mat'_`final
> '_pooled, replace
 42.                                                 restore
 43.                         }       
 44.         
.         }
. 
.         forvalues i = 1(1)$L {
  2.                         ddml estimate, y(Y1_pystacked_L`i'_1) ///
>                                                         d(D1_pystacked_L`i'_1
> ) robust
  3.                         regsave gender_r using `folder'/results.dta, ci //
> /
>                                                 addlabel(model,partial,seed,`
> seed',final,indiv,learner,`i') ///
>                                                 append
  4.         }
. 
. }

.         
. *****************************************************************************
> *  
. *** interactive: estimation                                                  
>                                       ***
. *****************************************************************************
> *
.         
. if (`estimator'==2) {   
. 
.         ddml init interactive, kfolds($K) reps($R)
.         ddml E[Y|X,D]: pystacked lnearn $X_expanded $pystring_reg
Learner Y1_pystacked added successfully.
.         ddml E[D|X]: pystacked gender_r $X_expanded $pystring_class
Learner D1_pystacked added successfully.
.         ddml crossfit, shortstack poolstack
Cross-fitting E[y|X,D] equation: lnearn
Cross-fitting fold 1 2 3 4 5 6 7 8 9 10 ...completed cross-fitting...completed 
> short-stacking...completed pooled-stacking
Cross-fitting E[D|X] equation: gender_r
Cross-fitting fold 1 2 3 4 5 6 7 8 9 10 ...completed cross-fitting...completed 
> short-stacking...completed pooled-stacking
.         ddml estimate, robust atet


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.076    (0.029)
  ss  1  [shortstack]          [ss]          [ss]    -0.078    (0.025)
  ps  1   [poolstack]          [ps]          [ps]    -0.077    (0.026)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0780167   .0250567    -3.11   0.002    -.1271268   -.0289065
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 3 propensity scores trimmed to lower limit .01.

. 
.         cap drop mse_*
.         foreach var of varlist Y1_pystacked0* {
  2.                  cap drop sqerr_`var'
  3.                  gen double sqerr_`var'=(lnearn-`var')^2 if gender_r==0
  4.                  sum sqerr_`var' if gender_r==0, meanonly
  5.                  gen double mse_`var'=r(mean) if _n ==1 
  6.         }
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
.         foreach var of varlist Y1_pystacked1* {
  2.                  cap drop sqerr_`var'
  3.                  gen double sqerr_`var'=(lnearn-`var')^2 if gender_r==1
  4.                  sum sqerr_`var' if gender_r==1, meanonly
  5.                  gen double mse_`var'=r(mean) if _n ==1 
  6.         }
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
.         foreach var of varlist D1_* {
  2.                  cap drop sqerr_`var'
  3.                  gen double sqerr_`var'=(gender_r-`var')^2
  4.                  sum sqerr_`var', meanonly
  5.                  gen double mse_`var'=r(mean) if _n ==1 
  6.         }
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
.         preserve
.                 keep mse_*
.                 keep if _n==1
(4,835 observations deleted)
.                 save `folder'/inter_mse, replace
(note: file out_53356/inter_mse.dta not found)
file out_53356/inter_mse.dta saved
.         restore
.         cap drop mse_*
.         
.         local mat gender_r_mse
.                         ddml extract, show(mse)

MSEs for gender_r:
                 rep   full smp      fold 1      fold 2      fold 3      fold 4
>       fold 5      fold 6      fold 7      fold 8      fold 9     fold 10 
    D1_pystacked   1      0.155       0.151       0.147       0.166       0.151
>        0.160       0.164       0.161       0.148       0.144       0.156  
   D_gender_r_ps   1      0.154       0.151       0.147       0.164       0.150
>        0.159       0.164       0.161       0.147       0.144       0.157  
   D_gender_r_ss   1      0.154       0.150       0.147       0.162       0.150
>        0.159       0.163       0.162       0.147       0.144       0.156  

MSEs for lnearn:
                D=  rep   full smp      fold 1      fold 2      fold 3      fol
> d 4      fold 5      fold 6      fold 7      fold 8      fold 9     fold 10 
    Y1_pystacked 0    1      0.227       0.176       0.158       0.152       0.
> 459       0.231       0.165       0.177       0.379       0.126       0.258  
    Y1_pystacked 1    1      0.173       0.095       0.130       0.124       0.
> 306       0.116       0.307       0.180       0.121       0.176       0.176  
     Y_lnearn_ps 0    1      8.288       8.350       8.127       8.488       8.
> 193       8.348       8.271       8.351       8.110       8.377       8.235  
     Y_lnearn_ps 1    1      7.490       7.316       7.591       7.564       7.
> 485       7.443       7.624       7.425       7.422       7.417       7.602  
     Y_lnearn_ss 0    1      0.224       0.176       0.156       0.149       0.
> 456       0.226       0.165       0.175       0.371       0.125       0.256  
     Y_lnearn_ss 1    1      0.172       0.095       0.129       0.123       0.
> 306       0.116       0.301       0.180       0.122       0.175       0.177  
.                         mat `mat' = r(`mat')
.                         mat list `mat'

gender_r_mse[3,12]
                      rep  full_sample        fold1        fold2        fold3
D1_pystacked            1    .15485985    .15099748    .14703881     .1663615
D_gender_r~s            1    .15437767    .15061393    .14650982     .1639326
D_gender_r~s            1    .15417837    .14971049    .14710401    .16238475

                    fold4        fold5        fold6        fold7        fold8
D1_pystacked    .15065112    .16041864    .16422075    .16145672    .14777168
D_gender_r~s    .15013174    .15930214    .16370187     .1610385    .14728568
D_gender_r~s    .15008593    .15937467    .16344209    .16191323    .14727882

                    fold9       fold10
D1_pystacked    .14394557    .15575672
D_gender_r~s    .14446295    .15681401
D_gender_r~s    .14437189    .15613041
.                                 preserve
.                                 svmat `mat'
.                                 keep `mat'*
.                                 keep if _n<=$L
(4,823 observations deleted)
.                                 gen stack_type = "conventional" if _n==1
(12 missing values generated)
.                                 replace stack_type = "pooled" if _n==2
(1 real change made)
.                                 replace stack_type = "short" if _n==3
(1 real change made)
.                                 gen model = "interactive"
.                                 list if _n<=$L

     +-----------------------------------------------------------------+
  1. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        1 | .1548599 | .1509975 | .1470388 | .1663615 | .1506511 |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     | .1604186 | .1642208 | .1614567 | .1477717 | .1439456 | .1557567 |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |          conventional          |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  2. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        1 | .1543777 | .1506139 | .1465098 | .1639326 | .1501317 |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     | .1593021 | .1637019 | .1610385 | .1472857 |  .144463 |  .156814 |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                pooled          |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  3. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        1 | .1541784 | .1497105 |  .147104 | .1623847 | .1500859 |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     | .1593747 | .1634421 | .1619132 | .1472788 | .1443719 | .1561304 |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                 short          |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  4. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  5. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  6. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  7. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  8. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  9. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 10. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 11. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 12. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 13. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+
.                                 save `folder'/`mat'_inter_gender_mse, replace
(note: file out_53356/gender_r_mse_inter_gender_mse.dta not found)
file out_53356/gender_r_mse_inter_gender_mse.dta saved
.                                 restore 
.                                 
.         local mat lnearn_mse
.                         ddml extract, show(mse)

MSEs for gender_r:
                 rep   full smp      fold 1      fold 2      fold 3      fold 4
>       fold 5      fold 6      fold 7      fold 8      fold 9     fold 10 
    D1_pystacked   1      0.155       0.151       0.147       0.166       0.151
>        0.160       0.164       0.161       0.148       0.144       0.156  
   D_gender_r_ps   1      0.154       0.151       0.147       0.164       0.150
>        0.159       0.164       0.161       0.147       0.144       0.157  
   D_gender_r_ss   1      0.154       0.150       0.147       0.162       0.150
>        0.159       0.163       0.162       0.147       0.144       0.156  

MSEs for lnearn:
                D=  rep   full smp      fold 1      fold 2      fold 3      fol
> d 4      fold 5      fold 6      fold 7      fold 8      fold 9     fold 10 
    Y1_pystacked 0    1      0.227       0.176       0.158       0.152       0.
> 459       0.231       0.165       0.177       0.379       0.126       0.258  
    Y1_pystacked 1    1      0.173       0.095       0.130       0.124       0.
> 306       0.116       0.307       0.180       0.121       0.176       0.176  
     Y_lnearn_ps 0    1      8.288       8.350       8.127       8.488       8.
> 193       8.348       8.271       8.351       8.110       8.377       8.235  
     Y_lnearn_ps 1    1      7.490       7.316       7.591       7.564       7.
> 485       7.443       7.624       7.425       7.422       7.417       7.602  
     Y_lnearn_ss 0    1      0.224       0.176       0.156       0.149       0.
> 456       0.226       0.165       0.175       0.371       0.125       0.256  
     Y_lnearn_ss 1    1      0.172       0.095       0.129       0.123       0.
> 306       0.116       0.301       0.180       0.122       0.175       0.177  
.                         mat `mat' = r(`mat')
.                         mat list `mat'

lnearn_mse[6,13]
                    D=0/1          rep  full_sample        fold1        fold2
Y1_pystacked            0            1     .2269707    .17574549    .15804869
Y1_pystacked            1            1    .17302614    .09538768    .13013387
 Y_lnearn_ps            0            1    8.2883283     8.350266     8.127477
 Y_lnearn_ps            1            1    7.4898765    7.3164262    7.5908072
 Y_lnearn_ss            0            1    .22446777    .17637335    .15609887
 Y_lnearn_ss            1            1    .17220292    .09507823    .12926956

                    fold3        fold4        fold5        fold6        fold7
Y1_pystacked    .15199223    .45890938    .23079111    .16481307    .17710754
Y1_pystacked    .12417836    .30625401     .1163158    .30666183    .18023245
 Y_lnearn_ps    8.4878054    8.1927287    8.3484661    8.2708648    8.3505915
 Y_lnearn_ps     7.564098     7.485306    7.4431508    7.6241569    7.4250076
 Y_lnearn_ss     .1487674    .45583829    .22628742    .16458985    .17525618
 Y_lnearn_ss    .12274771    .30610673    .11603372    .30095069    .17956148

                    fold8        fold9       fold10
Y1_pystacked    .37854642    .12643088    .25771218
Y1_pystacked    .12120779    .17565026    .17583482
 Y_lnearn_ps    8.1096217    8.3774255    8.2351948
 Y_lnearn_ps    7.4220118    7.4165531    7.6021065
 Y_lnearn_ss    .37097581    .12476882    .25571777
 Y_lnearn_ss    .12165501    .17546683    .17663352
.                                 preserve
.                                 svmat `mat'
.                                 keep `mat'*
.                                 keep if _n<=(2*$L)
(4,810 observations deleted)
.                                 gen stack_type = "conventional" if _n<=2
(24 missing values generated)
.                                 replace stack_type = "pooled" if _n>=3 & _n<=
> 4
(2 real changes made)
.                                 replace stack_type = "short" if _n>4
(22 real changes made)
.                                 gen model = "interactive"
.                                 list if _n<=(2*$L)

     +-----------------------------------------------------------------+
  1. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        0 |        1 | .2269707 | .1757455 | .1580487 | .1519922 |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     | .4589094 | .2307911 | .1648131 | .1771075 | .3785464 | .1264309 |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |     .2577122     |     conventional      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  2. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        1 |        1 | .1730261 | .0953877 | .1301339 | .1241784 |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |  .306254 | .1163158 | .3066618 | .1802325 | .1212078 | .1756503 |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |     .1758348     |     conventional      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  3. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        0 |        1 | 8.288328 | 8.350266 | 8.127477 | 8.487805 |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     | 8.192729 | 8.348466 | 8.270864 | 8.350592 | 8.109622 | 8.377425 |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |     8.235195     |           pooled      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  4. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        1 |        1 | 7.489876 | 7.316426 | 7.590807 | 7.564098 |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     | 7.485306 | 7.443151 | 7.624157 | 7.425008 | 7.422012 | 7.416553 |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |     7.602107     |           pooled      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  5. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        0 |        1 | .2244678 | .1763733 | .1560989 | .1487674 |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     | .4558383 | .2262874 | .1645899 | .1752562 | .3709758 | .1247688 |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |     .2557178     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  6. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        1 |        1 | .1722029 | .0950782 | .1292696 | .1227477 |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     | .3061067 | .1160337 | .3009507 | .1795615 |  .121655 | .1754668 |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |     .1766335     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  7. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  8. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  9. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 10. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 11. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 12. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 13. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 14. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 15. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 16. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 17. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 18. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 19. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 20. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 21. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 22. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 23. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 24. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 25. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 26. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+
.                                 save `folder'/`mat'_inter_lnearn_mse, replace
(note: file out_53356/lnearn_mse_inter_lnearn_mse.dta not found)
file out_53356/lnearn_mse_inter_lnearn_mse.dta saved
.                                 restore 
.         
.         foreach final in nnls1 singlebest ols avg {
  2. 
.                 ddml estimate, robust finalest(`final') atet
  3.         
.                         // regular stacking results
.                         ddml estimate, mname(m0) spec(st) replay atet
  4.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,interactive,seed,`seed',final,`final',learner,-1) append
  5.                         
.                         // shortstacking results
.                         ddml estimate, mname(m0) spec(ss) replay atet
  6.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,interactive,seed,`seed',final,`final',learner,-2) append
  7.                         
.                         // poolstacking results
.                         ddml estimate, mname(m0) spec(ps) replay atet
  8.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,interactive,seed,`seed',final,`final',learner,-3) append
  9.                 
.                         // pystacked weights
.                         ddml extract, show(stweights)
 10.                         foreach mat in Y1_pystacked_w_mn D1_pystacked_w_mn
>  {
 11.                                         ddml extract, show(stweights)
 12.                                         mat `mat' = r(`mat')
 13.                                         mat list `mat'
 14.                                                 preserve
 15.                                                 svmat `mat'
 16.                                                 keep `mat'*
 17.                                                 list if _n<=8
 18.                                                 save `folder'/`mat'_`final
> '_regular_ia, replace
 19.                                                 restore
 20.                         }       
 21.                         // shortstacked weights
.                         ddml extract, show(ssweights)
 22.                         foreach mat in Y_lnearn_ss D_gender_r_ss {
 23.                                         ddml extract, show(ssweights)
 24.                                         mat `mat' = r(`mat')
 25.                                         mat list `mat'
 26.                                                 preserve
 27.                                                 svmat `mat'
 28.                                                 keep `mat'*
 29.                                                 list if _n<=8
 30.                                                 save `folder'/`mat'_`final
> '_short_ia, replace
 31.                                                 restore
 32.                         }       
 33.                         // poolstacked weights
.                         ddml extract, show(psweights)
 34.                         foreach mat in Y_lnearn_ps D_gender_r_ps {
 35.                                         ddml extract, show(psweights)
 36.                                         mat `mat' = r(`mat')
 37.                                         mat list `mat'
 38.                                                 preserve
 39.                                                 svmat `mat'
 40.                                                 keep `mat'*
 41.                                                 list if _n<=8
 42.                                                 save `folder'/`mat'_`final
> '_pooled_ia, replace
 43.                                                 restore
 44.                         }       
 45.         
.         }


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.076    (0.029)
  ss  1  [shortstack]          [ss]          [ss]    -0.078    (0.025)
  ps  1   [poolstack]          [ps]          [ps]    -0.077    (0.026)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0780167   .0250567    -3.11   0.002    -.1271268   -.0289065
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 3 propensity scores trimmed to lower limit .01.



Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.076    (0.029)
  ss  1  [shortstack]          [ss]          [ss]    -0.078    (0.025)
  ps  1   [poolstack]          [ps]          [ps]    -0.077    (0.026)

Stacking DDML model (ATET)
E[y|X,D=0]   = Y1_pystacked0_1                     Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1
E[D|X]       = D1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0764315   .0286702    -2.67   0.008    -.1326239    -.020239
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 4 propensity scores trimmed to lower limit .01.

(note: variable final was str5, now str10 to accommodate using data's values)
file out_53356/results.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  ss  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.078    (0.025)
  ss  1  [shortstack]          [ss]          [ss]    -0.078    (0.025)
  ps  1   [poolstack]          [ps]          [ps]    -0.077    (0.026)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0780167   .0250567    -3.11   0.002    -.1271268   -.0289065
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 3 propensity scores trimmed to lower limit .01.

(note: variable final was str5, now str10 to accommodate using data's values)
file out_53356/results.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  ps  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.077    (0.026)
  ss  1  [shortstack]          [ss]          [ss]    -0.078    (0.025)
  ps  1   [poolstack]          [ps]          [ps]    -0.077    (0.026)

Poolstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ps0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ps1
E[D|X]       = D_gender_r_ps_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0767086   .0256193    -2.99   0.003    -.1269214   -.0264958
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 4 propensity scores trimmed to lower limit .01.

(note: variable final was str5, now str10 to accommodate using data's values)
file out_53356/results.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1     .2473235     .2473235
    logit            2    1.148e-16    1.148e-16
  lassocv            3    .13501115    .13501115
  ridgecv            4    .06965068    .06965068
  lassocv            5    .00372447    .00372447
  ridgecv            6     .0060319     .0060319
       rf            7    .28368782    .28368782
       rf            8    9.789e-17    9.789e-17
       rf            9    7.684e-17    7.684e-17
gradboost           10    .01691623    .01691623
gradboost           11    .21121462    .21121462
     nnet           12    3.048e-17    3.048e-17
     nnet           13    .02643964    .02643964

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .02744563    .02744563
      ols            2            0    1.023e-16    1.023e-16
  lassocv            3            0     .0564464     .0564464
  ridgecv            4            0    .20488855    .20488855
  lassocv            5            0    .08444645    .08444645
  ridgecv            6            0    .01720467    .01720467
       rf            7            0    .43243889    .43243889
       rf            8            0    8.978e-17    8.978e-17
       rf            9            0    1.193e-16    1.193e-16
gradboost           10            0    .03350544    .03350544
gradboost           11            0    .12731692    .12731692
     nnet           12            0    .01132423    .01132423
     nnet           13            0    .00498283    .00498283
      ols            1            1    .01364485    .01364485
      ols            2            1    1.163e-16    1.163e-16
  lassocv            3            1     .1821416     .1821416
  ridgecv            4            1    .04066438    .04066438
  lassocv            5            1    .10012761    .10012761
  ridgecv            6            1    .01861095    .01861095
       rf            7            1    .53026818    .53026818
       rf            8            1    4.973e-17    4.973e-17
       rf            9            1    7.496e-17    7.496e-17
gradboost           10            1    .00195437    .00195437
gradboost           11            1    .06588781    .06588781
     nnet           12            1    .03768843    .03768843
     nnet           13            1     .0090118     .0090118

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1     .2473235     .2473235
    logit            2    1.148e-16    1.148e-16
  lassocv            3    .13501115    .13501115
  ridgecv            4    .06965068    .06965068
  lassocv            5    .00372447    .00372447
  ridgecv            6     .0060319     .0060319
       rf            7    .28368782    .28368782
       rf            8    9.789e-17    9.789e-17
       rf            9    7.684e-17    7.684e-17
gradboost           10    .01691623    .01691623
gradboost           11    .21121462    .21121462
     nnet           12    3.048e-17    3.048e-17
     nnet           13    .02643964    .02643964

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .02744563    .02744563
      ols            2            0    1.023e-16    1.023e-16
  lassocv            3            0     .0564464     .0564464
  ridgecv            4            0    .20488855    .20488855
  lassocv            5            0    .08444645    .08444645
  ridgecv            6            0    .01720467    .01720467
       rf            7            0    .43243889    .43243889
       rf            8            0    8.978e-17    8.978e-17
       rf            9            0    1.193e-16    1.193e-16
gradboost           10            0    .03350544    .03350544
gradboost           11            0    .12731692    .12731692
     nnet           12            0    .01132423    .01132423
     nnet           13            0    .00498283    .00498283
      ols            1            1    .01364485    .01364485
      ols            2            1    1.163e-16    1.163e-16
  lassocv            3            1     .1821416     .1821416
  ridgecv            4            1    .04066438    .04066438
  lassocv            5            1    .10012761    .10012761
  ridgecv            6            1    .01861095    .01861095
       rf            7            1    .53026818    .53026818
       rf            8            1    4.973e-17    4.973e-17
       rf            9            1    7.496e-17    7.496e-17
gradboost           10            1    .00195437    .00195437
gradboost           11            1    .06588781    .06588781
     nnet           12            1    .03768843    .03768843
     nnet           13            1     .0090118     .0090118

Y1_pystacked_w_mn[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .02744563    .02744563
      ols            2            0    1.023e-16    1.023e-16
  lassocv            3            0     .0564464     .0564464
  ridgecv            4            0    .20488855    .20488855
  lassocv            5            0    .08444645    .08444645
  ridgecv            6            0    .01720467    .01720467
       rf            7            0    .43243889    .43243889
       rf            8            0    8.978e-17    8.978e-17
       rf            9            0    1.193e-16    1.193e-16
gradboost           10            0    .03350544    .03350544
gradboost           11            0    .12731692    .12731692
     nnet           12            0    .01132423    .01132423
     nnet           13            0    .00498283    .00498283
      ols            1            1    .01364485    .01364485
      ols            2            1    1.163e-16    1.163e-16
  lassocv            3            1     .1821416     .1821416
  ridgecv            4            1    .04066438    .04066438
  lassocv            5            1    .10012761    .10012761
  ridgecv            6            1    .01861095    .01861095
       rf            7            1    .53026818    .53026818
       rf            8            1    4.973e-17    4.973e-17
       rf            9            1    7.496e-17    7.496e-17
gradboost           10            1    .00195437    .00195437
gradboost           11            1    .06588781    .06588781
     nnet           12            1    .03768843    .03768843
     nnet           13            1     .0090118     .0090118

      +-------------------------------------------+
      | Y1_pys~1   Y1_pys~2   Y1_pys~3   Y1_pys~4 |
      |-------------------------------------------|
   1. |        1          0   .0274456   .0274456 |
   2. |        2          0   1.02e-16   1.02e-16 |
   3. |        3          0   .0564464   .0564464 |
   4. |        4          0   .2048886   .2048886 |
   5. |        5          0   .0844465   .0844465 |
      |-------------------------------------------|
   6. |        6          0   .0172047   .0172047 |
   7. |        7          0   .4324389   .4324389 |
   8. |        8          0   8.98e-17   8.98e-17 |
      +-------------------------------------------+
(note: file out_53356/Y1_pystacked_w_mn_nnls1_regular_ia.dta not found)
file out_53356/Y1_pystacked_w_mn_nnls1_regular_ia.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1     .2473235     .2473235
    logit            2    1.148e-16    1.148e-16
  lassocv            3    .13501115    .13501115
  ridgecv            4    .06965068    .06965068
  lassocv            5    .00372447    .00372447
  ridgecv            6     .0060319     .0060319
       rf            7    .28368782    .28368782
       rf            8    9.789e-17    9.789e-17
       rf            9    7.684e-17    7.684e-17
gradboost           10    .01691623    .01691623
gradboost           11    .21121462    .21121462
     nnet           12    3.048e-17    3.048e-17
     nnet           13    .02643964    .02643964

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .02744563    .02744563
      ols            2            0    1.023e-16    1.023e-16
  lassocv            3            0     .0564464     .0564464
  ridgecv            4            0    .20488855    .20488855
  lassocv            5            0    .08444645    .08444645
  ridgecv            6            0    .01720467    .01720467
       rf            7            0    .43243889    .43243889
       rf            8            0    8.978e-17    8.978e-17
       rf            9            0    1.193e-16    1.193e-16
gradboost           10            0    .03350544    .03350544
gradboost           11            0    .12731692    .12731692
     nnet           12            0    .01132423    .01132423
     nnet           13            0    .00498283    .00498283
      ols            1            1    .01364485    .01364485
      ols            2            1    1.163e-16    1.163e-16
  lassocv            3            1     .1821416     .1821416
  ridgecv            4            1    .04066438    .04066438
  lassocv            5            1    .10012761    .10012761
  ridgecv            6            1    .01861095    .01861095
       rf            7            1    .53026818    .53026818
       rf            8            1    4.973e-17    4.973e-17
       rf            9            1    7.496e-17    7.496e-17
gradboost           10            1    .00195437    .00195437
gradboost           11            1    .06588781    .06588781
     nnet           12            1    .03768843    .03768843
     nnet           13            1     .0090118     .0090118

D1_pystacked_w_mn[13,3]
               learner  mean_weight        rep_1
    logit            1     .2473235     .2473235
    logit            2    1.148e-16    1.148e-16
  lassocv            3    .13501115    .13501115
  ridgecv            4    .06965068    .06965068
  lassocv            5    .00372447    .00372447
  ridgecv            6     .0060319     .0060319
       rf            7    .28368782    .28368782
       rf            8    9.789e-17    9.789e-17
       rf            9    7.684e-17    7.684e-17
gradboost           10    .01691623    .01691623
gradboost           11    .21121462    .21121462
     nnet           12    3.048e-17    3.048e-17
     nnet           13    .02643964    .02643964

      +--------------------------------+
      | D1_pys~1   D1_pys~2   D1_pys~3 |
      |--------------------------------|
   1. |        1   .2473235   .2473235 |
   2. |        2   1.15e-16   1.15e-16 |
   3. |        3   .1350112   .1350112 |
   4. |        4   .0696507   .0696507 |
   5. |        5   .0037245   .0037245 |
      |--------------------------------|
   6. |        6   .0060319   .0060319 |
   7. |        7   .2836878   .2836878 |
   8. |        8   9.79e-17   9.79e-17 |
      +--------------------------------+
(note: file out_53356/D1_pystacked_w_mn_nnls1_regular_ia.dta not found)
file out_53356/D1_pystacked_w_mn_nnls1_regular_ia.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1     .1546567     .1546567
    logit            2            0            0
  lassocv            3    .17850504    .17850504
  ridgecv            4    .06303758    .06303758
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7    .23226466    .23226466
       rf            8    2.467e-17    2.467e-17
       rf            9    3.272e-16    3.272e-16
gradboost           10    .05975222    .05975222
gradboost           11     .3117838     .3117838
     nnet           12    9.754e-17    9.754e-17
     nnet           13    3.406e-17    3.406e-17

short-stacked weights across resamples for lnearn
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    9.899e-18    9.899e-18
      ols            2            0    1.953e-16    1.953e-16
  lassocv            3            0    1.783e-16    1.783e-16
  ridgecv            4            0    .38607651    .38607651
  lassocv            5            0    3.687e-18    3.687e-18
  ridgecv            6            0    .02800883    .02800883
       rf            7            0    .41565541    .41565541
       rf            8            0    2.109e-16    2.109e-16
       rf            9            0            0            0
gradboost           10            0    .01005148    .01005148
gradboost           11            0     .1528959     .1528959
     nnet           12            0            0            0
     nnet           13            0    .00731188    .00731188
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1    4.765e-17    4.765e-17
  ridgecv            4            1    .07192639    .07192639
  lassocv            5            1    .31602158    .31602158
  ridgecv            6            1    2.710e-17    2.710e-17
       rf            7            1    .47226494    .47226494
       rf            8            1    4.288e-17    4.288e-17
       rf            9            1    1.290e-16    1.290e-16
gradboost           10            1    2.600e-17    2.600e-17
gradboost           11            1     .1052083     .1052083
     nnet           12            1    1.422e-16    1.422e-16
     nnet           13            1    .03457879    .03457879

short-stacked weights across resamples for gender_r
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1     .1546567     .1546567
    logit            2            0            0
  lassocv            3    .17850504    .17850504
  ridgecv            4    .06303758    .06303758
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7    .23226466    .23226466
       rf            8    2.467e-17    2.467e-17
       rf            9    3.272e-16    3.272e-16
gradboost           10    .05975222    .05975222
gradboost           11     .3117838     .3117838
     nnet           12    9.754e-17    9.754e-17
     nnet           13    3.406e-17    3.406e-17

short-stacked weights across resamples for lnearn
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    9.899e-18    9.899e-18
      ols            2            0    1.953e-16    1.953e-16
  lassocv            3            0    1.783e-16    1.783e-16
  ridgecv            4            0    .38607651    .38607651
  lassocv            5            0    3.687e-18    3.687e-18
  ridgecv            6            0    .02800883    .02800883
       rf            7            0    .41565541    .41565541
       rf            8            0    2.109e-16    2.109e-16
       rf            9            0            0            0
gradboost           10            0    .01005148    .01005148
gradboost           11            0     .1528959     .1528959
     nnet           12            0            0            0
     nnet           13            0    .00731188    .00731188
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1    4.765e-17    4.765e-17
  ridgecv            4            1    .07192639    .07192639
  lassocv            5            1    .31602158    .31602158
  ridgecv            6            1    2.710e-17    2.710e-17
       rf            7            1    .47226494    .47226494
       rf            8            1    4.288e-17    4.288e-17
       rf            9            1    1.290e-16    1.290e-16
gradboost           10            1    2.600e-17    2.600e-17
gradboost           11            1     .1052083     .1052083
     nnet           12            1    1.422e-16    1.422e-16
     nnet           13            1    .03457879    .03457879

Y_lnearn_ss[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    9.899e-18    9.899e-18
      ols            2            0    1.953e-16    1.953e-16
  lassocv            3            0    1.783e-16    1.783e-16
  ridgecv            4            0    .38607651    .38607651
  lassocv            5            0    3.687e-18    3.687e-18
  ridgecv            6            0    .02800883    .02800883
       rf            7            0    .41565541    .41565541
       rf            8            0    2.109e-16    2.109e-16
       rf            9            0            0            0
gradboost           10            0    .01005148    .01005148
gradboost           11            0     .1528959     .1528959
     nnet           12            0            0            0
     nnet           13            0    .00731188    .00731188
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1    4.765e-17    4.765e-17
  ridgecv            4            1    .07192639    .07192639
  lassocv            5            1    .31602158    .31602158
  ridgecv            6            1    2.710e-17    2.710e-17
       rf            7            1    .47226494    .47226494
       rf            8            1    4.288e-17    4.288e-17
       rf            9            1    1.290e-16    1.290e-16
gradboost           10            1    2.600e-17    2.600e-17
gradboost           11            1     .1052083     .1052083
     nnet           12            1    1.422e-16    1.422e-16
     nnet           13            1    .03457879    .03457879

      +-------------------------------------------------------------------+
      | Y_lne~1_1   Y_lne~0_1   Y_lne~s1   Y_lnea~2   Y_lnea~3   Y_lnea~4 |
      |-------------------------------------------------------------------|
   1. |   2.53972   2.7416688          1          0   9.90e-18   9.90e-18 |
   2. | 2.9688186   3.2498666          2          0   1.95e-16   1.95e-16 |
   3. | 2.7385796   2.8513574          3          0   1.78e-16   1.78e-16 |
   4. | 2.4857126   2.5646378          4          0   .3860765   .3860765 |
   5. | 3.1380079    3.178931          5          0   3.69e-18   3.69e-18 |
      |-------------------------------------------------------------------|
   6. | 2.5347791   2.6830372          6          0   .0280088   .0280088 |
   7. | 2.4253556   2.6581428          7          0   .4156554   .4156554 |
   8. | 2.6541397   2.7050033          8          0   2.11e-16   2.11e-16 |
      +-------------------------------------------------------------------+
(note: file out_53356/Y_lnearn_ss_nnls1_short_ia.dta not found)
file out_53356/Y_lnearn_ss_nnls1_short_ia.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1     .1546567     .1546567
    logit            2            0            0
  lassocv            3    .17850504    .17850504
  ridgecv            4    .06303758    .06303758
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7    .23226466    .23226466
       rf            8    2.467e-17    2.467e-17
       rf            9    3.272e-16    3.272e-16
gradboost           10    .05975222    .05975222
gradboost           11     .3117838     .3117838
     nnet           12    9.754e-17    9.754e-17
     nnet           13    3.406e-17    3.406e-17

short-stacked weights across resamples for lnearn
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    9.899e-18    9.899e-18
      ols            2            0    1.953e-16    1.953e-16
  lassocv            3            0    1.783e-16    1.783e-16
  ridgecv            4            0    .38607651    .38607651
  lassocv            5            0    3.687e-18    3.687e-18
  ridgecv            6            0    .02800883    .02800883
       rf            7            0    .41565541    .41565541
       rf            8            0    2.109e-16    2.109e-16
       rf            9            0            0            0
gradboost           10            0    .01005148    .01005148
gradboost           11            0     .1528959     .1528959
     nnet           12            0            0            0
     nnet           13            0    .00731188    .00731188
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1    4.765e-17    4.765e-17
  ridgecv            4            1    .07192639    .07192639
  lassocv            5            1    .31602158    .31602158
  ridgecv            6            1    2.710e-17    2.710e-17
       rf            7            1    .47226494    .47226494
       rf            8            1    4.288e-17    4.288e-17
       rf            9            1    1.290e-16    1.290e-16
gradboost           10            1    2.600e-17    2.600e-17
gradboost           11            1     .1052083     .1052083
     nnet           12            1    1.422e-16    1.422e-16
     nnet           13            1    .03457879    .03457879

D_gender_r_ss[13,3]
               learner  mean_weight        rep_1
    logit            1     .1546567     .1546567
    logit            2            0            0
  lassocv            3    .17850504    .17850504
  ridgecv            4    .06303758    .06303758
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7    .23226466    .23226466
       rf            8    2.467e-17    2.467e-17
       rf            9    3.272e-16    3.272e-16
gradboost           10    .05975222    .05975222
gradboost           11     .3117838     .3117838
     nnet           12    9.754e-17    9.754e-17
     nnet           13    3.406e-17    3.406e-17

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .78174277          1   .1546567   .1546567 |
   2. | .34607364          2          0          0 |
   3. | .06316211          3    .178505    .178505 |
   4. | .16767894          4   .0630376   .0630376 |
   5. | .59016247          5          0          0 |
      |--------------------------------------------|
   6. | .86272672          6          0          0 |
   7. | .78726846          7   .2322647   .2322647 |
   8. | .75817524          8   2.47e-17   2.47e-17 |
      +--------------------------------------------+
(note: file out_53356/D_gender_r_ss_nnls1_short_ia.dta not found)
file out_53356/D_gender_r_ss_nnls1_short_ia.dta saved

pool-stacked weights across resamples for gender_r
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .26906192    .26906192
    logit            2            0            0
  lassocv            3    .16152365    .16152365
  ridgecv            4    .04039916    .04039916
  lassocv            5    2.427e-16    2.427e-16
  ridgecv            6    6.700e-17    6.700e-17
       rf            7     .2901935     .2901935
       rf            8    4.527e-16    4.527e-16
       rf            9    4.489e-16    4.489e-16
gradboost           10            0            0
gradboost           11    .22394654    .22394654
     nnet           12    1.775e-16    1.775e-16
     nnet           13    .01487522    .01487522

pool-stacked weights across resamples for lnearn
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .01357774    .01357774
      ols            2            0    8.922e-16    8.922e-16
  lassocv            3            0    .11028836    .11028836
  ridgecv            4            0    .26824162    .26824162
  lassocv            5            0    3.585e-16    3.585e-16
  ridgecv            6            0            0            0
       rf            7            0    .46002374    .46002374
       rf            8            0    2.886e-16    2.886e-16
       rf            9            0    8.682e-16    8.682e-16
gradboost           10            0    7.526e-16    7.526e-16
gradboost           11            0    .14786855    .14786855
     nnet           12            0    3.579e-16    3.579e-16
     nnet           13            0    3.230e-16    3.230e-16
      ols            1            1    2.705e-14    2.705e-14
      ols            2            1            0            0
  lassocv            3            1    .27998908    .27998908
  ridgecv            4            1    .07787127    .07787127
  lassocv            5            1    .03094582    .03094582
  ridgecv            6            1    1.965e-13    1.965e-13
       rf            7            1    .52841229    .52841229
       rf            8            1    9.382e-14    9.382e-14
       rf            9            1    8.635e-14    8.635e-14
gradboost           10            1    3.482e-14    3.482e-14
gradboost           11            1    .08278154    .08278154
     nnet           12            1    3.752e-17    3.752e-17
     nnet           13            1    7.283e-17    7.283e-17

pool-stacked weights across resamples for gender_r
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .26906192    .26906192
    logit            2            0            0
  lassocv            3    .16152365    .16152365
  ridgecv            4    .04039916    .04039916
  lassocv            5    2.427e-16    2.427e-16
  ridgecv            6    6.700e-17    6.700e-17
       rf            7     .2901935     .2901935
       rf            8    4.527e-16    4.527e-16
       rf            9    4.489e-16    4.489e-16
gradboost           10            0            0
gradboost           11    .22394654    .22394654
     nnet           12    1.775e-16    1.775e-16
     nnet           13    .01487522    .01487522

pool-stacked weights across resamples for lnearn
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .01357774    .01357774
      ols            2            0    8.922e-16    8.922e-16
  lassocv            3            0    .11028836    .11028836
  ridgecv            4            0    .26824162    .26824162
  lassocv            5            0    3.585e-16    3.585e-16
  ridgecv            6            0            0            0
       rf            7            0    .46002374    .46002374
       rf            8            0    2.886e-16    2.886e-16
       rf            9            0    8.682e-16    8.682e-16
gradboost           10            0    7.526e-16    7.526e-16
gradboost           11            0    .14786855    .14786855
     nnet           12            0    3.579e-16    3.579e-16
     nnet           13            0    3.230e-16    3.230e-16
      ols            1            1    2.705e-14    2.705e-14
      ols            2            1            0            0
  lassocv            3            1    .27998908    .27998908
  ridgecv            4            1    .07787127    .07787127
  lassocv            5            1    .03094582    .03094582
  ridgecv            6            1    1.965e-13    1.965e-13
       rf            7            1    .52841229    .52841229
       rf            8            1    9.382e-14    9.382e-14
       rf            9            1    8.635e-14    8.635e-14
gradboost           10            1    3.482e-14    3.482e-14
gradboost           11            1    .08278154    .08278154
     nnet           12            1    3.752e-17    3.752e-17
     nnet           13            1    7.283e-17    7.283e-17

Y_lnearn_ps[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .01357774    .01357774
      ols            2            0    8.922e-16    8.922e-16
  lassocv            3            0    .11028836    .11028836
  ridgecv            4            0    .26824162    .26824162
  lassocv            5            0    3.585e-16    3.585e-16
  ridgecv            6            0            0            0
       rf            7            0    .46002374    .46002374
       rf            8            0    2.886e-16    2.886e-16
       rf            9            0    8.682e-16    8.682e-16
gradboost           10            0    7.526e-16    7.526e-16
gradboost           11            0    .14786855    .14786855
     nnet           12            0    3.579e-16    3.579e-16
     nnet           13            0    3.230e-16    3.230e-16
      ols            1            1    2.705e-14    2.705e-14
      ols            2            1            0            0
  lassocv            3            1    .27998908    .27998908
  ridgecv            4            1    .07787127    .07787127
  lassocv            5            1    .03094582    .03094582
  ridgecv            6            1    1.965e-13    1.965e-13
       rf            7            1    .52841229    .52841229
       rf            8            1    9.382e-14    9.382e-14
       rf            9            1    8.635e-14    8.635e-14
gradboost           10            1    3.482e-14    3.482e-14
gradboost           11            1    .08278154    .08278154
     nnet           12            1    3.752e-17    3.752e-17
     nnet           13            1    7.283e-17    7.283e-17

      +-------------------------------------------------------------------+
      | Y_lne~1_1   Y_lne~0_1   Y_lne~s1   Y_lnea~2   Y_lnea~3   Y_lnea~4 |
      |-------------------------------------------------------------------|
   1. | 2.5329372   2.7286443          1          0   .0135777   .0135777 |
   2. | 2.9474081   3.2698567          2          0   8.92e-16   8.92e-16 |
   3. | 2.7574218    2.852384          3          0   .1102884   .1102884 |
   4. | 2.4913559   2.5582929          4          0   .2682416   .2682416 |
   5. | 3.1411787    3.175486          5          0   3.59e-16   3.59e-16 |
      |-------------------------------------------------------------------|
   6. | 2.5219633   2.6875039          6          0          0          0 |
   7. | 2.4011855   2.6629557          7          0   .4600237   .4600237 |
   8. |  2.640352   2.7086165          8          0   2.89e-16   2.89e-16 |
      +-------------------------------------------------------------------+
(note: file out_53356/Y_lnearn_ps_nnls1_pooled_ia.dta not found)
file out_53356/Y_lnearn_ps_nnls1_pooled_ia.dta saved

pool-stacked weights across resamples for gender_r
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .26906192    .26906192
    logit            2            0            0
  lassocv            3    .16152365    .16152365
  ridgecv            4    .04039916    .04039916
  lassocv            5    2.427e-16    2.427e-16
  ridgecv            6    6.700e-17    6.700e-17
       rf            7     .2901935     .2901935
       rf            8    4.527e-16    4.527e-16
       rf            9    4.489e-16    4.489e-16
gradboost           10            0            0
gradboost           11    .22394654    .22394654
     nnet           12    1.775e-16    1.775e-16
     nnet           13    .01487522    .01487522

pool-stacked weights across resamples for lnearn
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .01357774    .01357774
      ols            2            0    8.922e-16    8.922e-16
  lassocv            3            0    .11028836    .11028836
  ridgecv            4            0    .26824162    .26824162
  lassocv            5            0    3.585e-16    3.585e-16
  ridgecv            6            0            0            0
       rf            7            0    .46002374    .46002374
       rf            8            0    2.886e-16    2.886e-16
       rf            9            0    8.682e-16    8.682e-16
gradboost           10            0    7.526e-16    7.526e-16
gradboost           11            0    .14786855    .14786855
     nnet           12            0    3.579e-16    3.579e-16
     nnet           13            0    3.230e-16    3.230e-16
      ols            1            1    2.705e-14    2.705e-14
      ols            2            1            0            0
  lassocv            3            1    .27998908    .27998908
  ridgecv            4            1    .07787127    .07787127
  lassocv            5            1    .03094582    .03094582
  ridgecv            6            1    1.965e-13    1.965e-13
       rf            7            1    .52841229    .52841229
       rf            8            1    9.382e-14    9.382e-14
       rf            9            1    8.635e-14    8.635e-14
gradboost           10            1    3.482e-14    3.482e-14
gradboost           11            1    .08278154    .08278154
     nnet           12            1    3.752e-17    3.752e-17
     nnet           13            1    7.283e-17    7.283e-17

D_gender_r_ps[13,3]
               learner  mean_weight        rep_1
    logit            1    .26906192    .26906192
    logit            2            0            0
  lassocv            3    .16152365    .16152365
  ridgecv            4    .04039916    .04039916
  lassocv            5    2.427e-16    2.427e-16
  ridgecv            6    6.700e-17    6.700e-17
       rf            7     .2901935     .2901935
       rf            8    4.527e-16    4.527e-16
       rf            9    4.489e-16    4.489e-16
gradboost           10            0            0
gradboost           11    .22394654    .22394654
     nnet           12    1.775e-16    1.775e-16
     nnet           13    .01487522    .01487522

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .78302552          1   .2690619   .2690619 |
   2. | .34933163          2          0          0 |
   3. | .07544187          3   .1615236   .1615236 |
   4. | .15171197          4   .0403992   .0403992 |
   5. | .58230157          5   2.43e-16   2.43e-16 |
      |--------------------------------------------|
   6. | .86116719          6   6.70e-17   6.70e-17 |
   7. | .81182094          7   .2901935   .2901935 |
   8. | .75464064          8   4.53e-16   4.53e-16 |
      +--------------------------------------------+
(note: file out_53356/D_gender_r_ps_nnls1_pooled_ia.dta not found)
file out_53356/D_gender_r_ps_nnls1_pooled_ia.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.054    (0.040)
  ss  1  [shortstack]          [ss]          [ss]    -0.084    (0.019)
  ps  1   [poolstack]          [ps]          [ps]    -0.057    (0.040)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0838413   .0185915    -4.51   0.000      -.12028   -.0474027
------------------------------------------------------------------------------
Stacking final estimator: singlebest
Warning: 1 propensity scores trimmed to lower limit .01.



Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.054    (0.040)
  ss  1  [shortstack]          [ss]          [ss]    -0.084    (0.019)
  ps  1   [poolstack]          [ps]          [ps]    -0.057    (0.040)

Stacking DDML model (ATET)
E[y|X,D=0]   = Y1_pystacked0_1                     Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1
E[D|X]       = D1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0536524   .0400212    -1.34   0.180    -.1320925    .0247877
------------------------------------------------------------------------------
Stacking final estimator: singlebest
Warning: 91 propensity scores trimmed to lower limit .01.
Warning: 20 propensity scores trimmed to upper limit .99.
Warning: . resamples had propensity scores trimmed to upper limit .99.

file out_53356/results.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  ss  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.084    (0.019)
  ss  1  [shortstack]          [ss]          [ss]    -0.084    (0.019)
  ps  1   [poolstack]          [ps]          [ps]    -0.057    (0.040)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0838413   .0185915    -4.51   0.000      -.12028   -.0474027
------------------------------------------------------------------------------
Stacking final estimator: singlebest
Warning: 1 propensity scores trimmed to lower limit .01.

file out_53356/results.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  ps  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.057    (0.040)
  ss  1  [shortstack]          [ss]          [ss]    -0.084    (0.019)
  ps  1   [poolstack]          [ps]          [ps]    -0.057    (0.040)

Poolstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ps0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ps1
E[D|X]       = D_gender_r_ps_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0565878   .0400728    -1.41   0.158    -.1351291    .0219534
------------------------------------------------------------------------------
Stacking final estimator: singlebest
Warning: 91 propensity scores trimmed to lower limit .01.
Warning: 20 propensity scores trimmed to upper limit .99.
Warning: . resamples had propensity scores trimmed to upper limit .99.

file out_53356/results.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3           .9           .9
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10           .1           .1
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0           .2           .2
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0           .8           .8
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3           .9           .9
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10           .1           .1
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0           .2           .2
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0           .8           .8
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

Y1_pystacked_w_mn[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0           .2           .2
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0           .8           .8
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

      +-------------------------------------------+
      | Y1_pys~1   Y1_pys~2   Y1_pys~3   Y1_pys~4 |
      |-------------------------------------------|
   1. |        1          0          0          0 |
   2. |        2          0          0          0 |
   3. |        3          0          0          0 |
   4. |        4          0         .2         .2 |
   5. |        5          0          0          0 |
      |-------------------------------------------|
   6. |        6          0          0          0 |
   7. |        7          0         .8         .8 |
   8. |        8          0          0          0 |
      +-------------------------------------------+
(note: file out_53356/Y1_pystacked_w_mn_singlebest_regular_ia.dta not found)
file out_53356/Y1_pystacked_w_mn_singlebest_regular_ia.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3           .9           .9
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10           .1           .1
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0           .2           .2
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0           .8           .8
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

D1_pystacked_w_mn[13,3]
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3           .9           .9
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10           .1           .1
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

      +--------------------------------+
      | D1_pys~1   D1_pys~2   D1_pys~3 |
      |--------------------------------|
   1. |        1          0          0 |
   2. |        2          0          0 |
   3. |        3         .9         .9 |
   4. |        4          0          0 |
   5. |        5          0          0 |
      |--------------------------------|
   6. |        6          0          0 |
   7. |        7          0          0 |
   8. |        8          0          0 |
      +--------------------------------+
(note: file out_53356/D1_pystacked_w_mn_singlebest_regular_ia.dta not found)
file out_53356/D1_pystacked_w_mn_singlebest_regular_ia.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3            0            0
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            1            1
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

short-stacked weights across resamples for lnearn
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

short-stacked weights across resamples for gender_r
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3            0            0
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            1            1
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

short-stacked weights across resamples for lnearn
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

Y_lnearn_ss[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

      +-------------------------------------------------------------------+
      | Y_lne~1_1   Y_lne~0_1   Y_lne~s1   Y_lnea~2   Y_lnea~3   Y_lnea~4 |
      |-------------------------------------------------------------------|
   1. | 2.5161593   2.7472537          1          0          0          0 |
   2. | 2.8711729   3.2115417          2          0          0          0 |
   3. | 2.8027568    2.897948          3          0          0          0 |
   4. | 2.5003576   2.5846353          4          0          0          0 |
   5. | 3.1349566   3.1678703          5          0          0          0 |
      |-------------------------------------------------------------------|
   6. | 2.4772336   2.7197869          6          0          0          0 |
   7. | 2.5259488   2.8288107          7          0          1          1 |
   8. | 2.6126902   2.8003244          8          0          0          0 |
      +-------------------------------------------------------------------+
(note: file out_53356/Y_lnearn_ss_singlebest_short_ia.dta not found)
file out_53356/Y_lnearn_ss_singlebest_short_ia.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3            0            0
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            1            1
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

short-stacked weights across resamples for lnearn
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

D_gender_r_ss[13,3]
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3            0            0
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            1            1
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .79544544          1          0          0 |
   2. | .41465431          2          0          0 |
   3. | .08072534          3          0          0 |
   4. | .28043658          4          0          0 |
   5. | .58879864          5          0          0 |
      |--------------------------------------------|
   6. | .87871259          6          0          0 |
   7. |  .5987578          7          0          0 |
   8. | .80961227          8          0          0 |
      +--------------------------------------------+
(note: file out_53356/D_gender_r_ss_singlebest_short_ia.dta not found)
file out_53356/D_gender_r_ss_singlebest_short_ia.dta saved

pool-stacked weights across resamples for gender_r
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3            1            1
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

pool-stacked weights across resamples for lnearn
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

pool-stacked weights across resamples for gender_r
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3            1            1
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

pool-stacked weights across resamples for lnearn
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

Y_lnearn_ps[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

      +-------------------------------------------------------------------+
      | Y_lne~1_1   Y_lne~0_1   Y_lne~s1   Y_lnea~2   Y_lnea~3   Y_lnea~4 |
      |-------------------------------------------------------------------|
   1. | 2.5161593   2.7472537          1          0          0          0 |
   2. | 2.8711729   3.2115417          2          0          0          0 |
   3. | 2.8027568    2.897948          3          0          0          0 |
   4. | 2.5003576   2.5846353          4          0          0          0 |
   5. | 3.1349566   3.1678703          5          0          0          0 |
      |-------------------------------------------------------------------|
   6. | 2.4772336   2.7197869          6          0          0          0 |
   7. | 2.5259488   2.8288107          7          0          1          1 |
   8. | 2.6126902   2.8003244          8          0          0          0 |
      +-------------------------------------------------------------------+
(note: file out_53356/Y_lnearn_ps_singlebest_pooled_ia.dta not found)
file out_53356/Y_lnearn_ps_singlebest_pooled_ia.dta saved

pool-stacked weights across resamples for gender_r
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3            1            1
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

pool-stacked weights across resamples for lnearn
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

D_gender_r_ps[13,3]
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3            1            1
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .71638709          1          0          0 |
   2. | .29273772          2          0          0 |
   3. | .03611705          3          1          1 |
   4. | .15248208          4          0          0 |
   5. | .57069856          5          0          0 |
      |--------------------------------------------|
   6. | .82290125          6          0          0 |
   7. | .79875672          7          0          0 |
   8. | .51136208          8          0          0 |
      +--------------------------------------------+
(note: file out_53356/D_gender_r_ps_singlebest_pooled_ia.dta not found)
file out_53356/D_gender_r_ps_singlebest_pooled_ia.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked     9.426    (0.717)
  ss  1  [shortstack]          [ss]          [ss]    -0.199    (0.090)
  ps  1   [poolstack]          [ps]          [ps]     0.216    (0.105)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1985062   .0897302    -2.21   0.027    -.3743743   -.0226382
------------------------------------------------------------------------------
Stacking final estimator: ols
Warning: 1 propensity scores trimmed to lower limit .01.
Warning: 478 propensity scores trimmed to upper limit .99.
Warning: . resamples had propensity scores trimmed to upper limit .99.



Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked     9.426    (0.717)
  ss  1  [shortstack]          [ss]          [ss]    -0.199    (0.090)
  ps  1   [poolstack]          [ps]          [ps]     0.216    (0.105)

Stacking DDML model (ATET)
E[y|X,D=0]   = Y1_pystacked0_1                     Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1
E[D|X]       = D1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |   9.426345   .7170473    13.15   0.000     8.020958    10.83173
------------------------------------------------------------------------------
Stacking final estimator: ols
Warning: 2296 propensity scores trimmed to lower limit .01.
Warning: 585 propensity scores trimmed to upper limit .99.
Warning: . resamples had propensity scores trimmed to upper limit .99.

(note: variable final was str3, now str10 to accommodate using data's values)
file out_53356/results.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  ss  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.199    (0.090)
  ss  1  [shortstack]          [ss]          [ss]    -0.199    (0.090)
  ps  1   [poolstack]          [ps]          [ps]     0.216    (0.105)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1985062   .0897302    -2.21   0.027    -.3743743   -.0226382
------------------------------------------------------------------------------
Stacking final estimator: ols
Warning: 1 propensity scores trimmed to lower limit .01.
Warning: 478 propensity scores trimmed to upper limit .99.
Warning: . resamples had propensity scores trimmed to upper limit .99.

(note: variable final was str3, now str10 to accommodate using data's values)
file out_53356/results.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  ps  1  Y1_pystacked  Y1_pystacked  D1_pystacked     0.216    (0.105)
  ss  1  [shortstack]          [ss]          [ss]    -0.199    (0.090)
  ps  1   [poolstack]          [ps]          [ps]     0.216    (0.105)

Poolstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ps0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ps1
E[D|X]       = D_gender_r_ps_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |   .2160149   .1048374     2.06   0.039     .0105373    .4214925
------------------------------------------------------------------------------
Stacking final estimator: ols
Warning: 1 propensity scores trimmed to lower limit .01.
Warning: 386 propensity scores trimmed to upper limit .99.
Warning: . resamples had propensity scores trimmed to upper limit .99.

(note: variable final was str3, now str10 to accommodate using data's values)
file out_53356/results.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .21930494    .21930494
    logit            2     .0828896     .0828896
  lassocv            3    .36001788    .36001788
  ridgecv            4    .11069317    .11069317
  lassocv            5   -.22307784   -.22307784
  ridgecv            6   -.00201703   -.00201703
       rf            7    .42717895    .42717895
       rf            8    .06647871    .06647871
       rf            9    -.1675458    -.1675458
gradboost           10    .03779827    .03779827
gradboost           11    .16010737    .16010737
     nnet           12   -1.1006453   -1.1006453
     nnet           13    .01292631    .01292631

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .02110185    .02110185
      ols            2            0   -.01706967   -.01706967
  lassocv            3            0    .00231121    .00231121
  ridgecv            4            0    .51470598    .51470598
  lassocv            5            0   -.01666463   -.01666463
  ridgecv            6            0    -.0652128    -.0652128
       rf            7            0    .72422885    .72422885
       rf            8            0   -.30495563   -.30495563
       rf            9            0    .12457659    .12457659
gradboost           10            0    .05414555    .05414555
gradboost           11            0    .05922547    .05922547
     nnet           12            0   -.06045455   -.06045455
     nnet           13            0   -.01300164   -.01300164
      ols            1            1    .00223599    .00223599
      ols            2            1   -.02745595   -.02745595
  lassocv            3            1     .0291698     .0291698
  ridgecv            4            1    .32685175    .32685175
  lassocv            5            1    .20957918    .20957918
  ridgecv            6            1   -.12624999   -.12624999
       rf            7            1    .58280397    .58280397
       rf            8            1    .37134436    .37134436
       rf            9            1   -.25115215   -.25115215
gradboost           10            1   -.12028064   -.12028064
gradboost           11            1    .06870155    .06870155
     nnet           12            1   -.15896015   -.15896015
     nnet           13            1   -.01034234   -.01034234

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .21930494    .21930494
    logit            2     .0828896     .0828896
  lassocv            3    .36001788    .36001788
  ridgecv            4    .11069317    .11069317
  lassocv            5   -.22307784   -.22307784
  ridgecv            6   -.00201703   -.00201703
       rf            7    .42717895    .42717895
       rf            8    .06647871    .06647871
       rf            9    -.1675458    -.1675458
gradboost           10    .03779827    .03779827
gradboost           11    .16010737    .16010737
     nnet           12   -1.1006453   -1.1006453
     nnet           13    .01292631    .01292631

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .02110185    .02110185
      ols            2            0   -.01706967   -.01706967
  lassocv            3            0    .00231121    .00231121
  ridgecv            4            0    .51470598    .51470598
  lassocv            5            0   -.01666463   -.01666463
  ridgecv            6            0    -.0652128    -.0652128
       rf            7            0    .72422885    .72422885
       rf            8            0   -.30495563   -.30495563
       rf            9            0    .12457659    .12457659
gradboost           10            0    .05414555    .05414555
gradboost           11            0    .05922547    .05922547
     nnet           12            0   -.06045455   -.06045455
     nnet           13            0   -.01300164   -.01300164
      ols            1            1    .00223599    .00223599
      ols            2            1   -.02745595   -.02745595
  lassocv            3            1     .0291698     .0291698
  ridgecv            4            1    .32685175    .32685175
  lassocv            5            1    .20957918    .20957918
  ridgecv            6            1   -.12624999   -.12624999
       rf            7            1    .58280397    .58280397
       rf            8            1    .37134436    .37134436
       rf            9            1   -.25115215   -.25115215
gradboost           10            1   -.12028064   -.12028064
gradboost           11            1    .06870155    .06870155
     nnet           12            1   -.15896015   -.15896015
     nnet           13            1   -.01034234   -.01034234

Y1_pystacked_w_mn[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .02110185    .02110185
      ols            2            0   -.01706967   -.01706967
  lassocv            3            0    .00231121    .00231121
  ridgecv            4            0    .51470598    .51470598
  lassocv            5            0   -.01666463   -.01666463
  ridgecv            6            0    -.0652128    -.0652128
       rf            7            0    .72422885    .72422885
       rf            8            0   -.30495563   -.30495563
       rf            9            0    .12457659    .12457659
gradboost           10            0    .05414555    .05414555
gradboost           11            0    .05922547    .05922547
     nnet           12            0   -.06045455   -.06045455
     nnet           13            0   -.01300164   -.01300164
      ols            1            1    .00223599    .00223599
      ols            2            1   -.02745595   -.02745595
  lassocv            3            1     .0291698     .0291698
  ridgecv            4            1    .32685175    .32685175
  lassocv            5            1    .20957918    .20957918
  ridgecv            6            1   -.12624999   -.12624999
       rf            7            1    .58280397    .58280397
       rf            8            1    .37134436    .37134436
       rf            9            1   -.25115215   -.25115215
gradboost           10            1   -.12028064   -.12028064
gradboost           11            1    .06870155    .06870155
     nnet           12            1   -.15896015   -.15896015
     nnet           13            1   -.01034234   -.01034234

      +---------------------------------------------+
      | Y1_pys~1   Y1_pys~2   Y1_pyst~3   Y1_pyst~4 |
      |---------------------------------------------|
   1. |        1          0    .0211018    .0211018 |
   2. |        2          0   -.0170697   -.0170697 |
   3. |        3          0    .0023112    .0023112 |
   4. |        4          0     .514706     .514706 |
   5. |        5          0   -.0166646   -.0166646 |
      |---------------------------------------------|
   6. |        6          0   -.0652128   -.0652128 |
   7. |        7          0    .7242289    .7242289 |
   8. |        8          0   -.3049556   -.3049556 |
      +---------------------------------------------+
(note: file out_53356/Y1_pystacked_w_mn_ols_regular_ia.dta not found)
file out_53356/Y1_pystacked_w_mn_ols_regular_ia.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .21930494    .21930494
    logit            2     .0828896     .0828896
  lassocv            3    .36001788    .36001788
  ridgecv            4    .11069317    .11069317
  lassocv            5   -.22307784   -.22307784
  ridgecv            6   -.00201703   -.00201703
       rf            7    .42717895    .42717895
       rf            8    .06647871    .06647871
       rf            9    -.1675458    -.1675458
gradboost           10    .03779827    .03779827
gradboost           11    .16010737    .16010737
     nnet           12   -1.1006453   -1.1006453
     nnet           13    .01292631    .01292631

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .02110185    .02110185
      ols            2            0   -.01706967   -.01706967
  lassocv            3            0    .00231121    .00231121
  ridgecv            4            0    .51470598    .51470598
  lassocv            5            0   -.01666463   -.01666463
  ridgecv            6            0    -.0652128    -.0652128
       rf            7            0    .72422885    .72422885
       rf            8            0   -.30495563   -.30495563
       rf            9            0    .12457659    .12457659
gradboost           10            0    .05414555    .05414555
gradboost           11            0    .05922547    .05922547
     nnet           12            0   -.06045455   -.06045455
     nnet           13            0   -.01300164   -.01300164
      ols            1            1    .00223599    .00223599
      ols            2            1   -.02745595   -.02745595
  lassocv            3            1     .0291698     .0291698
  ridgecv            4            1    .32685175    .32685175
  lassocv            5            1    .20957918    .20957918
  ridgecv            6            1   -.12624999   -.12624999
       rf            7            1    .58280397    .58280397
       rf            8            1    .37134436    .37134436
       rf            9            1   -.25115215   -.25115215
gradboost           10            1   -.12028064   -.12028064
gradboost           11            1    .06870155    .06870155
     nnet           12            1   -.15896015   -.15896015
     nnet           13            1   -.01034234   -.01034234

D1_pystacked_w_mn[13,3]
               learner  mean_weight        rep_1
    logit            1    .21930494    .21930494
    logit            2     .0828896     .0828896
  lassocv            3    .36001788    .36001788
  ridgecv            4    .11069317    .11069317
  lassocv            5   -.22307784   -.22307784
  ridgecv            6   -.00201703   -.00201703
       rf            7    .42717895    .42717895
       rf            8    .06647871    .06647871
       rf            9    -.1675458    -.1675458
gradboost           10    .03779827    .03779827
gradboost           11    .16010737    .16010737
     nnet           12   -1.1006453   -1.1006453
     nnet           13    .01292631    .01292631

      +----------------------------------+
      | D1_pys~1   D1_pyst~2   D1_pyst~3 |
      |----------------------------------|
   1. |        1    .2193049    .2193049 |
   2. |        2    .0828896    .0828896 |
   3. |        3    .3600179    .3600179 |
   4. |        4    .1106932    .1106932 |
   5. |        5   -.2230778   -.2230778 |
      |----------------------------------|
   6. |        6    -.002017    -.002017 |
   7. |        7    .4271789    .4271789 |
   8. |        8    .0664787    .0664787 |
      +----------------------------------+
(note: file out_53356/D1_pystacked_w_mn_ols_regular_ia.dta not found)
file out_53356/D1_pystacked_w_mn_ols_regular_ia.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .15309059    .15309059
    logit            2    .06034928    .06034928
  lassocv            3    .36621144    .36621144
  ridgecv            4    .21338105    .21338105
  lassocv            5   -.32773655   -.32773655
  ridgecv            6   -.05882845   -.05882845
       rf            7    .37049064    .37049064
       rf            8    .00204639    .00204639
       rf            9   -.16171679   -.16171679
gradboost           10    .20465153    .20465153
gradboost           11    .22440515    .22440515
     nnet           12    .06569283    .06569283
     nnet           13     .0064937     .0064937

short-stacked weights across resamples for lnearn
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0   -.02437103   -.02437103
      ols            2            0    .00556327    .00556327
  lassocv            3            0    -.2510507    -.2510507
  ridgecv            4            0    .78465385    .78465385
  lassocv            5            0   -.05293033   -.05293033
  ridgecv            6            0    .01133741    .01133741
       rf            7            0    .58336746    .58336746
       rf            8            0    .55051504    .55051504
       rf            9            0   -.83623896   -.83623896
gradboost           10            0    .14482703    .14482703
gradboost           11            0    .05581254    .05581254
     nnet           12            0   -.02542369   -.02542369
     nnet           13            0   -.00065889   -.00065889
      ols            1            1   -.04247659   -.04247659
      ols            2            1   -.02176899   -.02176899
  lassocv            3            1   -.39906545   -.39906545
  ridgecv            4            1    .49899834    .49899834
  lassocv            5            1    .51673077    .51673077
  ridgecv            6            1   -.11851707   -.11851707
       rf            7            1    .55845537    .55845537
       rf            8            1   -.11737261   -.11737261
       rf            9            1    .03722694    .03722694
gradboost           10            1    .09872124    .09872124
gradboost           11            1    .05432689    .05432689
     nnet           12            1    .00514638    .00514638
     nnet           13            1    .03052717    .03052717

short-stacked weights across resamples for gender_r
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .15309059    .15309059
    logit            2    .06034928    .06034928
  lassocv            3    .36621144    .36621144
  ridgecv            4    .21338105    .21338105
  lassocv            5   -.32773655   -.32773655
  ridgecv            6   -.05882845   -.05882845
       rf            7    .37049064    .37049064
       rf            8    .00204639    .00204639
       rf            9   -.16171679   -.16171679
gradboost           10    .20465153    .20465153
gradboost           11    .22440515    .22440515
     nnet           12    .06569283    .06569283
     nnet           13     .0064937     .0064937

short-stacked weights across resamples for lnearn
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0   -.02437103   -.02437103
      ols            2            0    .00556327    .00556327
  lassocv            3            0    -.2510507    -.2510507
  ridgecv            4            0    .78465385    .78465385
  lassocv            5            0   -.05293033   -.05293033
  ridgecv            6            0    .01133741    .01133741
       rf            7            0    .58336746    .58336746
       rf            8            0    .55051504    .55051504
       rf            9            0   -.83623896   -.83623896
gradboost           10            0    .14482703    .14482703
gradboost           11            0    .05581254    .05581254
     nnet           12            0   -.02542369   -.02542369
     nnet           13            0   -.00065889   -.00065889
      ols            1            1   -.04247659   -.04247659
      ols            2            1   -.02176899   -.02176899
  lassocv            3            1   -.39906545   -.39906545
  ridgecv            4            1    .49899834    .49899834
  lassocv            5            1    .51673077    .51673077
  ridgecv            6            1   -.11851707   -.11851707
       rf            7            1    .55845537    .55845537
       rf            8            1   -.11737261   -.11737261
       rf            9            1    .03722694    .03722694
gradboost           10            1    .09872124    .09872124
gradboost           11            1    .05432689    .05432689
     nnet           12            1    .00514638    .00514638
     nnet           13            1    .03052717    .03052717

Y_lnearn_ss[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0   -.02437103   -.02437103
      ols            2            0    .00556327    .00556327
  lassocv            3            0    -.2510507    -.2510507
  ridgecv            4            0    .78465385    .78465385
  lassocv            5            0   -.05293033   -.05293033
  ridgecv            6            0    .01133741    .01133741
       rf            7            0    .58336746    .58336746
       rf            8            0    .55051504    .55051504
       rf            9            0   -.83623896   -.83623896
gradboost           10            0    .14482703    .14482703
gradboost           11            0    .05581254    .05581254
     nnet           12            0   -.02542369   -.02542369
     nnet           13            0   -.00065889   -.00065889
      ols            1            1   -.04247659   -.04247659
      ols            2            1   -.02176899   -.02176899
  lassocv            3            1   -.39906545   -.39906545
  ridgecv            4            1    .49899834    .49899834
  lassocv            5            1    .51673077    .51673077
  ridgecv            6            1   -.11851707   -.11851707
       rf            7            1    .55845537    .55845537
       rf            8            1   -.11737261   -.11737261
       rf            9            1    .03722694    .03722694
gradboost           10            1    .09872124    .09872124
gradboost           11            1    .05432689    .05432689
     nnet           12            1    .00514638    .00514638
     nnet           13            1    .03052717    .03052717

      +---------------------------------------------------------------------+
      | Y_lne~1_1   Y_lne~0_1   Y_lne~s1   Y_lnea~2   Y_lnear~3   Y_lnear~4 |
      |---------------------------------------------------------------------|
   1. | 2.7734715   2.5765845          1          0    -.024371    -.024371 |
   2. | 3.2349198    3.083352          2          0    .0055633    .0055633 |
   3. | 3.0090282   2.7080608          3          0   -.2510507   -.2510507 |
   4. | 2.7167879   2.3866048          4          0    .7846538    .7846538 |
   5. | 3.4509741   3.0735714          5          0   -.0529303   -.0529303 |
      |---------------------------------------------------------------------|
   6. |  2.793997    2.512244          6          0    .0113374    .0113374 |
   7. | 2.6436069   2.5250493          7          0    .5833675    .5833675 |
   8. |  2.922194    2.544061          8          0    .5505151    .5505151 |
      +---------------------------------------------------------------------+
(note: file out_53356/Y_lnearn_ss_ols_short_ia.dta not found)
file out_53356/Y_lnearn_ss_ols_short_ia.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .15309059    .15309059
    logit            2    .06034928    .06034928
  lassocv            3    .36621144    .36621144
  ridgecv            4    .21338105    .21338105
  lassocv            5   -.32773655   -.32773655
  ridgecv            6   -.05882845   -.05882845
       rf            7    .37049064    .37049064
       rf            8    .00204639    .00204639
       rf            9   -.16171679   -.16171679
gradboost           10    .20465153    .20465153
gradboost           11    .22440515    .22440515
     nnet           12    .06569283    .06569283
     nnet           13     .0064937     .0064937

short-stacked weights across resamples for lnearn
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0   -.02437103   -.02437103
      ols            2            0    .00556327    .00556327
  lassocv            3            0    -.2510507    -.2510507
  ridgecv            4            0    .78465385    .78465385
  lassocv            5            0   -.05293033   -.05293033
  ridgecv            6            0    .01133741    .01133741
       rf            7            0    .58336746    .58336746
       rf            8            0    .55051504    .55051504
       rf            9            0   -.83623896   -.83623896
gradboost           10            0    .14482703    .14482703
gradboost           11            0    .05581254    .05581254
     nnet           12            0   -.02542369   -.02542369
     nnet           13            0   -.00065889   -.00065889
      ols            1            1   -.04247659   -.04247659
      ols            2            1   -.02176899   -.02176899
  lassocv            3            1   -.39906545   -.39906545
  ridgecv            4            1    .49899834    .49899834
  lassocv            5            1    .51673077    .51673077
  ridgecv            6            1   -.11851707   -.11851707
       rf            7            1    .55845537    .55845537
       rf            8            1   -.11737261   -.11737261
       rf            9            1    .03722694    .03722694
gradboost           10            1    .09872124    .09872124
gradboost           11            1    .05432689    .05432689
     nnet           12            1    .00514638    .00514638
     nnet           13            1    .03052717    .03052717

D_gender_r_ss[13,3]
               learner  mean_weight        rep_1
    logit            1    .15309059    .15309059
    logit            2    .06034928    .06034928
  lassocv            3    .36621144    .36621144
  ridgecv            4    .21338105    .21338105
  lassocv            5   -.32773655   -.32773655
  ridgecv            6   -.05882845   -.05882845
       rf            7    .37049064    .37049064
       rf            8    .00204639    .00204639
       rf            9   -.16171679   -.16171679
gradboost           10    .20465153    .20465153
gradboost           11    .22440515    .22440515
     nnet           12    .06569283    .06569283
     nnet           13     .0064937     .0064937

      +----------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gende~2   D_gende~3 |
      |----------------------------------------------|
   1. |  .8614429          1    .1530906    .1530906 |
   2. | .41534564          2    .0603493    .0603493 |
   3. | .09671781          3    .3662114    .3662114 |
   4. | .18990058          4    .2133811    .2133811 |
   5. | .63950766          5   -.3277366   -.3277366 |
      |----------------------------------------------|
   6. | .95881973          6   -.0588284   -.0588284 |
   7. | .85071212          7    .3704906    .3704906 |
   8. | .79340386          8    .0020464    .0020464 |
      +----------------------------------------------+
(note: file out_53356/D_gender_r_ss_ols_short_ia.dta not found)
file out_53356/D_gender_r_ss_ols_short_ia.dta saved

pool-stacked weights across resamples for gender_r
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .23137586    .23137586
    logit            2    .08774029    .08774029
  lassocv            3    .26075764    .26075764
  ridgecv            4    .07489493    .07489493
  lassocv            5   -.12026303   -.12026303
  ridgecv            6    .02692521    .02692521
       rf            7    .43178192    .43178192
       rf            8    .07075657    .07075657
       rf            9    -.1815816    -.1815816
gradboost           10    .02418417    .02418417
gradboost           11    .16689232    .16689232
     nnet           12    .01336003    .01336003
     nnet           13    .01367442    .01367442

pool-stacked weights across resamples for lnearn
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .00974391    .00974391
      ols            2            0    -.0244604    -.0244604
  lassocv            3            0    -.0273416    -.0273416
  ridgecv            4            0    .51674439    .51674439
  lassocv            5            0    .01601216    .01601216
  ridgecv            6            0   -.06217973   -.06217973
       rf            7            0    .73971272    .73971272
       rf            8            0   -.25348835   -.25348835
       rf            9            0    .06418076    .06418076
gradboost           10            0    .05636699    .05636699
gradboost           11            0    .06095869    .06095869
     nnet           12            0   -.00800731   -.00800731
     nnet           13            0   -.01063925   -.01063925
      ols            1            1   -.01195032   -.01195032
      ols            2            1    8.663e-12    8.663e-12
  lassocv            3            1    .14612435    .14612435
  ridgecv            4            1     .3047285     .3047285
  lassocv            5            1    .07708184    .07708184
  ridgecv            6            1   -.06455894   -.06455894
       rf            7            1    .57888237    .57888237
       rf            8            1    .36555814    .36555814
       rf            9            1   -.26954559   -.26954559
gradboost           10            1   -.10619842   -.10619842
gradboost           11            1    .07121614    .07121614
     nnet           12            1    .01840773    .01840773
     nnet           13            1   -.00923778   -.00923778

pool-stacked weights across resamples for gender_r
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .23137586    .23137586
    logit            2    .08774029    .08774029
  lassocv            3    .26075764    .26075764
  ridgecv            4    .07489493    .07489493
  lassocv            5   -.12026303   -.12026303
  ridgecv            6    .02692521    .02692521
       rf            7    .43178192    .43178192
       rf            8    .07075657    .07075657
       rf            9    -.1815816    -.1815816
gradboost           10    .02418417    .02418417
gradboost           11    .16689232    .16689232
     nnet           12    .01336003    .01336003
     nnet           13    .01367442    .01367442

pool-stacked weights across resamples for lnearn
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .00974391    .00974391
      ols            2            0    -.0244604    -.0244604
  lassocv            3            0    -.0273416    -.0273416
  ridgecv            4            0    .51674439    .51674439
  lassocv            5            0    .01601216    .01601216
  ridgecv            6            0   -.06217973   -.06217973
       rf            7            0    .73971272    .73971272
       rf            8            0   -.25348835   -.25348835
       rf            9            0    .06418076    .06418076
gradboost           10            0    .05636699    .05636699
gradboost           11            0    .06095869    .06095869
     nnet           12            0   -.00800731   -.00800731
     nnet           13            0   -.01063925   -.01063925
      ols            1            1   -.01195032   -.01195032
      ols            2            1    8.663e-12    8.663e-12
  lassocv            3            1    .14612435    .14612435
  ridgecv            4            1     .3047285     .3047285
  lassocv            5            1    .07708184    .07708184
  ridgecv            6            1   -.06455894   -.06455894
       rf            7            1    .57888237    .57888237
       rf            8            1    .36555814    .36555814
       rf            9            1   -.26954559   -.26954559
gradboost           10            1   -.10619842   -.10619842
gradboost           11            1    .07121614    .07121614
     nnet           12            1    .01840773    .01840773
     nnet           13            1   -.00923778   -.00923778

Y_lnearn_ps[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .00974391    .00974391
      ols            2            0    -.0244604    -.0244604
  lassocv            3            0    -.0273416    -.0273416
  ridgecv            4            0    .51674439    .51674439
  lassocv            5            0    .01601216    .01601216
  ridgecv            6            0   -.06217973   -.06217973
       rf            7            0    .73971272    .73971272
       rf            8            0   -.25348835   -.25348835
       rf            9            0    .06418076    .06418076
gradboost           10            0    .05636699    .05636699
gradboost           11            0    .06095869    .06095869
     nnet           12            0   -.00800731   -.00800731
     nnet           13            0   -.01063925   -.01063925
      ols            1            1   -.01195032   -.01195032
      ols            2            1    8.663e-12    8.663e-12
  lassocv            3            1    .14612435    .14612435
  ridgecv            4            1     .3047285     .3047285
  lassocv            5            1    .07708184    .07708184
  ridgecv            6            1   -.06455894   -.06455894
       rf            7            1    .57888237    .57888237
       rf            8            1    .36555814    .36555814
       rf            9            1   -.26954559   -.26954559
gradboost           10            1   -.10619842   -.10619842
gradboost           11            1    .07121614    .07121614
     nnet           12            1    .01840773    .01840773
     nnet           13            1   -.00923778   -.00923778

      +---------------------------------------------------------------------+
      | Y_lne~1_1   Y_lne~0_1   Y_lne~s1   Y_lnea~2   Y_lnear~3   Y_lnear~4 |
      |---------------------------------------------------------------------|
   1. | 2.7954989   2.9313168          1          0    .0097439    .0097439 |
   2. | 3.2072511   3.5063617          2          0   -.0244604   -.0244604 |
   3. | 3.0305543   3.0819279          3          0   -.0273416   -.0273416 |
   4. | 2.7420192   2.7442112          4          0    .5167444    .5167444 |
   5. | 3.4605202   3.4160669          5          0    .0160122    .0160122 |
      |---------------------------------------------------------------------|
   6. | 2.8021338   2.9023557          6          0   -.0621797   -.0621797 |
   7. | 2.6246908   2.9143202          7          0    .7397127    .7397127 |
   8. | 2.9239385   2.9165138          8          0   -.2534884   -.2534884 |
      +---------------------------------------------------------------------+
(note: file out_53356/Y_lnearn_ps_ols_pooled_ia.dta not found)
file out_53356/Y_lnearn_ps_ols_pooled_ia.dta saved

pool-stacked weights across resamples for gender_r
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .23137586    .23137586
    logit            2    .08774029    .08774029
  lassocv            3    .26075764    .26075764
  ridgecv            4    .07489493    .07489493
  lassocv            5   -.12026303   -.12026303
  ridgecv            6    .02692521    .02692521
       rf            7    .43178192    .43178192
       rf            8    .07075657    .07075657
       rf            9    -.1815816    -.1815816
gradboost           10    .02418417    .02418417
gradboost           11    .16689232    .16689232
     nnet           12    .01336003    .01336003
     nnet           13    .01367442    .01367442

pool-stacked weights across resamples for lnearn
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .00974391    .00974391
      ols            2            0    -.0244604    -.0244604
  lassocv            3            0    -.0273416    -.0273416
  ridgecv            4            0    .51674439    .51674439
  lassocv            5            0    .01601216    .01601216
  ridgecv            6            0   -.06217973   -.06217973
       rf            7            0    .73971272    .73971272
       rf            8            0   -.25348835   -.25348835
       rf            9            0    .06418076    .06418076
gradboost           10            0    .05636699    .05636699
gradboost           11            0    .06095869    .06095869
     nnet           12            0   -.00800731   -.00800731
     nnet           13            0   -.01063925   -.01063925
      ols            1            1   -.01195032   -.01195032
      ols            2            1    8.663e-12    8.663e-12
  lassocv            3            1    .14612435    .14612435
  ridgecv            4            1     .3047285     .3047285
  lassocv            5            1    .07708184    .07708184
  ridgecv            6            1   -.06455894   -.06455894
       rf            7            1    .57888237    .57888237
       rf            8            1    .36555814    .36555814
       rf            9            1   -.26954559   -.26954559
gradboost           10            1   -.10619842   -.10619842
gradboost           11            1    .07121614    .07121614
     nnet           12            1    .01840773    .01840773
     nnet           13            1   -.00923778   -.00923778

D_gender_r_ps[13,3]
               learner  mean_weight        rep_1
    logit            1    .23137586    .23137586
    logit            2    .08774029    .08774029
  lassocv            3    .26075764    .26075764
  ridgecv            4    .07489493    .07489493
  lassocv            5   -.12026303   -.12026303
  ridgecv            6    .02692521    .02692521
       rf            7    .43178192    .43178192
       rf            8    .07075657    .07075657
       rf            9    -.1815816    -.1815816
gradboost           10    .02418417    .02418417
gradboost           11    .16689232    .16689232
     nnet           12    .01336003    .01336003
     nnet           13    .01367442    .01367442

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .84207615          1   .2313759   .2313759 |
   2. | .40589089          2   .0877403   .0877403 |
   3. | .09310415          3   .2607576   .2607576 |
   4. | .15929834          4   .0748949   .0748949 |
   5. | .61657004          5   -.120263   -.120263 |
      |--------------------------------------------|
   6. | .94975419          6   .0269252   .0269252 |
   7. | .88161241          7   .4317819   .4317819 |
   8. | .78994801          8   .0707566   .0707566 |
      +--------------------------------------------+
(note: file out_53356/D_gender_r_ps_ols_pooled_ia.dta not found)
file out_53356/D_gender_r_ps_ols_pooled_ia.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.101    (0.016)
  ss  1  [shortstack]          [ss]          [ss]    -0.101    (0.016)
  ps  1   [poolstack]          [ps]          [ps]    -0.101    (0.016)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1009511    .016419    -6.15   0.000    -.1331318   -.0687705
------------------------------------------------------------------------------
Stacking final estimator: avg



Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.101    (0.016)
  ss  1  [shortstack]          [ss]          [ss]    -0.101    (0.016)
  ps  1   [poolstack]          [ps]          [ps]    -0.101    (0.016)

Stacking DDML model (ATET)
E[y|X,D=0]   = Y1_pystacked0_1                     Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1
E[D|X]       = D1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1009511    .016419    -6.15   0.000    -.1331318   -.0687705
------------------------------------------------------------------------------
Stacking final estimator: avg

(note: variable final was str3, now str10 to accommodate using data's values)
file out_53356/results.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  ss  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.101    (0.016)
  ss  1  [shortstack]          [ss]          [ss]    -0.101    (0.016)
  ps  1   [poolstack]          [ps]          [ps]    -0.101    (0.016)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1009511    .016419    -6.15   0.000    -.1331318   -.0687705
------------------------------------------------------------------------------
Stacking final estimator: avg

(note: variable final was str3, now str10 to accommodate using data's values)
file out_53356/results.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  ps  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.101    (0.016)
  ss  1  [shortstack]          [ss]          [ss]    -0.101    (0.016)
  ps  1   [poolstack]          [ps]          [ps]    -0.101    (0.016)

Poolstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ps0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ps1
E[D|X]       = D_gender_r_ps_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1009511    .016419    -6.15   0.000    -.1331318   -.0687705
------------------------------------------------------------------------------
Stacking final estimator: avg

(note: variable final was str3, now str10 to accommodate using data's values)
file out_53356/results.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

Y1_pystacked_w_mn[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

      +-------------------------------------------+
      | Y1_pys~1   Y1_pys~2   Y1_pys~3   Y1_pys~4 |
      |-------------------------------------------|
   1. |        1          0   .0769231   .0769231 |
   2. |        2          0   .0769231   .0769231 |
   3. |        3          0   .0769231   .0769231 |
   4. |        4          0   .0769231   .0769231 |
   5. |        5          0   .0769231   .0769231 |
      |-------------------------------------------|
   6. |        6          0   .0769231   .0769231 |
   7. |        7          0   .0769231   .0769231 |
   8. |        8          0   .0769231   .0769231 |
      +-------------------------------------------+
(note: file out_53356/Y1_pystacked_w_mn_avg_regular_ia.dta not found)
file out_53356/Y1_pystacked_w_mn_avg_regular_ia.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

D1_pystacked_w_mn[13,3]
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

      +--------------------------------+
      | D1_pys~1   D1_pys~2   D1_pys~3 |
      |--------------------------------|
   1. |        1   .0769231   .0769231 |
   2. |        2   .0769231   .0769231 |
   3. |        3   .0769231   .0769231 |
   4. |        4   .0769231   .0769231 |
   5. |        5   .0769231   .0769231 |
      |--------------------------------|
   6. |        6   .0769231   .0769231 |
   7. |        7   .0769231   .0769231 |
   8. |        8   .0769231   .0769231 |
      +--------------------------------+
(note: file out_53356/D1_pystacked_w_mn_avg_regular_ia.dta not found)
file out_53356/D1_pystacked_w_mn_avg_regular_ia.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

short-stacked weights across resamples for lnearn
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

short-stacked weights across resamples for gender_r
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

short-stacked weights across resamples for lnearn
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

Y_lnearn_ss[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

      +-------------------------------------------------------------------+
      | Y_lne~1_1   Y_lne~0_1   Y_lne~s1   Y_lnea~2   Y_lnea~3   Y_lnea~4 |
      |-------------------------------------------------------------------|
   1. | 2.6036948   2.7844908          1          0   .0769231   .0769231 |
   2. | 3.0020864   3.1732028          2          0   .0769231   .0769231 |
   3. | 2.6562529   2.7845753          3          0   .0769231   .0769231 |
   4. | 2.4635309   2.6209908          4          0   .0769231   .0769231 |
   5. |  3.082586   3.1505737          5          0   .0769231   .0769231 |
      |-------------------------------------------------------------------|
   6. | 2.6121152   2.6244783          6          0   .0769231   .0769231 |
   7. | 2.4372831   2.5291591          7          0   .0769231   .0769231 |
   8. | 2.7508199    2.792096          8          0   .0769231   .0769231 |
      +-------------------------------------------------------------------+
(note: file out_53356/Y_lnearn_ss_avg_short_ia.dta not found)
file out_53356/Y_lnearn_ss_avg_short_ia.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

short-stacked weights across resamples for lnearn
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

D_gender_r_ss[13,3]
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .74280671          1   .0769231   .0769231 |
   2. | .40082337          2   .0769231   .0769231 |
   3. | .15854121          3   .0769231   .0769231 |
   4. | .27877502          4   .0769231   .0769231 |
   5. | .54869878          5   .0769231   .0769231 |
      |--------------------------------------------|
   6. | .80356713          6   .0769231   .0769231 |
   7. | .75354793          7   .0769231   .0769231 |
   8. | .67019517          8   .0769231   .0769231 |
      +--------------------------------------------+
(note: file out_53356/D_gender_r_ss_avg_short_ia.dta not found)
file out_53356/D_gender_r_ss_avg_short_ia.dta saved

pool-stacked weights across resamples for gender_r
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

pool-stacked weights across resamples for lnearn
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

pool-stacked weights across resamples for gender_r
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

pool-stacked weights across resamples for lnearn
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

Y_lnearn_ps[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

      +-------------------------------------------------------------------+
      | Y_lne~1_1   Y_lne~0_1   Y_lne~s1   Y_lnea~2   Y_lnea~3   Y_lnea~4 |
      |-------------------------------------------------------------------|
   1. | 2.6036948   2.7844908          1          0   .0769231   .0769231 |
   2. | 3.0020864   3.1732028          2          0   .0769231   .0769231 |
   3. | 2.6562529   2.7845753          3          0   .0769231   .0769231 |
   4. | 2.4635309   2.6209908          4          0   .0769231   .0769231 |
   5. |  3.082586   3.1505737          5          0   .0769231   .0769231 |
      |-------------------------------------------------------------------|
   6. | 2.6121152   2.6244783          6          0   .0769231   .0769231 |
   7. | 2.4372831   2.5291591          7          0   .0769231   .0769231 |
   8. | 2.7508199    2.792096          8          0   .0769231   .0769231 |
      +-------------------------------------------------------------------+
(note: file out_53356/Y_lnearn_ps_avg_pooled_ia.dta not found)
file out_53356/Y_lnearn_ps_avg_pooled_ia.dta saved

pool-stacked weights across resamples for gender_r
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

pool-stacked weights across resamples for lnearn
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

D_gender_r_ps[13,3]
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .74280671          1   .0769231   .0769231 |
   2. | .40082337          2   .0769231   .0769231 |
   3. | .15854121          3   .0769231   .0769231 |
   4. | .27877502          4   .0769231   .0769231 |
   5. | .54869878          5   .0769231   .0769231 |
      |--------------------------------------------|
   6. | .80356713          6   .0769231   .0769231 |
   7. | .75354793          7   .0769231   .0769231 |
   8. | .67019517          8   .0769231   .0769231 |
      +--------------------------------------------+
(note: file out_53356/D_gender_r_ps_avg_pooled_ia.dta not found)
file out_53356/D_gender_r_ps_avg_pooled_ia.dta saved
. 
.         forvalues i = 1(1)$L {
  2.                         ddml estimate, y1(Y1_pystacked1_L`i'_1) y0(Y1_pyst
> acked0_L`i'_1) ///
>                                                         d(D1_pystacked_L`i'_1
> ) robust atet foldvar(m0_sample_1  )
  3.                         regsave gender_r using `folder'/results.dta, ci //
> /
>                                                 addlabel(model,interactive,se
> ed,`seed',final,indiv,learner,`i') ///
>                                                 append
  4.         }

E[y|X,D=0]   = Y1_pystacked0_L1_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L1_1
E[D|X]       = D1_pystacked_L1_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1189001    .095763    -1.24   0.214    -.3065921     .068792
------------------------------------------------------------------------------
Warning: 135 propensity scores trimmed to lower limit ..
Warning: 36 propensity scores trimmed to upper limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_53356/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L2_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L2_1
E[D|X]       = D1_pystacked_L2_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1159509    .016132    -7.19   0.000    -.1475691   -.0843327
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_53356/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L3_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L3_1
E[D|X]       = D1_pystacked_L3_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0400344   .0453899    -0.88   0.378     -.128997    .0489283
------------------------------------------------------------------------------
Warning: 91 propensity scores trimmed to lower limit ..
Warning: 20 propensity scores trimmed to upper limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_53356/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L4_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L4_1
E[D|X]       = D1_pystacked_L4_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0093947   .0903496    -0.10   0.917    -.1864766    .1676873
------------------------------------------------------------------------------
Warning: 94 propensity scores trimmed to lower limit ..
Warning: 29 propensity scores trimmed to upper limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_53356/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L5_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L5_1
E[D|X]       = D1_pystacked_L5_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0525722   .0472675    -1.11   0.266    -.1452148    .0400704
------------------------------------------------------------------------------
Warning: 86 propensity scores trimmed to lower limit ..
Warning: 11 propensity scores trimmed to upper limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_53356/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L6_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L6_1
E[D|X]       = D1_pystacked_L6_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0281418    .091163    -0.31   0.758    -.2068181    .1505344
------------------------------------------------------------------------------
Warning: 80 propensity scores trimmed to lower limit ..
Warning: 22 propensity scores trimmed to upper limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_53356/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L7_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L7_1
E[D|X]       = D1_pystacked_L7_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0791065    .021954    -3.60   0.000    -.1221356   -.0360775
------------------------------------------------------------------------------
Warning: 2 propensity scores trimmed to lower limit ..
Warning: 2 propensity scores trimmed to upper limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_53356/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L8_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L8_1
E[D|X]       = D1_pystacked_L8_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1035652    .015526    -6.67   0.000    -.1339956   -.0731349
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_53356/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L9_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L9_1
E[D|X]       = D1_pystacked_L9_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1077737   .0149013    -7.23   0.000    -.1369798   -.0785676
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_53356/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L10_1                 Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L10_1
E[D|X]       = D1_pystacked_L10_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0723683   .0192666    -3.76   0.000    -.1101302   -.0346065
------------------------------------------------------------------------------
Warning: 1 propensity scores trimmed to lower limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_53356/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L11_1                 Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L11_1
E[D|X]       = D1_pystacked_L11_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0581102    .036237    -1.60   0.109    -.1291334     .012913
------------------------------------------------------------------------------
Warning: 93 propensity scores trimmed to lower limit ..
Warning: 19 propensity scores trimmed to upper limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_53356/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L12_1                 Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L12_1
E[D|X]       = D1_pystacked_L12_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1340519   .0164939    -8.13   0.000    -.1663794   -.1017245
------------------------------------------------------------------------------
Warning: 14 propensity scores trimmed to lower limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_53356/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L13_1                 Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L13_1
E[D|X]       = D1_pystacked_L13_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.3911444   .2200559    -1.78   0.075     -.822446    .0401573
------------------------------------------------------------------------------
Warning: 142 propensity scores trimmed to lower limit ..
Warning: 141 propensity scores trimmed to upper limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_53356/results.dta saved
. 
. }       

.         
. *****************************************************************************
> *  
. *** interactive NX: short-stacking                                           
>                                       ***
. *****************************************************************************
> *
. 
. if (`estimator'==3) {
. 
. gen one = 1     
. 
.         cap drop y0base*
.         cap drop dbase*
.         cap drop y1base*
. 
.         *** no cross-fitting
.         pystacked lnearn $X_expanded   $pystring_reg0  if gender_r == 0, type
> (reg) njobs($cores)  
.                 mat nxw_ia_y0 = e(weights)
.                 mat list nxw_ia_y0
.                                 preserve
.                                 svmat nxw_ia_y0
.                                 keep nxw_ia_y0*
.                                 save `folder'/nxw_ia_y0, replace
.                                 restore
.         predict y0base0, xb
.         predict y0base, base
. 
.         pystacked lnearn $X_expanded  $pystring_reg0 if gender_r == 1  , type
> (reg) njobs($cores)  
.                 mat nxw_ia_y1 = e(weights)
.                 mat list nxw_ia_y1
.                                 preserve
.                                 svmat nxw_ia_y1
.                                 keep nxw_ia_y1*
.                                 save `folder'/nxw_ia_y1, replace
.                                 restore
.         predict y1base0, xb
.         predict y1base, base
. 
.         pystacked gender_r $X_expanded $pystring_class  
.                 mat nxw_ia_d = e(weights)
.                 mat list nxw_ia_d
.                                 preserve
.                                 svmat nxw_ia_d
.                                 keep nxw_ia_d*
.                                 save `folder'/nxw_ia_d, replace
.                                 restore         
.         predict dbase0, pr
.         predict dbase, base pr
.         
.         forvalues i = 0(1)$L {
  2.                         _estimate_ate interactive, yname(lnearn) dname(gen
> der_r) ///
>                                                 y0(y0base`i') y1(y1base`i') d
> (dbase`i') ///
>                                                 atet foldid(one) robust model
> (interactive)
  3.                         regsave gender_r using `folder'/results.dta, ///
>                                                 ci addlabel(model,nxinter,see
> d,`seed',final,nx,learner,`i') append
  4.         }
.                 
. }

.         
. *****************************************************************************
> *  
. *** partial NX: short-stacking                                               
>                                       ***
. *****************************************************************************
> *
. 
. if (`estimator'==4) {
.         
. cap gen one = 1 
. 
.         cap drop Ybase* 
.         cap drop Dbase*
. 
.         *** no cross-fitting
.         pystacked lnearn $X_expanded $pystring_reg 
.                 mat nxw_y = e(weights)
.                 mat list nxw_y
.                                 preserve
.                                 svmat nxw_y
.                                 keep nxw_y*
.                                 save `folder'/nxw_y, replace
.                                 restore
.         predict Ybase0
.         predict Ybase, basexb
. 
.         pystacked gender_r $X_expanded $pystring_reg 
.                 mat nxw_d = e(weights)
.                 mat list nxw_d
.                                 preserve
.                                 svmat nxw_d
.                                 keep nxw_d*
.                                 save `folder'/nxw_d, replace
.                                 restore         
.         predict Dbase0
.         predict Dbase, basexb
. 
.         forvalues i = 0(1)$L {
  2.                 cap drop Ytil
  3.                 cap drop Dtil
  4.                 gen Ytil = lnearn - Ybase`i'
  5.                 gen Dtil = gender_r - Dbase`i'
  6.                 reg Ytil Dtil, robust
  7.                 regsave Dtil using `folder'/results.dta, ///
>                         ci addlabel(model,nxpartial,seed,`seed',final,nx,lear
> ner,`i') append
  8.         }
. 
. }

.         
. cap log close
