-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /cluster/home/kahrens/ddml_applied/GWG/Output/GWG_36931_2.txt
  log type:  text
 opened on:  10 Dec 2023, 19:14:52

. 
. which ddml
/cluster/home/kahrens/ado/plus/d/ddml.ado
*! ddml v1.4.3
*! last edited: 17aug2023
*! authors: aa/ms

. which pystacked
/cluster/home/kahrens/ado/plus/p/pystacked.ado
*! pystacked v0.7.5
*! last edited: 7aug2023
*! authors: aa/ms

. 
. set seed `seed'

. local folder out_`seed'

. 
. use "../Data/gender_gap_ML_processed", clear

. 
. cap mkdir `folder'

. 
. *****************************************************************************
> ***
. ***  controls
. *****************************************************************************
> ***
. 
. // create squared age and tenure here
. gen age_r2 = age_r^2

. gen tenure2 = tenure^2
(2 missing values generated)

. 
. // no base categories
. global continuous                                                            
>                                                            ///
>         age_r                                                                
>                                                                    /// no mis
> sing
>         yrsqual         /* years of education (derived) */                   
>                                    /// 355 missing
>         /// leavedu             /* age when left education (derived) */      
>                            /// 1,081 missing
>         pvlit1          /* literacy score: plausible value 1 (also 2-10 avail
> ) */       /// no missing
>         pvnum1          /* numeracy score: plausible value 1 (also 2-10 avail
> ) */       /// no missing
>         tenure          /* tenure = years in work for current employer */    
>                    /// 2 missing
>                                                                              
>                                                                            //

. // add second order terms here
. global continuous $continuous age_r2 tenure2

. 
. global discrete0                                                             
>                                                            ///             
>         b_q01a          /* education, highest level attained */              
>                            /// no missing
>         b_q01b          /* area of study */                                  
>                                                    /// 434 missing
>         d_q06c          /* part of a larger organization */                  
>                                    /// 13 missing
>         d_q08a          /* management position */                            
>                                            /// no missing
>         d_q09           /* type of contract */                               
>                                            /// 12 missing
>         d_q10_t1        /* hours per week at this job or business */         
>                    /// 1 missing
>         d_q14           /* job satisfaction */                               
>                                            /// 1 missing
>         i_q08           /* health status */                                  
>                                                    /// 2 missing
>         j_q02a          /* living with a partner */                          
>                                            /// 899 missing
>         j_q03d1_c       /* age of youngest child */                          
>                                            /// 2,718 missing
>         j_q04c1_c       /* immigration: age */                               
>                                            /// 4,375 missing
>         j_q06b          /* mother's highest level of educ */                 
>                            /// 445 missing
>         j_q07b          /* father's highest level of educ */                 
>                            /// 515 missing
>         j_q03b          /* number of children*/                              
>                                            /// 1,856 missing
>         impar           /* immigration: parents */                           
>                                            /// 21 missing
>         imgen           /* immigration: generation */                        
>                                    /// 344 missing
>         nfe12jr         /* informal job-related educ in prev 12 months */    
>                    /// 116 missing
>         nfe12njr        /* informal non-job-related educ in prev 12 months */
>            /// 116 missing
>                                                                              
>                                                                            //
>                                                                              
>                                                          

. global personality                                                           
>                                                            ///
>         i_q04b          /* Learning strategies, Relate new ideas into real li
> fe */      /// 16 missing
>         i_q04d          /* Learning strategies, Like learning new things */  
>                    /// no missing
>         i_q04h          /* Learning strategies, Attribute something new */   
>                    /// 10 missing
>         i_q04j          /* Learning strategies, Deal with difficult things */
>            /// no missing
>         i_q04l          /* Learning strategies, Fit different ideas together 
> */         /// 5 missing
>         i_q04m          /* Learning strategies, Looking for additional info *
> /          /// 1 missing
>         i_q05f          /* Cultural engagement, Voluntary non-profit work */ 
>            /// no missing
>         i_q06a          /* Political efficacy, No influence on the government
>  */        /// 14 missing
>         i_q07a          /* Social trust, Trust only few people */            
>                            /// 4 missing
>         i_q07b          /* Social trust, Other people take advantage of you *
> /          /// 6 missing
>                                                                              
>                                                                            //

. global discrete $discrete0                                                   
>                                                    ///
>         new_reg_tl2     /* geographical region */                            
>                                            /// 2 missing
>         new_isco1c      /* occupation */                                     
>                                                    /// no missing
>         new_isic1c      /* industry */                                       
>                                                    // no missing

. 
. global X_simple                                                         ///
>         i.(b_q01a d_q10_t1 j_q03b)                              ///
>         c.($continuous)

. 
. global X_fullinteracted                                         ///
>         i.($discrete0 )                                                 ///
>         i.new_isco1c#i.new_isic1c#i.new_reg_tl2 ///
>         c.($continuous)                  

.         
. global X_cont                                                           ///
>         c.($continuous)##i.($discrete)

. 
. global X_expanded                                                       ///
>         i.($discrete)                                                   ///
>         c.($continuous)                                                 ///
>         c.age_r#i.($discrete)                                   ///
>         c.tenure#i.($discrete)

. 
.         
. 
. *****************************************************************************
> ***
. ***  estimation sample
. *****************************************************************************
> ***
. 
. gen byte touse=1

. markout touse lnearn $X_expanded

. keep if touse
(53 observations deleted)

. 
. 
. *****************************************************************************
> ***
. ***  learners
. *****************************************************************************
> ***
. 
. global cores = 5

. 
. global rf1 min_samples_leaf(1)  max_features(sqrt) n_estimators(500)

. global rf2 min_samples_leaf(50)  max_features(sqrt) n_estimators(500)

. global rf3 min_samples_leaf(100)  max_features(sqrt) n_estimators(500)

. global grad1 n_estimators(500) n_iter_no_change(10)  

. global grad2 n_estimators(500)  

. global nnet1 hidden_layer_sizes(40 20 1 20 50) early_stopping 

. global nnet2 hidden_layer_sizes(30 30 30) early_stopping  

. 
. global pystring_reg0                                                         
>    || ///
>                                         m(ols)                               
>                            || ///
>                                         m(ols) xvars($X_simple)              
>            || ///
>                                         m(lassocv)                           
>                            || ///
>                                         m(ridgecv)                           
>                            || ///
>                                         m(lassocv)      xvars($X_cont)       
>            || ///
>                                         m(ridgecv)      xvars($X_cont)       
>            || ///
>                                         m(rf) opt($rf1)                      
>                    || ///
>                                         m(rf) opt($rf2)                      
>                    || ///
>                                         m(rf) opt($rf3)                      
>                    || ///
>                                         m(gradboost) opt($grad1)             
>            || ///
>                                         m(gradboost) opt($grad2)             
>            || ///
>                                         m(nnet) opt($nnet1)                  
>            || ///
>                                         m(nnet) opt($nnet2)                  
>            || //

. 
. global pystring_reg  $pystring_reg0 , type(reg) njobs($cores) 

.  
. global pystring_class0                                                       
>            || ///
>                                         m(logit)                             
>                            || ///
>                                         m(logit) xvars($X_simple)            
>            || ///
>                                         m(lassocv)                           
>                            || ///
>                                         m(ridgecv)                           
>                            || ///
>                                         m(lassocv)      xvars($X_cont)       
>            || ///
>                                         m(ridgecv)      xvars($X_cont)       
>            || ///
>                                         m(rf) opt($rf1)                      
>                    || ///
>                                         m(rf) opt($rf2)                      
>                    || ///
>                                         m(rf) opt($rf3)                      
>                    || ///
>                                         m(gradboost) opt($grad1)             
>            || ///
>                                         m(gradboost) opt($grad2)             
>            || ///
>                                         m(nnet) opt($nnet1)                  
>            || ///
>                                         m(nnet) opt($nnet2)                  
>            || //                   

.                                 
. global pystring_class $pystring_class0 , type(class) njobs($cores)

.                                         
. global R =1  

. global K=10 

. global L =13

.         
. *****************************************************************************
> *  
. *** ddml: estimation                                                         
>                                               ***
. *****************************************************************************
> *
. 
. if (`estimator'==1) {
. 
.         ddml init partial,  reps($R) kfolds($K)
.         ddml E[Y|X]: pystacked lnearn $X_expanded $pystring_reg
.         ddml E[D|X]: pystacked gender_r $X_expanded $pystring_reg
.         ddml crossfit, shortstack poolstack
.         ddml estimate, robust
.         
.         foreach mat in lnearn_mse gender_r_mse {
  2.                         ddml extract, show(mse)
  3.                         mat `mat' = r(`mat')
  4.                         mat list `mat'
  5.                                 preserve
  6.                                 svmat `mat'
  7.                                 keep `mat'*
  8.                                 keep if _n<=$L
  9.                                 gen stack_type = "conventional" if _n==1
 10.                                 replace stack_type = "pooled" if _n==2
 11.                                 replace stack_type = "short" if _n==3
 12.                                 gen model = "plm"
 13.                                 list if _n<=$L
 14.                                 save `folder'/`mat'_plm_mse, replace
 15.                                 restore 
 16.         }       
. 
.         cap drop mse_*
.         foreach var of varlist Y1_* {
  2.                  cap drop sqerr_`var'
  3.                  gen double sqerr_`var'=(lnearn-`var')^2
  4.                  sum sqerr_`var', meanonly
  5.                  gen double mse_`var'=r(mean) if _n ==1 
  6.         }
.         foreach var of varlist D1_* {
  2.                  cap drop sqerr_`var'
  3.                  gen double sqerr_`var'=(gender_r-`var')^2
  4.                  sum sqerr_`var', meanonly
  5.                  gen double mse_`var'=r(mean) if _n ==1 
  6.         }
.         preserve
.                 keep mse_*
.                 keep if _n==1
.                 save `folder'/plm_mse, replace
.         restore
.         cap drop mse_*
. 
.         ** initialize results file
.         regsave gender_r using `folder'/results.dta, ci addlabel(model,partia
> l,seed,`seed',final,init,learner,-99) replace
. 
.         foreach final in nnls1 singlebest ols avg {
  2. 
.                 ddml estimate, robust finalest(`final')
  3.         
.                         // regular stacking results
.                         ddml estimate, mname(m0) spec(st) replay  
  4.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,partial,seed,`seed',final,`final',learner,-1) append
  5.                         
.                         // shortstacking results
.                         ddml estimate, mname(m0) spec(ss) replay 
  6.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,partial,seed,`seed',final,`final',learner,-2) append
  7.                         
.                         // poolstacking results
.                         ddml estimate, mname(m0) spec(ps) replay  
  8.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,partial,seed,`seed',final,`final',learner,-3) append     
  9.                 
.                         // pystacked weights
.                         ddml extract, show(stweights)   
 10.                         foreach mat in Y1_pystacked_w_mn D1_pystacked_w_mn
>  {
 11.                                         ddml extract, show(stweights)   
 12.                                         mat `mat' = r(`mat')
 13.                                         mat list `mat'
 14.                                                 preserve
 15.                                                 svmat `mat'
 16.                                                 keep `mat'*
 17.                                                 list if _n<=4
 18.                                                 save `folder'/`mat'_`final
> '_regular, replace
 19.                                                 restore
 20.                         }       
 21.                         // shortstacked weights
.                         ddml extract, show(ssweights)
 22.                         foreach mat in Y_lnearn_ss D_gender_r_ss {
 23.                                         qui ddml extract, show(ssweights)
 24.                                         mat `mat' = r(`mat')
 25.                                         mat list `mat'
 26.                                                 preserve
 27.                                                 svmat `mat'
 28.                                                 keep `mat'*
 29.                                                 list if _n<=4
 30.                                                 save `folder'/`mat'_`final
> '_short, replace
 31.                                                 restore
 32.                         }       
 33.                         // poolstacked weights
. 
.                         foreach mat in Y_lnearn_ps D_gender_r_ps {
 34.                                         qui ddml extract, show(psweights)
 35.                                         mat `mat' = r(`mat')
 36.                                         mat list `mat'
 37.                                                 preserve
 38.                                                 svmat `mat'
 39.                                                 keep `mat'*
 40.                                                 list if _n<=4
 41.                                                 save `folder'/`mat'_`final
> '_pooled, replace
 42.                                                 restore
 43.                         }       
 44.         
.         }
. 
.         forvalues i = 1(1)$L {
  2.                         ddml estimate, y(Y1_pystacked_L`i'_1) ///
>                                                         d(D1_pystacked_L`i'_1
> ) robust
  3.                         regsave gender_r using `folder'/results.dta, ci //
> /
>                                                 addlabel(model,partial,seed,`
> seed',final,indiv,learner,`i') ///
>                                                 append
  4.         }
. 
. }

.         
. *****************************************************************************
> *  
. *** interactive: estimation                                                  
>                                       ***
. *****************************************************************************
> *
.         
. if (`estimator'==2) {   
. 
.         ddml init interactive, kfolds($K) reps($R)
.         ddml E[Y|X,D]: pystacked lnearn $X_expanded $pystring_reg
Learner Y1_pystacked added successfully.
.         ddml E[D|X]: pystacked gender_r $X_expanded $pystring_class
Learner D1_pystacked added successfully.
.         ddml crossfit, shortstack poolstack
Cross-fitting E[y|X,D] equation: lnearn
Cross-fitting fold 1 2 3 4 5 6 7 8 9 10 ...completed cross-fitting...completed 
> short-stacking...completed pooled-stacking
Cross-fitting E[D|X] equation: gender_r
Cross-fitting fold 1 2 3 4 5 6 7 8 9 10 ...completed cross-fitting...completed 
> short-stacking...completed pooled-stacking
.         ddml estimate, robust atet


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.083    (0.020)
  ss  1  [shortstack]          [ss]          [ss]    -0.082    (0.021)
  ps  1   [poolstack]          [ps]          [ps]    -0.082    (0.020)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0816578   .0211302    -3.86   0.000    -.1230722   -.0402434
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 6 propensity scores trimmed to lower limit .01.

. 
.         cap drop mse_*
.         foreach var of varlist Y1_pystacked0* {
  2.                  cap drop sqerr_`var'
  3.                  gen double sqerr_`var'=(lnearn-`var')^2 if gender_r==0
  4.                  sum sqerr_`var' if gender_r==0, meanonly
  5.                  gen double mse_`var'=r(mean) if _n ==1 
  6.         }
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
.         foreach var of varlist Y1_pystacked1* {
  2.                  cap drop sqerr_`var'
  3.                  gen double sqerr_`var'=(lnearn-`var')^2 if gender_r==1
  4.                  sum sqerr_`var' if gender_r==1, meanonly
  5.                  gen double mse_`var'=r(mean) if _n ==1 
  6.         }
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
.         foreach var of varlist D1_* {
  2.                  cap drop sqerr_`var'
  3.                  gen double sqerr_`var'=(gender_r-`var')^2
  4.                  sum sqerr_`var', meanonly
  5.                  gen double mse_`var'=r(mean) if _n ==1 
  6.         }
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
.         preserve
.                 keep mse_*
.                 keep if _n==1
(4,835 observations deleted)
.                 save `folder'/inter_mse, replace
(note: file out_36931/inter_mse.dta not found)
file out_36931/inter_mse.dta saved
.         restore
.         cap drop mse_*
.         
.         local mat gender_r_mse
.                         ddml extract, show(mse)

MSEs for gender_r:
                 rep   full smp      fold 1      fold 2      fold 3      fold 4
>       fold 5      fold 6      fold 7      fold 8      fold 9     fold 10 
    D1_pystacked   1      0.156       0.150       0.164       0.159       0.159
>        0.150       0.153       0.146       0.159       0.172       0.147  
   D_gender_r_ps   1      0.155       0.149       0.164       0.158       0.159
>        0.150       0.153       0.145       0.159       0.171       0.146  
   D_gender_r_ss   1      0.155       0.148       0.163       0.157       0.160
>        0.150       0.153       0.145       0.158       0.170       0.147  

MSEs for lnearn:
                D=  rep   full smp      fold 1      fold 2      fold 3      fol
> d 4      fold 5      fold 6      fold 7      fold 8      fold 9     fold 10 
    Y1_pystacked 0    1      0.228       0.259       0.127       0.149       0.
> 209       0.207       0.213       0.213       0.229       0.529       0.181  
    Y1_pystacked 1    1      0.173       0.251       0.143       0.133       0.
> 129       0.117       0.224       0.159       0.265       0.166       0.140  
     Y_lnearn_ps 0    1      8.295       8.389       8.192       8.221       8.
> 438       8.379       8.140       8.177       8.218       8.415       8.380  
     Y_lnearn_ps 1    1      7.488       7.616       7.350       7.459       7.
> 434       7.609       7.501       7.473       7.433       7.740       7.251  
     Y_lnearn_ss 0    1      0.226       0.258       0.127       0.149       0.
> 203       0.203       0.212       0.211       0.228       0.518       0.181  
     Y_lnearn_ss 1    1      0.173       0.250       0.144       0.133       0.
> 131       0.118       0.225       0.157       0.263       0.166       0.140  
.                         mat `mat' = r(`mat')
.                         mat list `mat'

gender_r_mse[3,12]
                      rep  full_sample        fold1        fold2        fold3
D1_pystacked            1    .15586966    .15009365    .16382631    .15895295
D_gender_r~s            1     .1552985    .14907344    .16365312    .15815815
D_gender_r~s            1    .15511294    .14828962    .16258859    .15732023

                    fold4        fold5        fold6        fold7        fold8
D1_pystacked    .15935647     .1502615    .15285671    .14569902    .15860847
D_gender_r~s    .15877791    .14995798    .15283397    .14462919    .15858194
D_gender_r~s    .16021958    .15006335    .15275954    .14480355    .15834907

                    fold9       fold10
D1_pystacked     .1720569    .14697847
D_gender_r~s    .17093875    .14637532
D_gender_r~s    .17008645     .1466417
.                                 preserve
.                                 svmat `mat'
.                                 keep `mat'*
.                                 keep if _n<=$L
(4,823 observations deleted)
.                                 gen stack_type = "conventional" if _n==1
(12 missing values generated)
.                                 replace stack_type = "pooled" if _n==2
(1 real change made)
.                                 replace stack_type = "short" if _n==3
(1 real change made)
.                                 gen model = "interactive"
.                                 list if _n<=$L

     +-----------------------------------------------------------------+
  1. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        1 | .1558697 | .1500937 | .1638263 |  .158953 | .1593565 |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     | .1502615 | .1528567 |  .145699 | .1586085 | .1720569 | .1469785 |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |          conventional          |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  2. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        1 | .1552985 | .1490734 | .1636531 | .1581582 | .1587779 |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |  .149958 |  .152834 | .1446292 | .1585819 | .1709388 | .1463753 |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                pooled          |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  3. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        1 | .1551129 | .1482896 | .1625886 | .1573202 | .1602196 |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     | .1500634 | .1527595 | .1448035 | .1583491 | .1700865 | .1466417 |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                 short          |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  4. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  5. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  6. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  7. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  8. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  9. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 10. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 11. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 12. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 13. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+
.                                 save `folder'/`mat'_inter_gender_mse, replace
(note: file out_36931/gender_r_mse_inter_gender_mse.dta not found)
file out_36931/gender_r_mse_inter_gender_mse.dta saved
.                                 restore 
.                                 
.         local mat lnearn_mse
.                         ddml extract, show(mse)

MSEs for gender_r:
                 rep   full smp      fold 1      fold 2      fold 3      fold 4
>       fold 5      fold 6      fold 7      fold 8      fold 9     fold 10 
    D1_pystacked   1      0.156       0.150       0.164       0.159       0.159
>        0.150       0.153       0.146       0.159       0.172       0.147  
   D_gender_r_ps   1      0.155       0.149       0.164       0.158       0.159
>        0.150       0.153       0.145       0.159       0.171       0.146  
   D_gender_r_ss   1      0.155       0.148       0.163       0.157       0.160
>        0.150       0.153       0.145       0.158       0.170       0.147  

MSEs for lnearn:
                D=  rep   full smp      fold 1      fold 2      fold 3      fol
> d 4      fold 5      fold 6      fold 7      fold 8      fold 9     fold 10 
    Y1_pystacked 0    1      0.228       0.259       0.127       0.149       0.
> 209       0.207       0.213       0.213       0.229       0.529       0.181  
    Y1_pystacked 1    1      0.173       0.251       0.143       0.133       0.
> 129       0.117       0.224       0.159       0.265       0.166       0.140  
     Y_lnearn_ps 0    1      8.295       8.389       8.192       8.221       8.
> 438       8.379       8.140       8.177       8.218       8.415       8.380  
     Y_lnearn_ps 1    1      7.488       7.616       7.350       7.459       7.
> 434       7.609       7.501       7.473       7.433       7.740       7.251  
     Y_lnearn_ss 0    1      0.226       0.258       0.127       0.149       0.
> 203       0.203       0.212       0.211       0.228       0.518       0.181  
     Y_lnearn_ss 1    1      0.173       0.250       0.144       0.133       0.
> 131       0.118       0.225       0.157       0.263       0.166       0.140  
.                         mat `mat' = r(`mat')
.                         mat list `mat'

lnearn_mse[6,13]
                    D=0/1          rep  full_sample        fold1        fold2
Y1_pystacked            0            1    .22833546    .25941097    .12672383
Y1_pystacked            1            1    .17281184    .25117267    .14319661
 Y_lnearn_ps            0            1    8.2950715     8.389068    8.1918421
 Y_lnearn_ps            1            1    7.4884987    7.6161909    7.3500012
 Y_lnearn_ss            0            1    .22581501    .25842895    .12722095
 Y_lnearn_ss            1            1    .17287586    .24960841    .14364642

                    fold3        fold4        fold5        fold6        fold7
Y1_pystacked    .14896208    .20928344    .20692221    .21254047    .21320282
Y1_pystacked     .1331836    .12854516     .1170498    .22368578    .15872918
 Y_lnearn_ps    8.2211988    8.4384564    8.3792719    8.1404903    8.1766001
 Y_lnearn_ps    7.4593253    7.4341424    7.6091272    7.5009601    7.4728487
 Y_lnearn_ss    .14852349    .20346232    .20314005    .21193848    .21142789
 Y_lnearn_ss    .13331451    .13127831    .11810604     .2246163    .15686328

                    fold8        fold9       fold10
Y1_pystacked    .22948509    .52936009    .18141882
Y1_pystacked    .26459358     .1658958    .14005173
 Y_lnearn_ps    8.2184267    8.4148677    8.3803018
 Y_lnearn_ps    7.4328579    7.7400952    7.2511536
 Y_lnearn_ss    .22780162    .51799557    .18144104
 Y_lnearn_ss    .26317152    .16627682    .13988781
.                                 preserve
.                                 svmat `mat'
.                                 keep `mat'*
.                                 keep if _n<=(2*$L)
(4,810 observations deleted)
.                                 gen stack_type = "conventional" if _n<=2
(24 missing values generated)
.                                 replace stack_type = "pooled" if _n>=3 & _n<=
> 4
(2 real changes made)
.                                 replace stack_type = "short" if _n>4
(22 real changes made)
.                                 gen model = "interactive"
.                                 list if _n<=(2*$L)

     +-----------------------------------------------------------------+
  1. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        0 |        1 | .2283355 |  .259411 | .1267238 | .1489621 |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     | .2092834 | .2069222 | .2125405 | .2132028 | .2294851 | .5293601 |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |     .1814188     |     conventional      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  2. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        1 |        1 | .1728119 | .2511727 | .1431966 | .1331836 |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     | .1285452 | .1170498 | .2236858 | .1587292 | .2645936 | .1658958 |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |     .1400517     |     conventional      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  3. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        0 |        1 | 8.295072 | 8.389068 | 8.191842 | 8.221199 |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     | 8.438457 | 8.379272 | 8.140491 |   8.1766 | 8.218427 | 8.414867 |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |     8.380301     |           pooled      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  4. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        1 |        1 | 7.488499 | 7.616191 | 7.350001 | 7.459325 |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     | 7.434143 | 7.609127 |  7.50096 | 7.472849 | 7.432858 | 7.740095 |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |     7.251153     |           pooled      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  5. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        0 |        1 |  .225815 |  .258429 | .1272209 | .1485235 |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     | .2034623 | .2031401 | .2119385 | .2114279 | .2278016 | .5179956 |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |      .181441     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  6. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        1 |        1 | .1728759 | .2496084 | .1436464 | .1333145 |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     | .1312783 |  .118106 | .2246163 | .1568633 | .2631715 | .1662768 |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |     .1398878     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  7. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  8. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  9. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 10. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 11. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 12. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 13. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 14. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 15. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 16. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 17. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 18. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 19. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 20. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 21. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 22. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 23. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 24. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 25. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 26. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+
.                                 save `folder'/`mat'_inter_lnearn_mse, replace
(note: file out_36931/lnearn_mse_inter_lnearn_mse.dta not found)
file out_36931/lnearn_mse_inter_lnearn_mse.dta saved
.                                 restore 
.         
.         foreach final in nnls1 singlebest ols avg {
  2. 
.                 ddml estimate, robust finalest(`final') atet
  3.         
.                         // regular stacking results
.                         ddml estimate, mname(m0) spec(st) replay atet
  4.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,interactive,seed,`seed',final,`final',learner,-1) append
  5.                         
.                         // shortstacking results
.                         ddml estimate, mname(m0) spec(ss) replay atet
  6.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,interactive,seed,`seed',final,`final',learner,-2) append
  7.                         
.                         // poolstacking results
.                         ddml estimate, mname(m0) spec(ps) replay atet
  8.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,interactive,seed,`seed',final,`final',learner,-3) append
  9.                 
.                         // pystacked weights
.                         ddml extract, show(stweights)
 10.                         foreach mat in Y1_pystacked_w_mn D1_pystacked_w_mn
>  {
 11.                                         ddml extract, show(stweights)
 12.                                         mat `mat' = r(`mat')
 13.                                         mat list `mat'
 14.                                                 preserve
 15.                                                 svmat `mat'
 16.                                                 keep `mat'*
 17.                                                 list if _n<=8
 18.                                                 save `folder'/`mat'_`final
> '_regular_ia, replace
 19.                                                 restore
 20.                         }       
 21.                         // shortstacked weights
.                         ddml extract, show(ssweights)
 22.                         foreach mat in Y_lnearn_ss D_gender_r_ss {
 23.                                         ddml extract, show(ssweights)
 24.                                         mat `mat' = r(`mat')
 25.                                         mat list `mat'
 26.                                                 preserve
 27.                                                 svmat `mat'
 28.                                                 keep `mat'*
 29.                                                 list if _n<=8
 30.                                                 save `folder'/`mat'_`final
> '_short_ia, replace
 31.                                                 restore
 32.                         }       
 33.                         // poolstacked weights
.                         ddml extract, show(psweights)
 34.                         foreach mat in Y_lnearn_ps D_gender_r_ps {
 35.                                         ddml extract, show(psweights)
 36.                                         mat `mat' = r(`mat')
 37.                                         mat list `mat'
 38.                                                 preserve
 39.                                                 svmat `mat'
 40.                                                 keep `mat'*
 41.                                                 list if _n<=8
 42.                                                 save `folder'/`mat'_`final
> '_pooled_ia, replace
 43.                                                 restore
 44.                         }       
 45.         
.         }


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.083    (0.020)
  ss  1  [shortstack]          [ss]          [ss]    -0.082    (0.021)
  ps  1   [poolstack]          [ps]          [ps]    -0.082    (0.020)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0816578   .0211302    -3.86   0.000    -.1230722   -.0402434
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 6 propensity scores trimmed to lower limit .01.



Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.083    (0.020)
  ss  1  [shortstack]          [ss]          [ss]    -0.082    (0.021)
  ps  1   [poolstack]          [ps]          [ps]    -0.082    (0.020)

Stacking DDML model (ATET)
E[y|X,D=0]   = Y1_pystacked0_1                     Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1
E[D|X]       = D1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0831335   .0198362    -4.19   0.000    -.1220117   -.0442552
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 5 propensity scores trimmed to lower limit .01.

(note: variable final was str5, now str10 to accommodate using data's values)
file out_36931/results.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  ss  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.082    (0.021)
  ss  1  [shortstack]          [ss]          [ss]    -0.082    (0.021)
  ps  1   [poolstack]          [ps]          [ps]    -0.082    (0.020)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0816578   .0211302    -3.86   0.000    -.1230722   -.0402434
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 6 propensity scores trimmed to lower limit .01.

(note: variable final was str5, now str10 to accommodate using data's values)
file out_36931/results.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  ps  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.082    (0.020)
  ss  1  [shortstack]          [ss]          [ss]    -0.082    (0.021)
  ps  1   [poolstack]          [ps]          [ps]    -0.082    (0.020)

Poolstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ps0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ps1
E[D|X]       = D_gender_r_ps_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0818102   .0204262    -4.01   0.000    -.1218447   -.0417756
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 5 propensity scores trimmed to lower limit .01.

(note: variable final was str5, now str10 to accommodate using data's values)
file out_36931/results.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .25102884    .25102884
    logit            2    2.974e-17    2.974e-17
  lassocv            3    .10792724    .10792724
  ridgecv            4    .09044566    .09044566
  lassocv            5    .01275596    .01275596
  ridgecv            6    1.511e-17    1.511e-17
       rf            7    .27079005    .27079005
       rf            8    4.644e-17    4.644e-17
       rf            9    6.490e-17    6.490e-17
gradboost           10    .04769686    .04769686
gradboost           11    .19049989    .19049989
     nnet           12    3.562e-17    3.562e-17
     nnet           13     .0288555     .0288555

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .01283412    .01283412
      ols            2            0    .00250399    .00250399
  lassocv            3            0    .08753844    .08753844
  ridgecv            4            0    .20707756    .20707756
  lassocv            5            0    .03368459    .03368459
  ridgecv            6            0    .02034888    .02034888
       rf            7            0    .42374647    .42374647
       rf            8            0    6.817e-17    6.817e-17
       rf            9            0    8.655e-17    8.655e-17
gradboost           10            0    .02064205    .02064205
gradboost           11            0    .17191636    .17191636
     nnet           12            0    .01174934    .01174934
     nnet           13            0    .00795821    .00795821
      ols            1            1    .01731232    .01731232
      ols            2            1    .00026868    .00026868
  lassocv            3            1    .21599121    .21599121
  ridgecv            4            1      .017393      .017393
  lassocv            5            1    .07812159    .07812159
  ridgecv            6            1    .04842016    .04842016
       rf            7            1    .52176981    .52176981
       rf            8            1    3.934e-17    3.934e-17
       rf            9            1    6.947e-17    6.947e-17
gradboost           10            1    .00407053    .00407053
gradboost           11            1    .06690253    .06690253
     nnet           12            1    .01748081    .01748081
     nnet           13            1    .01226936    .01226936

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .25102884    .25102884
    logit            2    2.974e-17    2.974e-17
  lassocv            3    .10792724    .10792724
  ridgecv            4    .09044566    .09044566
  lassocv            5    .01275596    .01275596
  ridgecv            6    1.511e-17    1.511e-17
       rf            7    .27079005    .27079005
       rf            8    4.644e-17    4.644e-17
       rf            9    6.490e-17    6.490e-17
gradboost           10    .04769686    .04769686
gradboost           11    .19049989    .19049989
     nnet           12    3.562e-17    3.562e-17
     nnet           13     .0288555     .0288555

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .01283412    .01283412
      ols            2            0    .00250399    .00250399
  lassocv            3            0    .08753844    .08753844
  ridgecv            4            0    .20707756    .20707756
  lassocv            5            0    .03368459    .03368459
  ridgecv            6            0    .02034888    .02034888
       rf            7            0    .42374647    .42374647
       rf            8            0    6.817e-17    6.817e-17
       rf            9            0    8.655e-17    8.655e-17
gradboost           10            0    .02064205    .02064205
gradboost           11            0    .17191636    .17191636
     nnet           12            0    .01174934    .01174934
     nnet           13            0    .00795821    .00795821
      ols            1            1    .01731232    .01731232
      ols            2            1    .00026868    .00026868
  lassocv            3            1    .21599121    .21599121
  ridgecv            4            1      .017393      .017393
  lassocv            5            1    .07812159    .07812159
  ridgecv            6            1    .04842016    .04842016
       rf            7            1    .52176981    .52176981
       rf            8            1    3.934e-17    3.934e-17
       rf            9            1    6.947e-17    6.947e-17
gradboost           10            1    .00407053    .00407053
gradboost           11            1    .06690253    .06690253
     nnet           12            1    .01748081    .01748081
     nnet           13            1    .01226936    .01226936

Y1_pystacked_w_mn[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .01283412    .01283412
      ols            2            0    .00250399    .00250399
  lassocv            3            0    .08753844    .08753844
  ridgecv            4            0    .20707756    .20707756
  lassocv            5            0    .03368459    .03368459
  ridgecv            6            0    .02034888    .02034888
       rf            7            0    .42374647    .42374647
       rf            8            0    6.817e-17    6.817e-17
       rf            9            0    8.655e-17    8.655e-17
gradboost           10            0    .02064205    .02064205
gradboost           11            0    .17191636    .17191636
     nnet           12            0    .01174934    .01174934
     nnet           13            0    .00795821    .00795821
      ols            1            1    .01731232    .01731232
      ols            2            1    .00026868    .00026868
  lassocv            3            1    .21599121    .21599121
  ridgecv            4            1      .017393      .017393
  lassocv            5            1    .07812159    .07812159
  ridgecv            6            1    .04842016    .04842016
       rf            7            1    .52176981    .52176981
       rf            8            1    3.934e-17    3.934e-17
       rf            9            1    6.947e-17    6.947e-17
gradboost           10            1    .00407053    .00407053
gradboost           11            1    .06690253    .06690253
     nnet           12            1    .01748081    .01748081
     nnet           13            1    .01226936    .01226936

      +-------------------------------------------+
      | Y1_pys~1   Y1_pys~2   Y1_pys~3   Y1_pys~4 |
      |-------------------------------------------|
   1. |        1          0   .0128341   .0128341 |
   2. |        2          0    .002504    .002504 |
   3. |        3          0   .0875384   .0875384 |
   4. |        4          0   .2070776   .2070776 |
   5. |        5          0   .0336846   .0336846 |
      |-------------------------------------------|
   6. |        6          0   .0203489   .0203489 |
   7. |        7          0   .4237465   .4237465 |
   8. |        8          0   6.82e-17   6.82e-17 |
      +-------------------------------------------+
(note: file out_36931/Y1_pystacked_w_mn_nnls1_regular_ia.dta not found)
file out_36931/Y1_pystacked_w_mn_nnls1_regular_ia.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .25102884    .25102884
    logit            2    2.974e-17    2.974e-17
  lassocv            3    .10792724    .10792724
  ridgecv            4    .09044566    .09044566
  lassocv            5    .01275596    .01275596
  ridgecv            6    1.511e-17    1.511e-17
       rf            7    .27079005    .27079005
       rf            8    4.644e-17    4.644e-17
       rf            9    6.490e-17    6.490e-17
gradboost           10    .04769686    .04769686
gradboost           11    .19049989    .19049989
     nnet           12    3.562e-17    3.562e-17
     nnet           13     .0288555     .0288555

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .01283412    .01283412
      ols            2            0    .00250399    .00250399
  lassocv            3            0    .08753844    .08753844
  ridgecv            4            0    .20707756    .20707756
  lassocv            5            0    .03368459    .03368459
  ridgecv            6            0    .02034888    .02034888
       rf            7            0    .42374647    .42374647
       rf            8            0    6.817e-17    6.817e-17
       rf            9            0    8.655e-17    8.655e-17
gradboost           10            0    .02064205    .02064205
gradboost           11            0    .17191636    .17191636
     nnet           12            0    .01174934    .01174934
     nnet           13            0    .00795821    .00795821
      ols            1            1    .01731232    .01731232
      ols            2            1    .00026868    .00026868
  lassocv            3            1    .21599121    .21599121
  ridgecv            4            1      .017393      .017393
  lassocv            5            1    .07812159    .07812159
  ridgecv            6            1    .04842016    .04842016
       rf            7            1    .52176981    .52176981
       rf            8            1    3.934e-17    3.934e-17
       rf            9            1    6.947e-17    6.947e-17
gradboost           10            1    .00407053    .00407053
gradboost           11            1    .06690253    .06690253
     nnet           12            1    .01748081    .01748081
     nnet           13            1    .01226936    .01226936

D1_pystacked_w_mn[13,3]
               learner  mean_weight        rep_1
    logit            1    .25102884    .25102884
    logit            2    2.974e-17    2.974e-17
  lassocv            3    .10792724    .10792724
  ridgecv            4    .09044566    .09044566
  lassocv            5    .01275596    .01275596
  ridgecv            6    1.511e-17    1.511e-17
       rf            7    .27079005    .27079005
       rf            8    4.644e-17    4.644e-17
       rf            9    6.490e-17    6.490e-17
gradboost           10    .04769686    .04769686
gradboost           11    .19049989    .19049989
     nnet           12    3.562e-17    3.562e-17
     nnet           13     .0288555     .0288555

      +--------------------------------+
      | D1_pys~1   D1_pys~2   D1_pys~3 |
      |--------------------------------|
   1. |        1   .2510288   .2510288 |
   2. |        2   2.97e-17   2.97e-17 |
   3. |        3   .1079272   .1079272 |
   4. |        4   .0904457   .0904457 |
   5. |        5    .012756    .012756 |
      |--------------------------------|
   6. |        6   1.51e-17   1.51e-17 |
   7. |        7     .27079     .27079 |
   8. |        8   4.64e-17   4.64e-17 |
      +--------------------------------+
(note: file out_36931/D1_pystacked_w_mn_nnls1_regular_ia.dta not found)
file out_36931/D1_pystacked_w_mn_nnls1_regular_ia.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .24905084    .24905084
    logit            2    2.282e-16    2.282e-16
  lassocv            3            0            0
  ridgecv            4    .12590257    .12590257
  lassocv            5    5.308e-17    5.308e-17
  ridgecv            6    .01622866    .01622866
       rf            7    .32841215    .32841215
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11    .28040578    .28040578
     nnet           12            0            0
     nnet           13            0            0

short-stacked weights across resamples for lnearn
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .03617654    .03617654
      ols            2            0            0            0
  lassocv            3            0    1.407e-16    1.407e-16
  ridgecv            4            0    .21911964    .21911964
  lassocv            5            0    .03828602    .03828602
  ridgecv            6            0    5.183e-17    5.183e-17
       rf            7            0     .5097337     .5097337
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0    .05368106    .05368106
gradboost           11            0    .12863024    .12863024
     nnet           12            0    2.195e-16    2.195e-16
     nnet           13            0    .01437281    .01437281
      ols            1            1    .00902068    .00902068
      ols            2            1            0            0
  lassocv            3            1    .06296104    .06296104
  ridgecv            4            1    .01698307    .01698307
  lassocv            5            1    .29929136    .29929136
  ridgecv            6            1    .01732436    .01732436
       rf            7            1    .53553513    .53553513
       rf            8            1    5.950e-17    5.950e-17
       rf            9            1            0            0
gradboost           10            1    6.958e-18    6.958e-18
gradboost           11            1    .05452347    .05452347
     nnet           12            1            0            0
     nnet           13            1     .0043609     .0043609

short-stacked weights across resamples for gender_r
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .24905084    .24905084
    logit            2    2.282e-16    2.282e-16
  lassocv            3            0            0
  ridgecv            4    .12590257    .12590257
  lassocv            5    5.308e-17    5.308e-17
  ridgecv            6    .01622866    .01622866
       rf            7    .32841215    .32841215
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11    .28040578    .28040578
     nnet           12            0            0
     nnet           13            0            0

short-stacked weights across resamples for lnearn
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .03617654    .03617654
      ols            2            0            0            0
  lassocv            3            0    1.407e-16    1.407e-16
  ridgecv            4            0    .21911964    .21911964
  lassocv            5            0    .03828602    .03828602
  ridgecv            6            0    5.183e-17    5.183e-17
       rf            7            0     .5097337     .5097337
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0    .05368106    .05368106
gradboost           11            0    .12863024    .12863024
     nnet           12            0    2.195e-16    2.195e-16
     nnet           13            0    .01437281    .01437281
      ols            1            1    .00902068    .00902068
      ols            2            1            0            0
  lassocv            3            1    .06296104    .06296104
  ridgecv            4            1    .01698307    .01698307
  lassocv            5            1    .29929136    .29929136
  ridgecv            6            1    .01732436    .01732436
       rf            7            1    .53553513    .53553513
       rf            8            1    5.950e-17    5.950e-17
       rf            9            1            0            0
gradboost           10            1    6.958e-18    6.958e-18
gradboost           11            1    .05452347    .05452347
     nnet           12            1            0            0
     nnet           13            1     .0043609     .0043609

Y_lnearn_ss[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .03617654    .03617654
      ols            2            0            0            0
  lassocv            3            0    1.407e-16    1.407e-16
  ridgecv            4            0    .21911964    .21911964
  lassocv            5            0    .03828602    .03828602
  ridgecv            6            0    5.183e-17    5.183e-17
       rf            7            0     .5097337     .5097337
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0    .05368106    .05368106
gradboost           11            0    .12863024    .12863024
     nnet           12            0    2.195e-16    2.195e-16
     nnet           13            0    .01437281    .01437281
      ols            1            1    .00902068    .00902068
      ols            2            1            0            0
  lassocv            3            1    .06296104    .06296104
  ridgecv            4            1    .01698307    .01698307
  lassocv            5            1    .29929136    .29929136
  ridgecv            6            1    .01732436    .01732436
       rf            7            1    .53553513    .53553513
       rf            8            1    5.950e-17    5.950e-17
       rf            9            1            0            0
gradboost           10            1    6.958e-18    6.958e-18
gradboost           11            1    .05452347    .05452347
     nnet           12            1            0            0
     nnet           13            1     .0043609     .0043609

      +-------------------------------------------------------------------+
      | Y_lne~1_1   Y_lne~0_1   Y_lne~s1   Y_lnea~2   Y_lnea~3   Y_lnea~4 |
      |-------------------------------------------------------------------|
   1. | 2.5115221   2.7728488          1          0   .0361765   .0361765 |
   2. | 2.9885982   3.2688595          2          0          0          0 |
   3. | 2.8136785   2.8616145          3          0   1.41e-16   1.41e-16 |
   4. |  2.477762   2.6631863          4          0   .2191196   .2191196 |
   5. |   3.13844   3.1428046          5          0    .038286    .038286 |
      |-------------------------------------------------------------------|
   6. | 2.5557955   2.7063419          6          0   5.18e-17   5.18e-17 |
   7. | 2.4376969   2.5900005          7          0   .5097337   .5097337 |
   8. | 2.6324605   2.7240949          8          0          0          0 |
      +-------------------------------------------------------------------+
(note: file out_36931/Y_lnearn_ss_nnls1_short_ia.dta not found)
file out_36931/Y_lnearn_ss_nnls1_short_ia.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .24905084    .24905084
    logit            2    2.282e-16    2.282e-16
  lassocv            3            0            0
  ridgecv            4    .12590257    .12590257
  lassocv            5    5.308e-17    5.308e-17
  ridgecv            6    .01622866    .01622866
       rf            7    .32841215    .32841215
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11    .28040578    .28040578
     nnet           12            0            0
     nnet           13            0            0

short-stacked weights across resamples for lnearn
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .03617654    .03617654
      ols            2            0            0            0
  lassocv            3            0    1.407e-16    1.407e-16
  ridgecv            4            0    .21911964    .21911964
  lassocv            5            0    .03828602    .03828602
  ridgecv            6            0    5.183e-17    5.183e-17
       rf            7            0     .5097337     .5097337
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0    .05368106    .05368106
gradboost           11            0    .12863024    .12863024
     nnet           12            0    2.195e-16    2.195e-16
     nnet           13            0    .01437281    .01437281
      ols            1            1    .00902068    .00902068
      ols            2            1            0            0
  lassocv            3            1    .06296104    .06296104
  ridgecv            4            1    .01698307    .01698307
  lassocv            5            1    .29929136    .29929136
  ridgecv            6            1    .01732436    .01732436
       rf            7            1    .53553513    .53553513
       rf            8            1    5.950e-17    5.950e-17
       rf            9            1            0            0
gradboost           10            1    6.958e-18    6.958e-18
gradboost           11            1    .05452347    .05452347
     nnet           12            1            0            0
     nnet           13            1     .0043609     .0043609

D_gender_r_ss[13,3]
               learner  mean_weight        rep_1
    logit            1    .24905084    .24905084
    logit            2    2.282e-16    2.282e-16
  lassocv            3            0            0
  ridgecv            4    .12590257    .12590257
  lassocv            5    5.308e-17    5.308e-17
  ridgecv            6    .01622866    .01622866
       rf            7    .32841215    .32841215
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11    .28040578    .28040578
     nnet           12            0            0
     nnet           13            0            0

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. |  .7760938          1   .2490508   .2490508 |
   2. | .38439607          2   2.28e-16   2.28e-16 |
   3. |  .0958694          3          0          0 |
   4. | .17508034          4   .1259026   .1259026 |
   5. | .58408948          5   5.31e-17   5.31e-17 |
      |--------------------------------------------|
   6. | .83857234          6   .0162287   .0162287 |
   7. | .81934059          7   .3284121   .3284121 |
   8. | .90038786          8          0          0 |
      +--------------------------------------------+
(note: file out_36931/D_gender_r_ss_nnls1_short_ia.dta not found)
file out_36931/D_gender_r_ss_nnls1_short_ia.dta saved

pool-stacked weights across resamples for gender_r
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .26127425    .26127425
    logit            2            0            0
  lassocv            3    .12791454    .12791454
  ridgecv            4    .09218275    .09218275
  lassocv            5    4.354e-19    4.354e-19
  ridgecv            6            0            0
       rf            7    .29360108    .29360108
       rf            8    3.100e-16    3.100e-16
       rf            9            0            0
gradboost           10            0            0
gradboost           11    .20810225    .20810225
     nnet           12    1.712e-16    1.712e-16
     nnet           13    .01692514    .01692514

pool-stacked weights across resamples for lnearn
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .01007179    .01007179
      ols            2            0            0            0
  lassocv            3            0    .11560574    .11560574
  ridgecv            4            0    .23544359    .23544359
  lassocv            5            0    3.409e-16    3.409e-16
  ridgecv            6            0            0            0
       rf            7            0    .45024014    .45024014
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0    .18520752    .18520752
     nnet           12            0    1.150e-15    1.150e-15
     nnet           13            0    .00343122    .00343122
      ols            1            1    3.568e-16    3.568e-16
      ols            2            1    9.836e-16    9.836e-16
  lassocv            3            1    .32771656    .32771656
  ridgecv            4            1     .0208779     .0208779
  lassocv            5            1            0            0
  ridgecv            6            1    .03748737    .03748737
       rf            7            1    .52917511    .52917511
       rf            8            1    9.427e-16    9.427e-16
       rf            9            1    1.973e-15    1.973e-15
gradboost           10            1    3.411e-16    3.411e-16
gradboost           11            1    .08049548    .08049548
     nnet           12            1    2.220e-15    2.220e-15
     nnet           13            1    .00424757    .00424757

pool-stacked weights across resamples for gender_r
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .26127425    .26127425
    logit            2            0            0
  lassocv            3    .12791454    .12791454
  ridgecv            4    .09218275    .09218275
  lassocv            5    4.354e-19    4.354e-19
  ridgecv            6            0            0
       rf            7    .29360108    .29360108
       rf            8    3.100e-16    3.100e-16
       rf            9            0            0
gradboost           10            0            0
gradboost           11    .20810225    .20810225
     nnet           12    1.712e-16    1.712e-16
     nnet           13    .01692514    .01692514

pool-stacked weights across resamples for lnearn
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .01007179    .01007179
      ols            2            0            0            0
  lassocv            3            0    .11560574    .11560574
  ridgecv            4            0    .23544359    .23544359
  lassocv            5            0    3.409e-16    3.409e-16
  ridgecv            6            0            0            0
       rf            7            0    .45024014    .45024014
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0    .18520752    .18520752
     nnet           12            0    1.150e-15    1.150e-15
     nnet           13            0    .00343122    .00343122
      ols            1            1    3.568e-16    3.568e-16
      ols            2            1    9.836e-16    9.836e-16
  lassocv            3            1    .32771656    .32771656
  ridgecv            4            1     .0208779     .0208779
  lassocv            5            1            0            0
  ridgecv            6            1    .03748737    .03748737
       rf            7            1    .52917511    .52917511
       rf            8            1    9.427e-16    9.427e-16
       rf            9            1    1.973e-15    1.973e-15
gradboost           10            1    3.411e-16    3.411e-16
gradboost           11            1    .08049548    .08049548
     nnet           12            1    2.220e-15    2.220e-15
     nnet           13            1    .00424757    .00424757

Y_lnearn_ps[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .01007179    .01007179
      ols            2            0            0            0
  lassocv            3            0    .11560574    .11560574
  ridgecv            4            0    .23544359    .23544359
  lassocv            5            0    3.409e-16    3.409e-16
  ridgecv            6            0            0            0
       rf            7            0    .45024014    .45024014
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0    .18520752    .18520752
     nnet           12            0    1.150e-15    1.150e-15
     nnet           13            0    .00343122    .00343122
      ols            1            1    3.568e-16    3.568e-16
      ols            2            1    9.836e-16    9.836e-16
  lassocv            3            1    .32771656    .32771656
  ridgecv            4            1     .0208779     .0208779
  lassocv            5            1            0            0
  ridgecv            6            1    .03748737    .03748737
       rf            7            1    .52917511    .52917511
       rf            8            1    9.427e-16    9.427e-16
       rf            9            1    1.973e-15    1.973e-15
gradboost           10            1    3.411e-16    3.411e-16
gradboost           11            1    .08049548    .08049548
     nnet           12            1    2.220e-15    2.220e-15
     nnet           13            1    .00424757    .00424757

      +-------------------------------------------------------------------+
      | Y_lne~1_1   Y_lne~0_1   Y_lne~s1   Y_lnea~2   Y_lnea~3   Y_lnea~4 |
      |-------------------------------------------------------------------|
   1. | 2.5194991   2.7696486          1          0   .0100718   .0100718 |
   2. | 2.9873166   3.2674423          2          0          0          0 |
   3. | 2.8078863   2.8520346          3          0   .1156057   .1156057 |
   4. | 2.4739142   2.7056743          4          0   .2354436   .2354436 |
   5. | 3.1448496   3.1335255          5          0   3.41e-16   3.41e-16 |
      |-------------------------------------------------------------------|
   6. | 2.5537364   2.7224308          6          0          0          0 |
   7. | 2.3797453   2.5831855          7          0   .4502401   .4502401 |
   8. | 2.6251008   2.7105883          8          0          0          0 |
      +-------------------------------------------------------------------+
(note: file out_36931/Y_lnearn_ps_nnls1_pooled_ia.dta not found)
file out_36931/Y_lnearn_ps_nnls1_pooled_ia.dta saved

pool-stacked weights across resamples for gender_r
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .26127425    .26127425
    logit            2            0            0
  lassocv            3    .12791454    .12791454
  ridgecv            4    .09218275    .09218275
  lassocv            5    4.354e-19    4.354e-19
  ridgecv            6            0            0
       rf            7    .29360108    .29360108
       rf            8    3.100e-16    3.100e-16
       rf            9            0            0
gradboost           10            0            0
gradboost           11    .20810225    .20810225
     nnet           12    1.712e-16    1.712e-16
     nnet           13    .01692514    .01692514

pool-stacked weights across resamples for lnearn
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .01007179    .01007179
      ols            2            0            0            0
  lassocv            3            0    .11560574    .11560574
  ridgecv            4            0    .23544359    .23544359
  lassocv            5            0    3.409e-16    3.409e-16
  ridgecv            6            0            0            0
       rf            7            0    .45024014    .45024014
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0    .18520752    .18520752
     nnet           12            0    1.150e-15    1.150e-15
     nnet           13            0    .00343122    .00343122
      ols            1            1    3.568e-16    3.568e-16
      ols            2            1    9.836e-16    9.836e-16
  lassocv            3            1    .32771656    .32771656
  ridgecv            4            1     .0208779     .0208779
  lassocv            5            1            0            0
  ridgecv            6            1    .03748737    .03748737
       rf            7            1    .52917511    .52917511
       rf            8            1    9.427e-16    9.427e-16
       rf            9            1    1.973e-15    1.973e-15
gradboost           10            1    3.411e-16    3.411e-16
gradboost           11            1    .08049548    .08049548
     nnet           12            1    2.220e-15    2.220e-15
     nnet           13            1    .00424757    .00424757

D_gender_r_ps[13,3]
               learner  mean_weight        rep_1
    logit            1    .26127425    .26127425
    logit            2            0            0
  lassocv            3    .12791454    .12791454
  ridgecv            4    .09218275    .09218275
  lassocv            5    4.354e-19    4.354e-19
  ridgecv            6            0            0
       rf            7    .29360108    .29360108
       rf            8    3.100e-16    3.100e-16
       rf            9            0            0
gradboost           10            0            0
gradboost           11    .20810225    .20810225
     nnet           12    1.712e-16    1.712e-16
     nnet           13    .01692514    .01692514

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .76771686          1   .2612742   .2612742 |
   2. | .37791104          2          0          0 |
   3. | .09731626          3   .1279145   .1279145 |
   4. |  .1863443          4   .0921827   .0921827 |
   5. | .58316961          5   4.35e-19   4.35e-19 |
      |--------------------------------------------|
   6. | .83310623          6          0          0 |
   7. | .82316982          7   .2936011   .2936011 |
   8. | .89487505          8   3.10e-16   3.10e-16 |
      +--------------------------------------------+
(note: file out_36931/D_gender_r_ps_nnls1_pooled_ia.dta not found)
file out_36931/D_gender_r_ps_nnls1_pooled_ia.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.091    (0.029)
  ss  1  [shortstack]          [ss]          [ss]    -0.105    (0.030)
  ps  1   [poolstack]          [ps]          [ps]    -0.090    (0.030)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1049418   .0301744    -3.48   0.001    -.1640825    -.045801
------------------------------------------------------------------------------
Stacking final estimator: singlebest
Warning: 70 propensity scores trimmed to lower limit .01.
Warning: 14 propensity scores trimmed to upper limit .99.
Warning: . resamples had propensity scores trimmed to upper limit .99.



Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.091    (0.029)
  ss  1  [shortstack]          [ss]          [ss]    -0.105    (0.030)
  ps  1   [poolstack]          [ps]          [ps]    -0.090    (0.030)

Stacking DDML model (ATET)
E[y|X,D=0]   = Y1_pystacked0_1                     Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1
E[D|X]       = D1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0913359   .0293691    -3.11   0.002    -.1488982   -.0337737
------------------------------------------------------------------------------
Stacking final estimator: singlebest
Warning: 73 propensity scores trimmed to lower limit .01.
Warning: 11 propensity scores trimmed to upper limit .99.
Warning: . resamples had propensity scores trimmed to upper limit .99.

file out_36931/results.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  ss  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.105    (0.030)
  ss  1  [shortstack]          [ss]          [ss]    -0.105    (0.030)
  ps  1   [poolstack]          [ps]          [ps]    -0.090    (0.030)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1049418   .0301744    -3.48   0.001    -.1640825    -.045801
------------------------------------------------------------------------------
Stacking final estimator: singlebest
Warning: 70 propensity scores trimmed to lower limit .01.
Warning: 14 propensity scores trimmed to upper limit .99.
Warning: . resamples had propensity scores trimmed to upper limit .99.

file out_36931/results.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  ps  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.090    (0.030)
  ss  1  [shortstack]          [ss]          [ss]    -0.105    (0.030)
  ps  1   [poolstack]          [ps]          [ps]    -0.090    (0.030)

Poolstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ps0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ps1
E[D|X]       = D_gender_r_ps_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0901579   .0298966    -3.02   0.003    -.1487542   -.0315617
------------------------------------------------------------------------------
Stacking final estimator: singlebest
Warning: 77 propensity scores trimmed to lower limit .01.
Warning: 14 propensity scores trimmed to upper limit .99.
Warning: . resamples had propensity scores trimmed to upper limit .99.

file out_36931/results.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3           .9           .9
  ridgecv            4           .1           .1
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0           .1           .1
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0           .9           .9
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1           .1           .1
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1           .9           .9
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3           .9           .9
  ridgecv            4           .1           .1
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0           .1           .1
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0           .9           .9
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1           .1           .1
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1           .9           .9
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

Y1_pystacked_w_mn[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0           .1           .1
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0           .9           .9
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1           .1           .1
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1           .9           .9
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

      +-------------------------------------------+
      | Y1_pys~1   Y1_pys~2   Y1_pys~3   Y1_pys~4 |
      |-------------------------------------------|
   1. |        1          0          0          0 |
   2. |        2          0          0          0 |
   3. |        3          0         .1         .1 |
   4. |        4          0          0          0 |
   5. |        5          0          0          0 |
      |-------------------------------------------|
   6. |        6          0          0          0 |
   7. |        7          0         .9         .9 |
   8. |        8          0          0          0 |
      +-------------------------------------------+
(note: file out_36931/Y1_pystacked_w_mn_singlebest_regular_ia.dta not found)
file out_36931/Y1_pystacked_w_mn_singlebest_regular_ia.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3           .9           .9
  ridgecv            4           .1           .1
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0           .1           .1
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0           .9           .9
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1           .1           .1
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1           .9           .9
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

D1_pystacked_w_mn[13,3]
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3           .9           .9
  ridgecv            4           .1           .1
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

      +--------------------------------+
      | D1_pys~1   D1_pys~2   D1_pys~3 |
      |--------------------------------|
   1. |        1          0          0 |
   2. |        2          0          0 |
   3. |        3         .9         .9 |
   4. |        4         .1         .1 |
   5. |        5          0          0 |
      |--------------------------------|
   6. |        6          0          0 |
   7. |        7          0          0 |
   8. |        8          0          0 |
      +--------------------------------+
(note: file out_36931/D1_pystacked_w_mn_singlebest_regular_ia.dta not found)
file out_36931/D1_pystacked_w_mn_singlebest_regular_ia.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3            0            0
  ridgecv            4            0            0
  lassocv            5            1            1
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

short-stacked weights across resamples for lnearn
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

short-stacked weights across resamples for gender_r
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3            0            0
  ridgecv            4            0            0
  lassocv            5            1            1
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

short-stacked weights across resamples for lnearn
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

Y_lnearn_ss[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

      +-------------------------------------------------------------------+
      | Y_lne~1_1   Y_lne~0_1   Y_lne~s1   Y_lnea~2   Y_lnea~3   Y_lnea~4 |
      |-------------------------------------------------------------------|
   1. | 2.4891562   2.8241022          1          0          0          0 |
   2. | 2.8996017   3.2176948          2          0          0          0 |
   3. | 2.8763957   2.8855844          3          0          0          0 |
   4. | 2.4835749   2.5970449          4          0          0          0 |
   5. | 3.1373951   3.1692369          5          0          0          0 |
      |-------------------------------------------------------------------|
   6. | 2.5099487   2.7103558          6          0          0          0 |
   7. | 2.5142646   2.7970853          7          0          1          1 |
   8. | 2.6410685   2.7706416          8          0          0          0 |
      +-------------------------------------------------------------------+
(note: file out_36931/Y_lnearn_ss_singlebest_short_ia.dta not found)
file out_36931/Y_lnearn_ss_singlebest_short_ia.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3            0            0
  ridgecv            4            0            0
  lassocv            5            1            1
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

short-stacked weights across resamples for lnearn
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

D_gender_r_ss[13,3]
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3            0            0
  ridgecv            4            0            0
  lassocv            5            1            1
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .75975126          1          0          0 |
   2. | .34733301          2          0          0 |
   3. | .10218111          3          0          0 |
   4. | .29550895          4          0          0 |
   5. | .59031755          5          1          1 |
      |--------------------------------------------|
   6. | .80123508          6          0          0 |
   7. | .82562023          7          0          0 |
   8. | .86540079          8          0          0 |
      +--------------------------------------------+
(note: file out_36931/D_gender_r_ss_singlebest_short_ia.dta not found)
file out_36931/D_gender_r_ss_singlebest_short_ia.dta saved

pool-stacked weights across resamples for gender_r
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3            1            1
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

pool-stacked weights across resamples for lnearn
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

pool-stacked weights across resamples for gender_r
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3            1            1
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

pool-stacked weights across resamples for lnearn
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

Y_lnearn_ps[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

      +-------------------------------------------------------------------+
      | Y_lne~1_1   Y_lne~0_1   Y_lne~s1   Y_lnea~2   Y_lnea~3   Y_lnea~4 |
      |-------------------------------------------------------------------|
   1. | 2.4891562   2.8241022          1          0          0          0 |
   2. | 2.8996017   3.2176948          2          0          0          0 |
   3. | 2.8763957   2.8855844          3          0          0          0 |
   4. | 2.4835749   2.5970449          4          0          0          0 |
   5. | 3.1373951   3.1692369          5          0          0          0 |
      |-------------------------------------------------------------------|
   6. | 2.5099487   2.7103558          6          0          0          0 |
   7. | 2.5142646   2.7970853          7          0          1          1 |
   8. | 2.6410685   2.7706416          8          0          0          0 |
      +-------------------------------------------------------------------+
(note: file out_36931/Y_lnearn_ps_singlebest_pooled_ia.dta not found)
file out_36931/Y_lnearn_ps_singlebest_pooled_ia.dta saved

pool-stacked weights across resamples for gender_r
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3            1            1
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

pool-stacked weights across resamples for lnearn
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

D_gender_r_ps[13,3]
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3            1            1
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. |  .7265203          1          0          0 |
   2. | .35001469          2          0          0 |
   3. | .09284976          3          1          1 |
   4. | .25637588          4          0          0 |
   5. | .56119812          5          0          0 |
      |--------------------------------------------|
   6. |  .8061896          6          0          0 |
   7. | .81662387          7          0          0 |
   8. | .84823531          8          0          0 |
      +--------------------------------------------+
(note: file out_36931/D_gender_r_ps_singlebest_pooled_ia.dta not found)
file out_36931/D_gender_r_ps_singlebest_pooled_ia.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked     1.036    (0.133)
  ss  1  [shortstack]          [ss]          [ss]    -0.312    (0.010)
  ps  1   [poolstack]          [ps]          [ps]     0.189    (0.104)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.3115543   .0098943   -31.49   0.000    -.3309468   -.2921618
------------------------------------------------------------------------------
Stacking final estimator: ols
Warning: 929 propensity scores trimmed to lower limit .01.



Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked     1.036    (0.133)
  ss  1  [shortstack]          [ss]          [ss]    -0.312    (0.010)
  ps  1   [poolstack]          [ps]          [ps]     0.189    (0.104)

Stacking DDML model (ATET)
E[y|X,D=0]   = Y1_pystacked0_1                     Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1
E[D|X]       = D1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |   1.035937   .1330066     7.79   0.000     .7752486    1.296625
------------------------------------------------------------------------------
Stacking final estimator: ols
Warning: 3222 propensity scores trimmed to lower limit .01.
Warning: 121 propensity scores trimmed to upper limit .99.
Warning: . resamples had propensity scores trimmed to upper limit .99.

(note: variable final was str3, now str10 to accommodate using data's values)
file out_36931/results.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  ss  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.312    (0.010)
  ss  1  [shortstack]          [ss]          [ss]    -0.312    (0.010)
  ps  1   [poolstack]          [ps]          [ps]     0.189    (0.104)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.3115543   .0098943   -31.49   0.000    -.3309468   -.2921618
------------------------------------------------------------------------------
Stacking final estimator: ols
Warning: 929 propensity scores trimmed to lower limit .01.

(note: variable final was str3, now str10 to accommodate using data's values)
file out_36931/results.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  ps  1  Y1_pystacked  Y1_pystacked  D1_pystacked     0.189    (0.104)
  ss  1  [shortstack]          [ss]          [ss]    -0.312    (0.010)
  ps  1   [poolstack]          [ps]          [ps]     0.189    (0.104)

Poolstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ps0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ps1
E[D|X]       = D_gender_r_ps_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |   .1890076   .1039002     1.82   0.069    -.0146331    .3926483
------------------------------------------------------------------------------
Stacking final estimator: ols
Warning: 13 propensity scores trimmed to lower limit .01.
Warning: 257 propensity scores trimmed to upper limit .99.
Warning: . resamples had propensity scores trimmed to upper limit .99.

(note: variable final was str3, now str10 to accommodate using data's values)
file out_36931/results.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .22281478    .22281478
    logit            2     .0743521     .0743521
  lassocv            3    .39200378    .39200378
  ridgecv            4    .15529831    .15529831
  lassocv            5   -.24976368   -.24976368
  ridgecv            6   -.05995034   -.05995034
       rf            7    .41000824    .41000824
       rf            8    .10905923    .10905923
       rf            9   -.22093186   -.22093186
gradboost           10     .0856803     .0856803
gradboost           11    .13284293    .13284293
     nnet           12   -2.4418376   -2.4418376
     nnet           13    .01976808    .01976808

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0   -.00169491   -.00169491
      ols            2            0   -.01602267   -.01602267
  lassocv            3            0    .01640125    .01640125
  ridgecv            4            0    .50511109    .50511109
  lassocv            5            0    -.0603972    -.0603972
  ridgecv            6            0   -.03643648   -.03643648
       rf            7            0    .67030145    .67030145
       rf            8            0   -.25152204   -.25152204
       rf            9            0    .13053938    .13053938
gradboost           10            0    .03750788    .03750788
gradboost           11            0    .11045305    .11045305
     nnet           12            0   -.25996837   -.25996837
     nnet           13            0   -.00333644   -.00333644
      ols            1            1    .00314084    .00314084
      ols            2            1   -.00907476   -.00907476
  lassocv            3            1    .11454441    .11454441
  ridgecv            4            1    .23941752    .23941752
  lassocv            5            1    .13683377    .13683377
  ridgecv            6            1   -.04825992   -.04825992
       rf            7            1    .55926103    .55926103
       rf            8            1    .32766856    .32766856
       rf            9            1   -.27727452   -.27727452
gradboost           10            1   -.03651663   -.03651663
gradboost           11            1    .04876608    .04876608
     nnet           12            1   -.07384005   -.07384005
     nnet           13            1    .00071551    .00071551

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .22281478    .22281478
    logit            2     .0743521     .0743521
  lassocv            3    .39200378    .39200378
  ridgecv            4    .15529831    .15529831
  lassocv            5   -.24976368   -.24976368
  ridgecv            6   -.05995034   -.05995034
       rf            7    .41000824    .41000824
       rf            8    .10905923    .10905923
       rf            9   -.22093186   -.22093186
gradboost           10     .0856803     .0856803
gradboost           11    .13284293    .13284293
     nnet           12   -2.4418376   -2.4418376
     nnet           13    .01976808    .01976808

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0   -.00169491   -.00169491
      ols            2            0   -.01602267   -.01602267
  lassocv            3            0    .01640125    .01640125
  ridgecv            4            0    .50511109    .50511109
  lassocv            5            0    -.0603972    -.0603972
  ridgecv            6            0   -.03643648   -.03643648
       rf            7            0    .67030145    .67030145
       rf            8            0   -.25152204   -.25152204
       rf            9            0    .13053938    .13053938
gradboost           10            0    .03750788    .03750788
gradboost           11            0    .11045305    .11045305
     nnet           12            0   -.25996837   -.25996837
     nnet           13            0   -.00333644   -.00333644
      ols            1            1    .00314084    .00314084
      ols            2            1   -.00907476   -.00907476
  lassocv            3            1    .11454441    .11454441
  ridgecv            4            1    .23941752    .23941752
  lassocv            5            1    .13683377    .13683377
  ridgecv            6            1   -.04825992   -.04825992
       rf            7            1    .55926103    .55926103
       rf            8            1    .32766856    .32766856
       rf            9            1   -.27727452   -.27727452
gradboost           10            1   -.03651663   -.03651663
gradboost           11            1    .04876608    .04876608
     nnet           12            1   -.07384005   -.07384005
     nnet           13            1    .00071551    .00071551

Y1_pystacked_w_mn[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0   -.00169491   -.00169491
      ols            2            0   -.01602267   -.01602267
  lassocv            3            0    .01640125    .01640125
  ridgecv            4            0    .50511109    .50511109
  lassocv            5            0    -.0603972    -.0603972
  ridgecv            6            0   -.03643648   -.03643648
       rf            7            0    .67030145    .67030145
       rf            8            0   -.25152204   -.25152204
       rf            9            0    .13053938    .13053938
gradboost           10            0    .03750788    .03750788
gradboost           11            0    .11045305    .11045305
     nnet           12            0   -.25996837   -.25996837
     nnet           13            0   -.00333644   -.00333644
      ols            1            1    .00314084    .00314084
      ols            2            1   -.00907476   -.00907476
  lassocv            3            1    .11454441    .11454441
  ridgecv            4            1    .23941752    .23941752
  lassocv            5            1    .13683377    .13683377
  ridgecv            6            1   -.04825992   -.04825992
       rf            7            1    .55926103    .55926103
       rf            8            1    .32766856    .32766856
       rf            9            1   -.27727452   -.27727452
gradboost           10            1   -.03651663   -.03651663
gradboost           11            1    .04876608    .04876608
     nnet           12            1   -.07384005   -.07384005
     nnet           13            1    .00071551    .00071551

      +---------------------------------------------+
      | Y1_pys~1   Y1_pys~2   Y1_pyst~3   Y1_pyst~4 |
      |---------------------------------------------|
   1. |        1          0   -.0016949   -.0016949 |
   2. |        2          0   -.0160227   -.0160227 |
   3. |        3          0    .0164012    .0164012 |
   4. |        4          0    .5051111    .5051111 |
   5. |        5          0   -.0603972   -.0603972 |
      |---------------------------------------------|
   6. |        6          0   -.0364365   -.0364365 |
   7. |        7          0    .6703014    .6703014 |
   8. |        8          0    -.251522    -.251522 |
      +---------------------------------------------+
(note: file out_36931/Y1_pystacked_w_mn_ols_regular_ia.dta not found)
file out_36931/Y1_pystacked_w_mn_ols_regular_ia.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .22281478    .22281478
    logit            2     .0743521     .0743521
  lassocv            3    .39200378    .39200378
  ridgecv            4    .15529831    .15529831
  lassocv            5   -.24976368   -.24976368
  ridgecv            6   -.05995034   -.05995034
       rf            7    .41000824    .41000824
       rf            8    .10905923    .10905923
       rf            9   -.22093186   -.22093186
gradboost           10     .0856803     .0856803
gradboost           11    .13284293    .13284293
     nnet           12   -2.4418376   -2.4418376
     nnet           13    .01976808    .01976808

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0   -.00169491   -.00169491
      ols            2            0   -.01602267   -.01602267
  lassocv            3            0    .01640125    .01640125
  ridgecv            4            0    .50511109    .50511109
  lassocv            5            0    -.0603972    -.0603972
  ridgecv            6            0   -.03643648   -.03643648
       rf            7            0    .67030145    .67030145
       rf            8            0   -.25152204   -.25152204
       rf            9            0    .13053938    .13053938
gradboost           10            0    .03750788    .03750788
gradboost           11            0    .11045305    .11045305
     nnet           12            0   -.25996837   -.25996837
     nnet           13            0   -.00333644   -.00333644
      ols            1            1    .00314084    .00314084
      ols            2            1   -.00907476   -.00907476
  lassocv            3            1    .11454441    .11454441
  ridgecv            4            1    .23941752    .23941752
  lassocv            5            1    .13683377    .13683377
  ridgecv            6            1   -.04825992   -.04825992
       rf            7            1    .55926103    .55926103
       rf            8            1    .32766856    .32766856
       rf            9            1   -.27727452   -.27727452
gradboost           10            1   -.03651663   -.03651663
gradboost           11            1    .04876608    .04876608
     nnet           12            1   -.07384005   -.07384005
     nnet           13            1    .00071551    .00071551

D1_pystacked_w_mn[13,3]
               learner  mean_weight        rep_1
    logit            1    .22281478    .22281478
    logit            2     .0743521     .0743521
  lassocv            3    .39200378    .39200378
  ridgecv            4    .15529831    .15529831
  lassocv            5   -.24976368   -.24976368
  ridgecv            6   -.05995034   -.05995034
       rf            7    .41000824    .41000824
       rf            8    .10905923    .10905923
       rf            9   -.22093186   -.22093186
gradboost           10     .0856803     .0856803
gradboost           11    .13284293    .13284293
     nnet           12   -2.4418376   -2.4418376
     nnet           13    .01976808    .01976808

      +----------------------------------+
      | D1_pys~1   D1_pyst~2   D1_pyst~3 |
      |----------------------------------|
   1. |        1    .2228148    .2228148 |
   2. |        2    .0743521    .0743521 |
   3. |        3    .3920038    .3920038 |
   4. |        4    .1552983    .1552983 |
   5. |        5   -.2497637   -.2497637 |
      |----------------------------------|
   6. |        6   -.0599503   -.0599503 |
   7. |        7    .4100083    .4100083 |
   8. |        8    .1090592    .1090592 |
      +----------------------------------+
(note: file out_36931/D1_pystacked_w_mn_ols_regular_ia.dta not found)
file out_36931/D1_pystacked_w_mn_ols_regular_ia.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .23765236    .23765236
    logit            2    .08495041    .08495041
  lassocv            3   -.08921249   -.08921249
  ridgecv            4    .13607069    .13607069
  lassocv            5   -.00183092   -.00183092
  ridgecv            6    .14364675    .14364675
       rf            7    .50909503    .50909503
       rf            8    .06290599    .06290599
       rf            9   -.19565776   -.19565776
gradboost           10    .02323716    .02323716
gradboost           11    .20949408    .20949408
     nnet           12   -.53206717   -.53206717
     nnet           13   -.02478684   -.02478684

short-stacked weights across resamples for lnearn
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .03708453    .03708453
      ols            2            0   -.07029802   -.07029802
  lassocv            3            0   -.30844209   -.30844209
  ridgecv            4            0    .71601011    .71601011
  lassocv            5            0    .07212682    .07212682
  ridgecv            6            0   -.13590673   -.13590673
       rf            7            0     .9482513     .9482513
       rf            8            0   -.80975243   -.80975243
       rf            9            0    .49237887    .49237887
gradboost           10            0    .16209199    .16209199
gradboost           11            0    .01675363    .01675363
     nnet           12            0    -.0259464    -.0259464
     nnet           13            0    .00464089    .00464089
      ols            1            1    .00797422    .00797422
      ols            2            1   -.01074083   -.01074083
  lassocv            3            1   -.15384206   -.15384206
  ridgecv            4            1    .34200472    .34200472
  lassocv            5            1    .37976229    .37976229
  ridgecv            6            1   -.08057378   -.08057378
       rf            7            1    .62909495    .62909495
       rf            8            1   -.12169748   -.12169748
       rf            9            1     .0729043     .0729043
gradboost           10            1    .06358261    .06358261
gradboost           11            1   -.00603389   -.00603389
     nnet           12            1     -.041454     -.041454
     nnet           13            1    .00023742    .00023742

short-stacked weights across resamples for gender_r
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .23765236    .23765236
    logit            2    .08495041    .08495041
  lassocv            3   -.08921249   -.08921249
  ridgecv            4    .13607069    .13607069
  lassocv            5   -.00183092   -.00183092
  ridgecv            6    .14364675    .14364675
       rf            7    .50909503    .50909503
       rf            8    .06290599    .06290599
       rf            9   -.19565776   -.19565776
gradboost           10    .02323716    .02323716
gradboost           11    .20949408    .20949408
     nnet           12   -.53206717   -.53206717
     nnet           13   -.02478684   -.02478684

short-stacked weights across resamples for lnearn
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .03708453    .03708453
      ols            2            0   -.07029802   -.07029802
  lassocv            3            0   -.30844209   -.30844209
  ridgecv            4            0    .71601011    .71601011
  lassocv            5            0    .07212682    .07212682
  ridgecv            6            0   -.13590673   -.13590673
       rf            7            0     .9482513     .9482513
       rf            8            0   -.80975243   -.80975243
       rf            9            0    .49237887    .49237887
gradboost           10            0    .16209199    .16209199
gradboost           11            0    .01675363    .01675363
     nnet           12            0    -.0259464    -.0259464
     nnet           13            0    .00464089    .00464089
      ols            1            1    .00797422    .00797422
      ols            2            1   -.01074083   -.01074083
  lassocv            3            1   -.15384206   -.15384206
  ridgecv            4            1    .34200472    .34200472
  lassocv            5            1    .37976229    .37976229
  ridgecv            6            1   -.08057378   -.08057378
       rf            7            1    .62909495    .62909495
       rf            8            1   -.12169748   -.12169748
       rf            9            1     .0729043     .0729043
gradboost           10            1    .06358261    .06358261
gradboost           11            1   -.00603389   -.00603389
     nnet           12            1     -.041454     -.041454
     nnet           13            1    .00023742    .00023742

Y_lnearn_ss[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .03708453    .03708453
      ols            2            0   -.07029802   -.07029802
  lassocv            3            0   -.30844209   -.30844209
  ridgecv            4            0    .71601011    .71601011
  lassocv            5            0    .07212682    .07212682
  ridgecv            6            0   -.13590673   -.13590673
       rf            7            0     .9482513     .9482513
       rf            8            0   -.80975243   -.80975243
       rf            9            0    .49237887    .49237887
gradboost           10            0    .16209199    .16209199
gradboost           11            0    .01675363    .01675363
     nnet           12            0    -.0259464    -.0259464
     nnet           13            0    .00464089    .00464089
      ols            1            1    .00797422    .00797422
      ols            2            1   -.01074083   -.01074083
  lassocv            3            1   -.15384206   -.15384206
  ridgecv            4            1    .34200472    .34200472
  lassocv            5            1    .37976229    .37976229
  ridgecv            6            1   -.08057378   -.08057378
       rf            7            1    .62909495    .62909495
       rf            8            1   -.12169748   -.12169748
       rf            9            1     .0729043     .0729043
gradboost           10            1    .06358261    .06358261
gradboost           11            1   -.00603389   -.00603389
     nnet           12            1     -.041454     -.041454
     nnet           13            1    .00023742    .00023742

      +---------------------------------------------------------------------+
      | Y_lne~1_1   Y_lne~0_1   Y_lne~s1   Y_lnea~2   Y_lnear~3   Y_lnear~4 |
      |---------------------------------------------------------------------|
   1. | 2.7107712   3.0637782          1          0    .0370845    .0370845 |
   2. | 3.2100911   3.5897509          2          0    -.070298    -.070298 |
   3. | 3.0340205   3.1423455          3          0   -.3084421   -.3084421 |
   4. | 2.6577754   2.8347223          4          0    .7160101    .7160101 |
   5. | 3.3996588   3.4392281          5          0    .0721268    .0721268 |
      |---------------------------------------------------------------------|
   6. |  2.760687   2.9682507          6          0   -.1359067   -.1359067 |
   7. | 2.6082712   2.9541756          7          0    .9482513    .9482513 |
   8. | 2.8542522   2.9591117          8          0   -.8097524   -.8097524 |
      +---------------------------------------------------------------------+
(note: file out_36931/Y_lnearn_ss_ols_short_ia.dta not found)
file out_36931/Y_lnearn_ss_ols_short_ia.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .23765236    .23765236
    logit            2    .08495041    .08495041
  lassocv            3   -.08921249   -.08921249
  ridgecv            4    .13607069    .13607069
  lassocv            5   -.00183092   -.00183092
  ridgecv            6    .14364675    .14364675
       rf            7    .50909503    .50909503
       rf            8    .06290599    .06290599
       rf            9   -.19565776   -.19565776
gradboost           10    .02323716    .02323716
gradboost           11    .20949408    .20949408
     nnet           12   -.53206717   -.53206717
     nnet           13   -.02478684   -.02478684

short-stacked weights across resamples for lnearn
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .03708453    .03708453
      ols            2            0   -.07029802   -.07029802
  lassocv            3            0   -.30844209   -.30844209
  ridgecv            4            0    .71601011    .71601011
  lassocv            5            0    .07212682    .07212682
  ridgecv            6            0   -.13590673   -.13590673
       rf            7            0     .9482513     .9482513
       rf            8            0   -.80975243   -.80975243
       rf            9            0    .49237887    .49237887
gradboost           10            0    .16209199    .16209199
gradboost           11            0    .01675363    .01675363
     nnet           12            0    -.0259464    -.0259464
     nnet           13            0    .00464089    .00464089
      ols            1            1    .00797422    .00797422
      ols            2            1   -.01074083   -.01074083
  lassocv            3            1   -.15384206   -.15384206
  ridgecv            4            1    .34200472    .34200472
  lassocv            5            1    .37976229    .37976229
  ridgecv            6            1   -.08057378   -.08057378
       rf            7            1    .62909495    .62909495
       rf            8            1   -.12169748   -.12169748
       rf            9            1     .0729043     .0729043
gradboost           10            1    .06358261    .06358261
gradboost           11            1   -.00603389   -.00603389
     nnet           12            1     -.041454     -.041454
     nnet           13            1    .00023742    .00023742

D_gender_r_ss[13,3]
               learner  mean_weight        rep_1
    logit            1    .23765236    .23765236
    logit            2    .08495041    .08495041
  lassocv            3   -.08921249   -.08921249
  ridgecv            4    .13607069    .13607069
  lassocv            5   -.00183092   -.00183092
  ridgecv            6    .14364675    .14364675
       rf            7    .50909503    .50909503
       rf            8    .06290599    .06290599
       rf            9   -.19565776   -.19565776
gradboost           10    .02323716    .02323716
gradboost           11    .20949408    .20949408
     nnet           12   -.53206717   -.53206717
     nnet           13   -.02478684   -.02478684

      +-----------------------------------------------+
      | D_gende~_1   D_gen~s1   D_gende~2   D_gende~3 |
      |-----------------------------------------------|
   1. |  .53238053          1    .2376524    .2376524 |
   2. |  .11738255          2    .0849504    .0849504 |
   3. | -.16035245          3   -.0892125   -.0892125 |
   4. | -.12049734          4    .1360707    .1360707 |
   5. |  .31747941          5   -.0018309   -.0018309 |
      |-----------------------------------------------|
   6. |  .63296169          6    .1436467    .1436467 |
   7. |  .61517439          7     .509095     .509095 |
   8. |  .66272274          8     .062906     .062906 |
      +-----------------------------------------------+
(note: file out_36931/D_gender_r_ss_ols_short_ia.dta not found)
file out_36931/D_gender_r_ss_ols_short_ia.dta saved

pool-stacked weights across resamples for gender_r
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .21946715    .21946715
    logit            2     .0765847     .0765847
  lassocv            3    .24030171    .24030171
  ridgecv            4    .16761678    .16761678
  lassocv            5   -.12097327   -.12097327
  ridgecv            6   -.04509634   -.04509634
       rf            7      .414659      .414659
       rf            8    .10792395    .10792395
       rf            9   -.22695162   -.22695162
gradboost           10    .08603052    .08603052
gradboost           11    .13544545    .13544545
     nnet           12   -.00193758   -.00193758
     nnet           13    .01984618    .01984618

pool-stacked weights across resamples for lnearn
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0   -.00087514   -.00087514
      ols            2            0   -.02275814   -.02275814
  lassocv            3            0    .03377845    .03377845
  ridgecv            4            0    .45770363    .45770363
  lassocv            5            0   -.05395867   -.05395867
  ridgecv            6            0   -.02608338   -.02608338
       rf            7            0    .67820286    .67820286
       rf            8            0   -.17110165   -.17110165
       rf            9            0     .0509083     .0509083
gradboost           10            0     .0312948     .0312948
gradboost           11            0    .11256676    .11256676
     nnet           12            0    .00875376    .00875376
     nnet           13            0   -.00208708   -.00208708
      ols            1            1   -.01139586   -.01139586
      ols            2            1   -.00481434   -.00481434
  lassocv            3            1    .20372183    .20372183
  ridgecv            4            1    .24274056    .24274056
  lassocv            5            1    .03370694    .03370694
  ridgecv            6            1   -.02671403   -.02671403
       rf            7            1    .56230569    .56230569
       rf            8            1    .35254649    .35254649
       rf            9            1   -.30311991   -.30311991
gradboost           10            1   -.03125381   -.03125381
gradboost           11            1    .05146063    .05146063
     nnet           12            1    .01134396    .01134396
     nnet           13            1   -.00016466   -.00016466

pool-stacked weights across resamples for gender_r
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .21946715    .21946715
    logit            2     .0765847     .0765847
  lassocv            3    .24030171    .24030171
  ridgecv            4    .16761678    .16761678
  lassocv            5   -.12097327   -.12097327
  ridgecv            6   -.04509634   -.04509634
       rf            7      .414659      .414659
       rf            8    .10792395    .10792395
       rf            9   -.22695162   -.22695162
gradboost           10    .08603052    .08603052
gradboost           11    .13544545    .13544545
     nnet           12   -.00193758   -.00193758
     nnet           13    .01984618    .01984618

pool-stacked weights across resamples for lnearn
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0   -.00087514   -.00087514
      ols            2            0   -.02275814   -.02275814
  lassocv            3            0    .03377845    .03377845
  ridgecv            4            0    .45770363    .45770363
  lassocv            5            0   -.05395867   -.05395867
  ridgecv            6            0   -.02608338   -.02608338
       rf            7            0    .67820286    .67820286
       rf            8            0   -.17110165   -.17110165
       rf            9            0     .0509083     .0509083
gradboost           10            0     .0312948     .0312948
gradboost           11            0    .11256676    .11256676
     nnet           12            0    .00875376    .00875376
     nnet           13            0   -.00208708   -.00208708
      ols            1            1   -.01139586   -.01139586
      ols            2            1   -.00481434   -.00481434
  lassocv            3            1    .20372183    .20372183
  ridgecv            4            1    .24274056    .24274056
  lassocv            5            1    .03370694    .03370694
  ridgecv            6            1   -.02671403   -.02671403
       rf            7            1    .56230569    .56230569
       rf            8            1    .35254649    .35254649
       rf            9            1   -.30311991   -.30311991
gradboost           10            1   -.03125381   -.03125381
gradboost           11            1    .05146063    .05146063
     nnet           12            1    .01134396    .01134396
     nnet           13            1   -.00016466   -.00016466

Y_lnearn_ps[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0   -.00087514   -.00087514
      ols            2            0   -.02275814   -.02275814
  lassocv            3            0    .03377845    .03377845
  ridgecv            4            0    .45770363    .45770363
  lassocv            5            0   -.05395867   -.05395867
  ridgecv            6            0   -.02608338   -.02608338
       rf            7            0    .67820286    .67820286
       rf            8            0   -.17110165   -.17110165
       rf            9            0     .0509083     .0509083
gradboost           10            0     .0312948     .0312948
gradboost           11            0    .11256676    .11256676
     nnet           12            0    .00875376    .00875376
     nnet           13            0   -.00208708   -.00208708
      ols            1            1   -.01139586   -.01139586
      ols            2            1   -.00481434   -.00481434
  lassocv            3            1    .20372183    .20372183
  ridgecv            4            1    .24274056    .24274056
  lassocv            5            1    .03370694    .03370694
  ridgecv            6            1   -.02671403   -.02671403
       rf            7            1    .56230569    .56230569
       rf            8            1    .35254649    .35254649
       rf            9            1   -.30311991   -.30311991
gradboost           10            1   -.03125381   -.03125381
gradboost           11            1    .05146063    .05146063
     nnet           12            1    .01134396    .01134396
     nnet           13            1   -.00016466   -.00016466

      +---------------------------------------------------------------------+
      | Y_lne~1_1   Y_lne~0_1   Y_lne~s1   Y_lnea~2   Y_lnear~3   Y_lnear~4 |
      |---------------------------------------------------------------------|
   1. | 2.7185594   3.0496613          1          0   -.0008751   -.0008751 |
   2. | 3.1978926   3.5615143          2          0   -.0227581   -.0227581 |
   3. | 3.0211528   3.1298225          3          0    .0337785    .0337785 |
   4. | 2.6713313    2.899106          4          0    .4577036    .4577036 |
   5. | 3.4047459   3.4385521          5          0   -.0539587   -.0539587 |
      |---------------------------------------------------------------------|
   6. | 2.7640569   2.9741097          6          0   -.0260834   -.0260834 |
   7. | 2.5476822   2.8953973          7          0    .6782029    .6782029 |
   8. | 2.8413393   2.9689921          8          0   -.1711017   -.1711017 |
      +---------------------------------------------------------------------+
(note: file out_36931/Y_lnearn_ps_ols_pooled_ia.dta not found)
file out_36931/Y_lnearn_ps_ols_pooled_ia.dta saved

pool-stacked weights across resamples for gender_r
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .21946715    .21946715
    logit            2     .0765847     .0765847
  lassocv            3    .24030171    .24030171
  ridgecv            4    .16761678    .16761678
  lassocv            5   -.12097327   -.12097327
  ridgecv            6   -.04509634   -.04509634
       rf            7      .414659      .414659
       rf            8    .10792395    .10792395
       rf            9   -.22695162   -.22695162
gradboost           10    .08603052    .08603052
gradboost           11    .13544545    .13544545
     nnet           12   -.00193758   -.00193758
     nnet           13    .01984618    .01984618

pool-stacked weights across resamples for lnearn
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0   -.00087514   -.00087514
      ols            2            0   -.02275814   -.02275814
  lassocv            3            0    .03377845    .03377845
  ridgecv            4            0    .45770363    .45770363
  lassocv            5            0   -.05395867   -.05395867
  ridgecv            6            0   -.02608338   -.02608338
       rf            7            0    .67820286    .67820286
       rf            8            0   -.17110165   -.17110165
       rf            9            0     .0509083     .0509083
gradboost           10            0     .0312948     .0312948
gradboost           11            0    .11256676    .11256676
     nnet           12            0    .00875376    .00875376
     nnet           13            0   -.00208708   -.00208708
      ols            1            1   -.01139586   -.01139586
      ols            2            1   -.00481434   -.00481434
  lassocv            3            1    .20372183    .20372183
  ridgecv            4            1    .24274056    .24274056
  lassocv            5            1    .03370694    .03370694
  ridgecv            6            1   -.02671403   -.02671403
       rf            7            1    .56230569    .56230569
       rf            8            1    .35254649    .35254649
       rf            9            1   -.30311991   -.30311991
gradboost           10            1   -.03125381   -.03125381
gradboost           11            1    .05146063    .05146063
     nnet           12            1    .01134396    .01134396
     nnet           13            1   -.00016466   -.00016466

D_gender_r_ps[13,3]
               learner  mean_weight        rep_1
    logit            1    .21946715    .21946715
    logit            2     .0765847     .0765847
  lassocv            3    .24030171    .24030171
  ridgecv            4    .16761678    .16761678
  lassocv            5   -.12097327   -.12097327
  ridgecv            6   -.04509634   -.04509634
       rf            7      .414659      .414659
       rf            8    .10792395    .10792395
       rf            9   -.22695162   -.22695162
gradboost           10    .08603052    .08603052
gradboost           11    .13544545    .13544545
     nnet           12   -.00193758   -.00193758
     nnet           13    .01984618    .01984618

      +----------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gende~2   D_gende~3 |
      |----------------------------------------------|
   1. |  .8057192          1    .2194671    .2194671 |
   2. | .42425889          2    .0765847    .0765847 |
   3. | .10735347          3    .2403017    .2403017 |
   4. | .18713539          4    .1676168    .1676168 |
   5. | .61705646          5   -.1209733   -.1209733 |
      |----------------------------------------------|
   6. | .89914603          6   -.0450963   -.0450963 |
   7. | .88492259          7     .414659     .414659 |
   8. | .93907834          8     .107924     .107924 |
      +----------------------------------------------+
(note: file out_36931/D_gender_r_ps_ols_pooled_ia.dta not found)
file out_36931/D_gender_r_ps_ols_pooled_ia.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.101    (0.016)
  ss  1  [shortstack]          [ss]          [ss]    -0.101    (0.016)
  ps  1   [poolstack]          [ps]          [ps]    -0.101    (0.016)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1013125   .0155024    -6.54   0.000    -.1316968   -.0709283
------------------------------------------------------------------------------
Stacking final estimator: avg



Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.101    (0.016)
  ss  1  [shortstack]          [ss]          [ss]    -0.101    (0.016)
  ps  1   [poolstack]          [ps]          [ps]    -0.101    (0.016)

Stacking DDML model (ATET)
E[y|X,D=0]   = Y1_pystacked0_1                     Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1
E[D|X]       = D1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1013125   .0155024    -6.54   0.000    -.1316968   -.0709283
------------------------------------------------------------------------------
Stacking final estimator: avg

(note: variable final was str3, now str10 to accommodate using data's values)
file out_36931/results.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  ss  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.101    (0.016)
  ss  1  [shortstack]          [ss]          [ss]    -0.101    (0.016)
  ps  1   [poolstack]          [ps]          [ps]    -0.101    (0.016)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1013125   .0155024    -6.54   0.000    -.1316968   -.0709283
------------------------------------------------------------------------------
Stacking final estimator: avg

(note: variable final was str3, now str10 to accommodate using data's values)
file out_36931/results.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  ps  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.101    (0.016)
  ss  1  [shortstack]          [ss]          [ss]    -0.101    (0.016)
  ps  1   [poolstack]          [ps]          [ps]    -0.101    (0.016)

Poolstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ps0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ps1
E[D|X]       = D_gender_r_ps_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1013125   .0155024    -6.54   0.000    -.1316968   -.0709283
------------------------------------------------------------------------------
Stacking final estimator: avg

(note: variable final was str3, now str10 to accommodate using data's values)
file out_36931/results.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

Y1_pystacked_w_mn[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

      +-------------------------------------------+
      | Y1_pys~1   Y1_pys~2   Y1_pys~3   Y1_pys~4 |
      |-------------------------------------------|
   1. |        1          0   .0769231   .0769231 |
   2. |        2          0   .0769231   .0769231 |
   3. |        3          0   .0769231   .0769231 |
   4. |        4          0   .0769231   .0769231 |
   5. |        5          0   .0769231   .0769231 |
      |-------------------------------------------|
   6. |        6          0   .0769231   .0769231 |
   7. |        7          0   .0769231   .0769231 |
   8. |        8          0   .0769231   .0769231 |
      +-------------------------------------------+
(note: file out_36931/Y1_pystacked_w_mn_avg_regular_ia.dta not found)
file out_36931/Y1_pystacked_w_mn_avg_regular_ia.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

D1_pystacked_w_mn[13,3]
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

      +--------------------------------+
      | D1_pys~1   D1_pys~2   D1_pys~3 |
      |--------------------------------|
   1. |        1   .0769231   .0769231 |
   2. |        2   .0769231   .0769231 |
   3. |        3   .0769231   .0769231 |
   4. |        4   .0769231   .0769231 |
   5. |        5   .0769231   .0769231 |
      |--------------------------------|
   6. |        6   .0769231   .0769231 |
   7. |        7   .0769231   .0769231 |
   8. |        8   .0769231   .0769231 |
      +--------------------------------+
(note: file out_36931/D1_pystacked_w_mn_avg_regular_ia.dta not found)
file out_36931/D1_pystacked_w_mn_avg_regular_ia.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

short-stacked weights across resamples for lnearn
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

short-stacked weights across resamples for gender_r
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

short-stacked weights across resamples for lnearn
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

Y_lnearn_ss[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

      +-------------------------------------------------------------------+
      | Y_lne~1_1   Y_lne~0_1   Y_lne~s1   Y_lnea~2   Y_lnea~3   Y_lnea~4 |
      |-------------------------------------------------------------------|
   1. | 2.6044655   2.7371709          1          0   .0769231   .0769231 |
   2. | 3.0148881   3.2227879          2          0   .0769231   .0769231 |
   3. | 2.7158783   2.8536283          3          0   .0769231   .0769231 |
   4. | 2.4794838   2.6236015          4          0   .0769231   .0769231 |
   5. | 3.0787312   3.1579002          5          0   .0769231   .0769231 |
      |-------------------------------------------------------------------|
   6. | 2.6266718   2.6523775          6          0   .0769231   .0769231 |
   7. | 2.4496785   2.4308292          7          0   .0769231   .0769231 |
   8. | 2.6469145   2.7845245          8          0   .0769231   .0769231 |
      +-------------------------------------------------------------------+
(note: file out_36931/Y_lnearn_ss_avg_short_ia.dta not found)
file out_36931/Y_lnearn_ss_avg_short_ia.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

short-stacked weights across resamples for lnearn
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

D_gender_r_ss[13,3]
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .71812375          1   .0769231   .0769231 |
   2. | .42230164          2   .0769231   .0769231 |
   3. | .18102445          3   .0769231   .0769231 |
   4. |  .3277331          4   .0769231   .0769231 |
   5. | .58264174          5   .0769231   .0769231 |
      |--------------------------------------------|
   6. | .77064336          6   .0769231   .0769231 |
   7. | .76215397          7   .0769231   .0769231 |
   8. | .80706954          8   .0769231   .0769231 |
      +--------------------------------------------+
(note: file out_36931/D_gender_r_ss_avg_short_ia.dta not found)
file out_36931/D_gender_r_ss_avg_short_ia.dta saved

pool-stacked weights across resamples for gender_r
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

pool-stacked weights across resamples for lnearn
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

pool-stacked weights across resamples for gender_r
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

pool-stacked weights across resamples for lnearn
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

Y_lnearn_ps[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

      +-------------------------------------------------------------------+
      | Y_lne~1_1   Y_lne~0_1   Y_lne~s1   Y_lnea~2   Y_lnea~3   Y_lnea~4 |
      |-------------------------------------------------------------------|
   1. | 2.6044655   2.7371709          1          0   .0769231   .0769231 |
   2. | 3.0148881   3.2227879          2          0   .0769231   .0769231 |
   3. | 2.7158783   2.8536283          3          0   .0769231   .0769231 |
   4. | 2.4794838   2.6236015          4          0   .0769231   .0769231 |
   5. | 3.0787312   3.1579002          5          0   .0769231   .0769231 |
      |-------------------------------------------------------------------|
   6. | 2.6266718   2.6523775          6          0   .0769231   .0769231 |
   7. | 2.4496785   2.4308292          7          0   .0769231   .0769231 |
   8. | 2.6469145   2.7845245          8          0   .0769231   .0769231 |
      +-------------------------------------------------------------------+
(note: file out_36931/Y_lnearn_ps_avg_pooled_ia.dta not found)
file out_36931/Y_lnearn_ps_avg_pooled_ia.dta saved

pool-stacked weights across resamples for gender_r
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

pool-stacked weights across resamples for lnearn
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

D_gender_r_ps[13,3]
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .71812375          1   .0769231   .0769231 |
   2. | .42230164          2   .0769231   .0769231 |
   3. | .18102445          3   .0769231   .0769231 |
   4. |  .3277331          4   .0769231   .0769231 |
   5. | .58264174          5   .0769231   .0769231 |
      |--------------------------------------------|
   6. | .77064336          6   .0769231   .0769231 |
   7. | .76215397          7   .0769231   .0769231 |
   8. | .80706954          8   .0769231   .0769231 |
      +--------------------------------------------+
(note: file out_36931/D_gender_r_ps_avg_pooled_ia.dta not found)
file out_36931/D_gender_r_ps_avg_pooled_ia.dta saved
. 
.         forvalues i = 1(1)$L {
  2.                         ddml estimate, y1(Y1_pystacked1_L`i'_1) y0(Y1_pyst
> acked0_L`i'_1) ///
>                                                         d(D1_pystacked_L`i'_1
> ) robust atet foldvar(m0_sample_1  )
  3.                         regsave gender_r using `folder'/results.dta, ci //
> /
>                                                 addlabel(model,interactive,se
> ed,`seed',final,indiv,learner,`i') ///
>                                                 append
  4.         }

E[y|X,D=0]   = Y1_pystacked0_L1_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L1_1
E[D|X]       = D1_pystacked_L1_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1557579   .0776713    -2.01   0.045    -.3079908    -.003525
------------------------------------------------------------------------------
Warning: 133 propensity scores trimmed to lower limit ..
Warning: 37 propensity scores trimmed to upper limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_36931/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L2_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L2_1
E[D|X]       = D1_pystacked_L2_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1215992   .0161258    -7.54   0.000    -.1532052   -.0899931
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_36931/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L3_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L3_1
E[D|X]       = D1_pystacked_L3_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0785731   .0333067    -2.36   0.018     -.143853   -.0132932
------------------------------------------------------------------------------
Warning: 77 propensity scores trimmed to lower limit ..
Warning: 14 propensity scores trimmed to upper limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_36931/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L4_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L4_1
E[D|X]       = D1_pystacked_L4_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0811591   .0624197    -1.30   0.194    -.2034995    .0411812
------------------------------------------------------------------------------
Warning: 83 propensity scores trimmed to lower limit ..
Warning: 23 propensity scores trimmed to upper limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_36931/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L5_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L5_1
E[D|X]       = D1_pystacked_L5_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0798712   .0327394    -2.44   0.015    -.1440393   -.0157031
------------------------------------------------------------------------------
Warning: 70 propensity scores trimmed to lower limit ..
Warning: 14 propensity scores trimmed to upper limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_36931/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L6_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L6_1
E[D|X]       = D1_pystacked_L6_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |   -.286747   .1887971    -1.52   0.129    -.6567825    .0832885
------------------------------------------------------------------------------
Warning: 73 propensity scores trimmed to lower limit ..
Warning: 15 propensity scores trimmed to upper limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_36931/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L7_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L7_1
E[D|X]       = D1_pystacked_L7_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0824093   .0177707    -4.64   0.000    -.1172391   -.0475795
------------------------------------------------------------------------------
Warning: 1 propensity scores trimmed to lower limit ..
Warning: 3 propensity scores trimmed to upper limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_36931/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L8_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L8_1
E[D|X]       = D1_pystacked_L8_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1049477    .015172    -6.92   0.000    -.1346842   -.0752112
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_36931/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L9_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L9_1
E[D|X]       = D1_pystacked_L9_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1096692    .014773    -7.42   0.000    -.1386237   -.0807147
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_36931/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L10_1                 Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L10_1
E[D|X]       = D1_pystacked_L10_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0762569    .017922    -4.25   0.000    -.1113834   -.0411305
------------------------------------------------------------------------------
Warning: 1 propensity scores trimmed to lower limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_36931/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L11_1                 Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L11_1
E[D|X]       = D1_pystacked_L11_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0434785   .0357973    -1.21   0.225    -.1136398    .0266828
------------------------------------------------------------------------------
Warning: 96 propensity scores trimmed to lower limit ..
Warning: 23 propensity scores trimmed to upper limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_36931/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L12_1                 Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L12_1
E[D|X]       = D1_pystacked_L12_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1288699   .0161342    -7.99   0.000    -.1604924   -.0972474
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_36931/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L13_1                 Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L13_1
E[D|X]       = D1_pystacked_L13_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |   .2603958   .2524634     1.03   0.302    -.2344233    .7552149
------------------------------------------------------------------------------
Warning: 196 propensity scores trimmed to lower limit ..
Warning: 158 propensity scores trimmed to upper limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_36931/results.dta saved
. 
. }       

.         
. *****************************************************************************
> *  
. *** interactive NX: short-stacking                                           
>                                       ***
. *****************************************************************************
> *
. 
. if (`estimator'==3) {
. 
. gen one = 1     
. 
.         cap drop y0base*
.         cap drop dbase*
.         cap drop y1base*
. 
.         *** no cross-fitting
.         pystacked lnearn $X_expanded   $pystring_reg0  if gender_r == 0, type
> (reg) njobs($cores)  
.                 mat nxw_ia_y0 = e(weights)
.                 mat list nxw_ia_y0
.                                 preserve
.                                 svmat nxw_ia_y0
.                                 keep nxw_ia_y0*
.                                 save `folder'/nxw_ia_y0, replace
.                                 restore
.         predict y0base0, xb
.         predict y0base, base
. 
.         pystacked lnearn $X_expanded  $pystring_reg0 if gender_r == 1  , type
> (reg) njobs($cores)  
.                 mat nxw_ia_y1 = e(weights)
.                 mat list nxw_ia_y1
.                                 preserve
.                                 svmat nxw_ia_y1
.                                 keep nxw_ia_y1*
.                                 save `folder'/nxw_ia_y1, replace
.                                 restore
.         predict y1base0, xb
.         predict y1base, base
. 
.         pystacked gender_r $X_expanded $pystring_class  
.                 mat nxw_ia_d = e(weights)
.                 mat list nxw_ia_d
.                                 preserve
.                                 svmat nxw_ia_d
.                                 keep nxw_ia_d*
.                                 save `folder'/nxw_ia_d, replace
.                                 restore         
.         predict dbase0, pr
.         predict dbase, base pr
.         
.         forvalues i = 0(1)$L {
  2.                         _estimate_ate interactive, yname(lnearn) dname(gen
> der_r) ///
>                                                 y0(y0base`i') y1(y1base`i') d
> (dbase`i') ///
>                                                 atet foldid(one) robust model
> (interactive)
  3.                         regsave gender_r using `folder'/results.dta, ///
>                                                 ci addlabel(model,nxinter,see
> d,`seed',final,nx,learner,`i') append
  4.         }
.                 
. }

.         
. *****************************************************************************
> *  
. *** partial NX: short-stacking                                               
>                                       ***
. *****************************************************************************
> *
. 
. if (`estimator'==4) {
.         
. cap gen one = 1 
. 
.         cap drop Ybase* 
.         cap drop Dbase*
. 
.         *** no cross-fitting
.         pystacked lnearn $X_expanded $pystring_reg 
.                 mat nxw_y = e(weights)
.                 mat list nxw_y
.                                 preserve
.                                 svmat nxw_y
.                                 keep nxw_y*
.                                 save `folder'/nxw_y, replace
.                                 restore
.         predict Ybase0
.         predict Ybase, basexb
. 
.         pystacked gender_r $X_expanded $pystring_reg 
.                 mat nxw_d = e(weights)
.                 mat list nxw_d
.                                 preserve
.                                 svmat nxw_d
.                                 keep nxw_d*
.                                 save `folder'/nxw_d, replace
.                                 restore         
.         predict Dbase0
.         predict Dbase, basexb
. 
.         forvalues i = 0(1)$L {
  2.                 cap drop Ytil
  3.                 cap drop Dtil
  4.                 gen Ytil = lnearn - Ybase`i'
  5.                 gen Dtil = gender_r - Dbase`i'
  6.                 reg Ytil Dtil, robust
  7.                 regsave Dtil using `folder'/results.dta, ///
>                         ci addlabel(model,nxpartial,seed,`seed',final,nx,lear
> ner,`i') append
  8.         }
. 
. }

.         
. cap log close
