-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /cluster/home/kahrens/ddml_applied/GWG/Output/GWG_3928_2.txt
  log type:  text
 opened on:  10 Dec 2023, 19:14:53

. 
. which ddml
/cluster/home/kahrens/ado/plus/d/ddml.ado
*! ddml v1.4.3
*! last edited: 17aug2023
*! authors: aa/ms

. which pystacked
/cluster/home/kahrens/ado/plus/p/pystacked.ado
*! pystacked v0.7.5
*! last edited: 7aug2023
*! authors: aa/ms

. 
. set seed `seed'

. local folder out_`seed'

. 
. use "../Data/gender_gap_ML_processed", clear

. 
. cap mkdir `folder'

. 
. *****************************************************************************
> ***
. ***  controls
. *****************************************************************************
> ***
. 
. // create squared age and tenure here
. gen age_r2 = age_r^2

. gen tenure2 = tenure^2
(2 missing values generated)

. 
. // no base categories
. global continuous                                                            
>                                                            ///
>         age_r                                                                
>                                                                    /// no mis
> sing
>         yrsqual         /* years of education (derived) */                   
>                                    /// 355 missing
>         /// leavedu             /* age when left education (derived) */      
>                            /// 1,081 missing
>         pvlit1          /* literacy score: plausible value 1 (also 2-10 avail
> ) */       /// no missing
>         pvnum1          /* numeracy score: plausible value 1 (also 2-10 avail
> ) */       /// no missing
>         tenure          /* tenure = years in work for current employer */    
>                    /// 2 missing
>                                                                              
>                                                                            //

. // add second order terms here
. global continuous $continuous age_r2 tenure2

. 
. global discrete0                                                             
>                                                            ///             
>         b_q01a          /* education, highest level attained */              
>                            /// no missing
>         b_q01b          /* area of study */                                  
>                                                    /// 434 missing
>         d_q06c          /* part of a larger organization */                  
>                                    /// 13 missing
>         d_q08a          /* management position */                            
>                                            /// no missing
>         d_q09           /* type of contract */                               
>                                            /// 12 missing
>         d_q10_t1        /* hours per week at this job or business */         
>                    /// 1 missing
>         d_q14           /* job satisfaction */                               
>                                            /// 1 missing
>         i_q08           /* health status */                                  
>                                                    /// 2 missing
>         j_q02a          /* living with a partner */                          
>                                            /// 899 missing
>         j_q03d1_c       /* age of youngest child */                          
>                                            /// 2,718 missing
>         j_q04c1_c       /* immigration: age */                               
>                                            /// 4,375 missing
>         j_q06b          /* mother's highest level of educ */                 
>                            /// 445 missing
>         j_q07b          /* father's highest level of educ */                 
>                            /// 515 missing
>         j_q03b          /* number of children*/                              
>                                            /// 1,856 missing
>         impar           /* immigration: parents */                           
>                                            /// 21 missing
>         imgen           /* immigration: generation */                        
>                                    /// 344 missing
>         nfe12jr         /* informal job-related educ in prev 12 months */    
>                    /// 116 missing
>         nfe12njr        /* informal non-job-related educ in prev 12 months */
>            /// 116 missing
>                                                                              
>                                                                            //
>                                                                              
>                                                          

. global personality                                                           
>                                                            ///
>         i_q04b          /* Learning strategies, Relate new ideas into real li
> fe */      /// 16 missing
>         i_q04d          /* Learning strategies, Like learning new things */  
>                    /// no missing
>         i_q04h          /* Learning strategies, Attribute something new */   
>                    /// 10 missing
>         i_q04j          /* Learning strategies, Deal with difficult things */
>            /// no missing
>         i_q04l          /* Learning strategies, Fit different ideas together 
> */         /// 5 missing
>         i_q04m          /* Learning strategies, Looking for additional info *
> /          /// 1 missing
>         i_q05f          /* Cultural engagement, Voluntary non-profit work */ 
>            /// no missing
>         i_q06a          /* Political efficacy, No influence on the government
>  */        /// 14 missing
>         i_q07a          /* Social trust, Trust only few people */            
>                            /// 4 missing
>         i_q07b          /* Social trust, Other people take advantage of you *
> /          /// 6 missing
>                                                                              
>                                                                            //

. global discrete $discrete0                                                   
>                                                    ///
>         new_reg_tl2     /* geographical region */                            
>                                            /// 2 missing
>         new_isco1c      /* occupation */                                     
>                                                    /// no missing
>         new_isic1c      /* industry */                                       
>                                                    // no missing

. 
. global X_simple                                                         ///
>         i.(b_q01a d_q10_t1 j_q03b)                              ///
>         c.($continuous)

. 
. global X_fullinteracted                                         ///
>         i.($discrete0 )                                                 ///
>         i.new_isco1c#i.new_isic1c#i.new_reg_tl2 ///
>         c.($continuous)                  

.         
. global X_cont                                                           ///
>         c.($continuous)##i.($discrete)

. 
. global X_expanded                                                       ///
>         i.($discrete)                                                   ///
>         c.($continuous)                                                 ///
>         c.age_r#i.($discrete)                                   ///
>         c.tenure#i.($discrete)

. 
.         
. 
. *****************************************************************************
> ***
. ***  estimation sample
. *****************************************************************************
> ***
. 
. gen byte touse=1

. markout touse lnearn $X_expanded

. keep if touse
(53 observations deleted)

. 
. 
. *****************************************************************************
> ***
. ***  learners
. *****************************************************************************
> ***
. 
. global cores = 5

. 
. global rf1 min_samples_leaf(1)  max_features(sqrt) n_estimators(500)

. global rf2 min_samples_leaf(50)  max_features(sqrt) n_estimators(500)

. global rf3 min_samples_leaf(100)  max_features(sqrt) n_estimators(500)

. global grad1 n_estimators(500) n_iter_no_change(10)  

. global grad2 n_estimators(500)  

. global nnet1 hidden_layer_sizes(40 20 1 20 50) early_stopping 

. global nnet2 hidden_layer_sizes(30 30 30) early_stopping  

. 
. global pystring_reg0                                                         
>    || ///
>                                         m(ols)                               
>                            || ///
>                                         m(ols) xvars($X_simple)              
>            || ///
>                                         m(lassocv)                           
>                            || ///
>                                         m(ridgecv)                           
>                            || ///
>                                         m(lassocv)      xvars($X_cont)       
>            || ///
>                                         m(ridgecv)      xvars($X_cont)       
>            || ///
>                                         m(rf) opt($rf1)                      
>                    || ///
>                                         m(rf) opt($rf2)                      
>                    || ///
>                                         m(rf) opt($rf3)                      
>                    || ///
>                                         m(gradboost) opt($grad1)             
>            || ///
>                                         m(gradboost) opt($grad2)             
>            || ///
>                                         m(nnet) opt($nnet1)                  
>            || ///
>                                         m(nnet) opt($nnet2)                  
>            || //

. 
. global pystring_reg  $pystring_reg0 , type(reg) njobs($cores) 

.  
. global pystring_class0                                                       
>            || ///
>                                         m(logit)                             
>                            || ///
>                                         m(logit) xvars($X_simple)            
>            || ///
>                                         m(lassocv)                           
>                            || ///
>                                         m(ridgecv)                           
>                            || ///
>                                         m(lassocv)      xvars($X_cont)       
>            || ///
>                                         m(ridgecv)      xvars($X_cont)       
>            || ///
>                                         m(rf) opt($rf1)                      
>                    || ///
>                                         m(rf) opt($rf2)                      
>                    || ///
>                                         m(rf) opt($rf3)                      
>                    || ///
>                                         m(gradboost) opt($grad1)             
>            || ///
>                                         m(gradboost) opt($grad2)             
>            || ///
>                                         m(nnet) opt($nnet1)                  
>            || ///
>                                         m(nnet) opt($nnet2)                  
>            || //                   

.                                 
. global pystring_class $pystring_class0 , type(class) njobs($cores)

.                                         
. global R =1  

. global K=10 

. global L =13

.         
. *****************************************************************************
> *  
. *** ddml: estimation                                                         
>                                               ***
. *****************************************************************************
> *
. 
. if (`estimator'==1) {
. 
.         ddml init partial,  reps($R) kfolds($K)
.         ddml E[Y|X]: pystacked lnearn $X_expanded $pystring_reg
.         ddml E[D|X]: pystacked gender_r $X_expanded $pystring_reg
.         ddml crossfit, shortstack poolstack
.         ddml estimate, robust
.         
.         foreach mat in lnearn_mse gender_r_mse {
  2.                         ddml extract, show(mse)
  3.                         mat `mat' = r(`mat')
  4.                         mat list `mat'
  5.                                 preserve
  6.                                 svmat `mat'
  7.                                 keep `mat'*
  8.                                 keep if _n<=$L
  9.                                 gen stack_type = "conventional" if _n==1
 10.                                 replace stack_type = "pooled" if _n==2
 11.                                 replace stack_type = "short" if _n==3
 12.                                 gen model = "plm"
 13.                                 list if _n<=$L
 14.                                 save `folder'/`mat'_plm_mse, replace
 15.                                 restore 
 16.         }       
. 
.         cap drop mse_*
.         foreach var of varlist Y1_* {
  2.                  cap drop sqerr_`var'
  3.                  gen double sqerr_`var'=(lnearn-`var')^2
  4.                  sum sqerr_`var', meanonly
  5.                  gen double mse_`var'=r(mean) if _n ==1 
  6.         }
.         foreach var of varlist D1_* {
  2.                  cap drop sqerr_`var'
  3.                  gen double sqerr_`var'=(gender_r-`var')^2
  4.                  sum sqerr_`var', meanonly
  5.                  gen double mse_`var'=r(mean) if _n ==1 
  6.         }
.         preserve
.                 keep mse_*
.                 keep if _n==1
.                 save `folder'/plm_mse, replace
.         restore
.         cap drop mse_*
. 
.         ** initialize results file
.         regsave gender_r using `folder'/results.dta, ci addlabel(model,partia
> l,seed,`seed',final,init,learner,-99) replace
. 
.         foreach final in nnls1 singlebest ols avg {
  2. 
.                 ddml estimate, robust finalest(`final')
  3.         
.                         // regular stacking results
.                         ddml estimate, mname(m0) spec(st) replay  
  4.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,partial,seed,`seed',final,`final',learner,-1) append
  5.                         
.                         // shortstacking results
.                         ddml estimate, mname(m0) spec(ss) replay 
  6.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,partial,seed,`seed',final,`final',learner,-2) append
  7.                         
.                         // poolstacking results
.                         ddml estimate, mname(m0) spec(ps) replay  
  8.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,partial,seed,`seed',final,`final',learner,-3) append     
  9.                 
.                         // pystacked weights
.                         ddml extract, show(stweights)   
 10.                         foreach mat in Y1_pystacked_w_mn D1_pystacked_w_mn
>  {
 11.                                         ddml extract, show(stweights)   
 12.                                         mat `mat' = r(`mat')
 13.                                         mat list `mat'
 14.                                                 preserve
 15.                                                 svmat `mat'
 16.                                                 keep `mat'*
 17.                                                 list if _n<=4
 18.                                                 save `folder'/`mat'_`final
> '_regular, replace
 19.                                                 restore
 20.                         }       
 21.                         // shortstacked weights
.                         ddml extract, show(ssweights)
 22.                         foreach mat in Y_lnearn_ss D_gender_r_ss {
 23.                                         qui ddml extract, show(ssweights)
 24.                                         mat `mat' = r(`mat')
 25.                                         mat list `mat'
 26.                                                 preserve
 27.                                                 svmat `mat'
 28.                                                 keep `mat'*
 29.                                                 list if _n<=4
 30.                                                 save `folder'/`mat'_`final
> '_short, replace
 31.                                                 restore
 32.                         }       
 33.                         // poolstacked weights
. 
.                         foreach mat in Y_lnearn_ps D_gender_r_ps {
 34.                                         qui ddml extract, show(psweights)
 35.                                         mat `mat' = r(`mat')
 36.                                         mat list `mat'
 37.                                                 preserve
 38.                                                 svmat `mat'
 39.                                                 keep `mat'*
 40.                                                 list if _n<=4
 41.                                                 save `folder'/`mat'_`final
> '_pooled, replace
 42.                                                 restore
 43.                         }       
 44.         
.         }
. 
.         forvalues i = 1(1)$L {
  2.                         ddml estimate, y(Y1_pystacked_L`i'_1) ///
>                                                         d(D1_pystacked_L`i'_1
> ) robust
  3.                         regsave gender_r using `folder'/results.dta, ci //
> /
>                                                 addlabel(model,partial,seed,`
> seed',final,indiv,learner,`i') ///
>                                                 append
  4.         }
. 
. }

.         
. *****************************************************************************
> *  
. *** interactive: estimation                                                  
>                                       ***
. *****************************************************************************
> *
.         
. if (`estimator'==2) {   
. 
.         ddml init interactive, kfolds($K) reps($R)
.         ddml E[Y|X,D]: pystacked lnearn $X_expanded $pystring_reg
Learner Y1_pystacked added successfully.
.         ddml E[D|X]: pystacked gender_r $X_expanded $pystring_class
Learner D1_pystacked added successfully.
.         ddml crossfit, shortstack poolstack
Cross-fitting E[y|X,D] equation: lnearn
Cross-fitting fold 1 2 3 4 5 6 7 8 9 10 ...completed cross-fitting...completed 
> short-stacking...completed pooled-stacking
Cross-fitting E[D|X] equation: gender_r
Cross-fitting fold 1 2 3 4 5 6 7 8 9 10 ...completed cross-fitting...completed 
> short-stacking...completed pooled-stacking
.         ddml estimate, robust atet


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.072    (0.027)
  ss  1  [shortstack]          [ss]          [ss]    -0.072    (0.027)
  ps  1   [poolstack]          [ps]          [ps]    -0.073    (0.027)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0723916    .026617    -2.72   0.007    -.1245599   -.0202232
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 7 propensity scores trimmed to lower limit .01.

. 
.         cap drop mse_*
.         foreach var of varlist Y1_pystacked0* {
  2.                  cap drop sqerr_`var'
  3.                  gen double sqerr_`var'=(lnearn-`var')^2 if gender_r==0
  4.                  sum sqerr_`var' if gender_r==0, meanonly
  5.                  gen double mse_`var'=r(mean) if _n ==1 
  6.         }
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
.         foreach var of varlist Y1_pystacked1* {
  2.                  cap drop sqerr_`var'
  3.                  gen double sqerr_`var'=(lnearn-`var')^2 if gender_r==1
  4.                  sum sqerr_`var' if gender_r==1, meanonly
  5.                  gen double mse_`var'=r(mean) if _n ==1 
  6.         }
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
.         foreach var of varlist D1_* {
  2.                  cap drop sqerr_`var'
  3.                  gen double sqerr_`var'=(gender_r-`var')^2
  4.                  sum sqerr_`var', meanonly
  5.                  gen double mse_`var'=r(mean) if _n ==1 
  6.         }
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
.         preserve
.                 keep mse_*
.                 keep if _n==1
(4,835 observations deleted)
.                 save `folder'/inter_mse, replace
(note: file out_3928/inter_mse.dta not found)
file out_3928/inter_mse.dta saved
.         restore
.         cap drop mse_*
.         
.         local mat gender_r_mse
.                         ddml extract, show(mse)

MSEs for gender_r:
                 rep   full smp      fold 1      fold 2      fold 3      fold 4
>       fold 5      fold 6      fold 7      fold 8      fold 9     fold 10 
    D1_pystacked   1      0.154       0.156       0.155       0.139       0.142
>        0.156       0.164       0.174       0.159       0.144       0.155  
   D_gender_r_ps   1      0.154       0.155       0.154       0.139       0.142
>        0.156       0.164       0.174       0.159       0.144       0.155  
   D_gender_r_ss   1      0.154       0.155       0.155       0.139       0.142
>        0.156       0.164       0.174       0.159       0.143       0.154  

MSEs for lnearn:
                D=  rep   full smp      fold 1      fold 2      fold 3      fol
> d 4      fold 5      fold 6      fold 7      fold 8      fold 9     fold 10 
    Y1_pystacked 0    1      0.228       0.164       0.133       0.156       0.
> 545       0.153       0.208       0.205       0.194       0.294       0.239  
    Y1_pystacked 1    1      0.174       0.166       0.170       0.316       0.
> 156       0.105       0.137       0.161       0.131       0.152       0.242  
     Y_lnearn_ps 0    1      8.298       8.276       8.180       8.296       8.
> 549       8.306       8.276       8.152       8.373       8.166       8.425  
     Y_lnearn_ps 1    1      7.490       7.327       7.551       7.500       7.
> 560       7.447       7.480       7.673       7.426       7.530       7.421  
     Y_lnearn_ss 0    1      0.224       0.161       0.131       0.155       0.
> 528       0.155       0.208       0.204       0.190       0.293       0.228  
     Y_lnearn_ss 1    1      0.172       0.164       0.170       0.315       0.
> 156       0.103       0.136       0.161       0.121       0.151       0.243  
.                         mat `mat' = r(`mat')
.                         mat list `mat'

gender_r_mse[3,12]
                      rep  full_sample        fold1        fold2        fold3
D1_pystacked            1    .15447483    .15600584    .15484207    .13912132
D_gender_r~s            1    .15418523    .15537074     .1542473    .13909319
D_gender_r~s            1    .15401452    .15495902    .15450284    .13910195

                    fold4        fold5        fold6        fold7        fold8
D1_pystacked    .14219541    .15610444    .16411752    .17386516    .15872759
D_gender_r~s    .14212544    .15567199    .16427508    .17365554    .15850259
D_gender_r~s    .14154974    .15564666    .16441619    .17377764    .15885011

                    fold9       fold10
D1_pystacked    .14437677    .15539236
D_gender_r~s    .14396557    .15494592
D_gender_r~s    .14302313    .15432053
.                                 preserve
.                                 svmat `mat'
.                                 keep `mat'*
.                                 keep if _n<=$L
(4,823 observations deleted)
.                                 gen stack_type = "conventional" if _n==1
(12 missing values generated)
.                                 replace stack_type = "pooled" if _n==2
(1 real change made)
.                                 replace stack_type = "short" if _n==3
(1 real change made)
.                                 gen model = "interactive"
.                                 list if _n<=$L

     +-----------------------------------------------------------------+
  1. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        1 | .1544748 | .1560058 | .1548421 | .1391213 | .1421954 |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     | .1561044 | .1641175 | .1738652 | .1587276 | .1443768 | .1553924 |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |          conventional          |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  2. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        1 | .1541852 | .1553707 | .1542473 | .1390932 | .1421254 |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |  .155672 | .1642751 | .1736555 | .1585026 | .1439656 | .1549459 |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                pooled          |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  3. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        1 | .1540145 |  .154959 | .1545028 |  .139102 | .1415497 |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     | .1556467 | .1644162 | .1737776 | .1588501 | .1430231 | .1543205 |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                 short          |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  4. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  5. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  6. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  7. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  8. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  9. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 10. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 11. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 12. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 13. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+
.                                 save `folder'/`mat'_inter_gender_mse, replace
(note: file out_3928/gender_r_mse_inter_gender_mse.dta not found)
file out_3928/gender_r_mse_inter_gender_mse.dta saved
.                                 restore 
.                                 
.         local mat lnearn_mse
.                         ddml extract, show(mse)

MSEs for gender_r:
                 rep   full smp      fold 1      fold 2      fold 3      fold 4
>       fold 5      fold 6      fold 7      fold 8      fold 9     fold 10 
    D1_pystacked   1      0.154       0.156       0.155       0.139       0.142
>        0.156       0.164       0.174       0.159       0.144       0.155  
   D_gender_r_ps   1      0.154       0.155       0.154       0.139       0.142
>        0.156       0.164       0.174       0.159       0.144       0.155  
   D_gender_r_ss   1      0.154       0.155       0.155       0.139       0.142
>        0.156       0.164       0.174       0.159       0.143       0.154  

MSEs for lnearn:
                D=  rep   full smp      fold 1      fold 2      fold 3      fol
> d 4      fold 5      fold 6      fold 7      fold 8      fold 9     fold 10 
    Y1_pystacked 0    1      0.228       0.164       0.133       0.156       0.
> 545       0.153       0.208       0.205       0.194       0.294       0.239  
    Y1_pystacked 1    1      0.174       0.166       0.170       0.316       0.
> 156       0.105       0.137       0.161       0.131       0.152       0.242  
     Y_lnearn_ps 0    1      8.298       8.276       8.180       8.296       8.
> 549       8.306       8.276       8.152       8.373       8.166       8.425  
     Y_lnearn_ps 1    1      7.490       7.327       7.551       7.500       7.
> 560       7.447       7.480       7.673       7.426       7.530       7.421  
     Y_lnearn_ss 0    1      0.224       0.161       0.131       0.155       0.
> 528       0.155       0.208       0.204       0.190       0.293       0.228  
     Y_lnearn_ss 1    1      0.172       0.164       0.170       0.315       0.
> 156       0.103       0.136       0.161       0.121       0.151       0.243  
.                         mat `mat' = r(`mat')
.                         mat list `mat'

lnearn_mse[6,13]
                    D=0/1          rep  full_sample        fold1        fold2
Y1_pystacked            0            1    .22781039    .16393385    .13250943
Y1_pystacked            1            1    .17407772    .16567927    .17038994
 Y_lnearn_ps            0            1     8.297768     8.276347    8.1803471
 Y_lnearn_ps            1            1    7.4901809    7.3265842    7.5510108
 Y_lnearn_ss            0            1    .22422029    .16061277    .13107344
 Y_lnearn_ss            1            1    .17235551    .16445926    .16967981

                    fold3        fold4        fold5        fold6        fold7
Y1_pystacked    .15550005    .54463177    .15278683    .20826568    .20483578
Y1_pystacked    .31576101    .15571759    .10463107    .13713707    .16098802
 Y_lnearn_ps    8.2957312    8.5486203    8.3064057    8.2757065    8.1522079
 Y_lnearn_ps    7.4998938    7.5597501    7.4473326    7.4803418    7.6730055
 Y_lnearn_ss    .15546418    .52769086     .1553044    .20767755    .20417017
 Y_lnearn_ss    .31468824    .15558505    .10292248    .13619311    .16079831

                    fold8        fold9       fold10
Y1_pystacked    .19442528    .29375489    .23917139
Y1_pystacked    .13141888    .15208541    .24225216
 Y_lnearn_ps    8.3725767    8.1659944    8.4249265
 Y_lnearn_ps    7.4258398     7.530314    7.4209518
 Y_lnearn_ss    .19013856    .29268748    .22780098
 Y_lnearn_ss    .12093221    .15103323    .24253631
.                                 preserve
.                                 svmat `mat'
.                                 keep `mat'*
.                                 keep if _n<=(2*$L)
(4,810 observations deleted)
.                                 gen stack_type = "conventional" if _n<=2
(24 missing values generated)
.                                 replace stack_type = "pooled" if _n>=3 & _n<=
> 4
(2 real changes made)
.                                 replace stack_type = "short" if _n>4
(22 real changes made)
.                                 gen model = "interactive"
.                                 list if _n<=(2*$L)

     +-----------------------------------------------------------------+
  1. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        0 |        1 | .2278104 | .1639339 | .1325094 | .1555001 |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     | .5446318 | .1527868 | .2082657 | .2048358 | .1944253 | .2937549 |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |     .2391714     |     conventional      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  2. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        1 |        1 | .1740777 | .1656793 | .1703899 |  .315761 |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     | .1557176 | .1046311 | .1371371 |  .160988 | .1314189 | .1520854 |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |     .2422522     |     conventional      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  3. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        0 |        1 | 8.297768 | 8.276347 | 8.180347 | 8.295732 |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |  8.54862 | 8.306406 | 8.275706 | 8.152208 | 8.372577 | 8.165995 |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |     8.424927     |           pooled      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  4. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        1 |        1 | 7.490181 | 7.326584 | 7.551011 | 7.499894 |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |  7.55975 | 7.447332 | 7.480342 | 7.673006 |  7.42584 | 7.530314 |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |     7.420952     |           pooled      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  5. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        0 |        1 | .2242203 | .1606128 | .1310734 | .1554642 |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     | .5276908 | .1553044 | .2076776 | .2041702 | .1901386 | .2926875 |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |      .227801     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  6. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        1 |        1 | .1723555 | .1644593 | .1696798 | .3146882 |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     | .1555851 | .1029225 | .1361931 | .1607983 | .1209322 | .1510332 |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |     .2425363     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  7. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  8. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  9. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 10. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 11. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 12. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 13. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 14. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 15. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 16. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 17. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 18. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 19. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 20. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 21. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 22. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 23. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 24. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 25. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 26. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+
.                                 save `folder'/`mat'_inter_lnearn_mse, replace
(note: file out_3928/lnearn_mse_inter_lnearn_mse.dta not found)
file out_3928/lnearn_mse_inter_lnearn_mse.dta saved
.                                 restore 
.         
.         foreach final in nnls1 singlebest ols avg {
  2. 
.                 ddml estimate, robust finalest(`final') atet
  3.         
.                         // regular stacking results
.                         ddml estimate, mname(m0) spec(st) replay atet
  4.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,interactive,seed,`seed',final,`final',learner,-1) append
  5.                         
.                         // shortstacking results
.                         ddml estimate, mname(m0) spec(ss) replay atet
  6.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,interactive,seed,`seed',final,`final',learner,-2) append
  7.                         
.                         // poolstacking results
.                         ddml estimate, mname(m0) spec(ps) replay atet
  8.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,interactive,seed,`seed',final,`final',learner,-3) append
  9.                 
.                         // pystacked weights
.                         ddml extract, show(stweights)
 10.                         foreach mat in Y1_pystacked_w_mn D1_pystacked_w_mn
>  {
 11.                                         ddml extract, show(stweights)
 12.                                         mat `mat' = r(`mat')
 13.                                         mat list `mat'
 14.                                                 preserve
 15.                                                 svmat `mat'
 16.                                                 keep `mat'*
 17.                                                 list if _n<=8
 18.                                                 save `folder'/`mat'_`final
> '_regular_ia, replace
 19.                                                 restore
 20.                         }       
 21.                         // shortstacked weights
.                         ddml extract, show(ssweights)
 22.                         foreach mat in Y_lnearn_ss D_gender_r_ss {
 23.                                         ddml extract, show(ssweights)
 24.                                         mat `mat' = r(`mat')
 25.                                         mat list `mat'
 26.                                                 preserve
 27.                                                 svmat `mat'
 28.                                                 keep `mat'*
 29.                                                 list if _n<=8
 30.                                                 save `folder'/`mat'_`final
> '_short_ia, replace
 31.                                                 restore
 32.                         }       
 33.                         // poolstacked weights
.                         ddml extract, show(psweights)
 34.                         foreach mat in Y_lnearn_ps D_gender_r_ps {
 35.                                         ddml extract, show(psweights)
 36.                                         mat `mat' = r(`mat')
 37.                                         mat list `mat'
 38.                                                 preserve
 39.                                                 svmat `mat'
 40.                                                 keep `mat'*
 41.                                                 list if _n<=8
 42.                                                 save `folder'/`mat'_`final
> '_pooled_ia, replace
 43.                                                 restore
 44.                         }       
 45.         
.         }


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.072    (0.027)
  ss  1  [shortstack]          [ss]          [ss]    -0.072    (0.027)
  ps  1   [poolstack]          [ps]          [ps]    -0.073    (0.027)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0723916    .026617    -2.72   0.007    -.1245599   -.0202232
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 7 propensity scores trimmed to lower limit .01.



Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.072    (0.027)
  ss  1  [shortstack]          [ss]          [ss]    -0.072    (0.027)
  ps  1   [poolstack]          [ps]          [ps]    -0.073    (0.027)

Stacking DDML model (ATET)
E[y|X,D=0]   = Y1_pystacked0_1                     Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1
E[D|X]       = D1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |   -.072304   .0265631    -2.72   0.006    -.1243667   -.0202413
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 6 propensity scores trimmed to lower limit .01.

(note: variable final was str5, now str10 to accommodate using data's values)
file out_3928/results.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  ss  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.072    (0.027)
  ss  1  [shortstack]          [ss]          [ss]    -0.072    (0.027)
  ps  1   [poolstack]          [ps]          [ps]    -0.073    (0.027)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0723916    .026617    -2.72   0.007    -.1245599   -.0202232
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 7 propensity scores trimmed to lower limit .01.

(note: variable final was str5, now str10 to accommodate using data's values)
file out_3928/results.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  ps  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.073    (0.027)
  ss  1  [shortstack]          [ss]          [ss]    -0.072    (0.027)
  ps  1   [poolstack]          [ps]          [ps]    -0.073    (0.027)

Poolstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ps0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ps1
E[D|X]       = D_gender_r_ps_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0726443   .0266364    -2.73   0.006    -.1248507   -.0204378
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 7 propensity scores trimmed to lower limit .01.

(note: variable final was str5, now str10 to accommodate using data's values)
file out_3928/results.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .23349372    .23349372
    logit            2    1.174e-16    1.174e-16
  lassocv            3    .12359088    .12359088
  ridgecv            4    .06034701    .06034701
  lassocv            5    .00173235    .00173235
  ridgecv            6    .02701312    .02701312
       rf            7    .29255125    .29255125
       rf            8    7.160e-17    7.160e-17
       rf            9    4.882e-17    4.882e-17
gradboost           10    .03427979    .03427979
gradboost           11    .20155356    .20155356
     nnet           12    3.308e-17    3.308e-17
     nnet           13    .02543833    .02543833

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .02294265    .02294265
      ols            2            0    .01341479    .01341479
  lassocv            3            0    .05967174    .05967174
  ridgecv            4            0    .16613076    .16613076
  lassocv            5            0    .10503846    .10503846
  ridgecv            6            0    .01234864    .01234864
       rf            7            0    .41814164    .41814164
       rf            8            0    8.481e-17    8.481e-17
       rf            9            0    1.139e-16    1.139e-16
gradboost           10            0    .01300425    .01300425
gradboost           11            0    .16039157    .16039157
     nnet           12            0    .01536252    .01536252
     nnet           13            0      .013553      .013553
      ols            1            1    .01025352    .01025352
      ols            2            1    .00155888    .00155888
  lassocv            3            1    .20658432    .20658432
  ridgecv            4            1    .02943128    .02943128
  lassocv            5            1    .10707665    .10707665
  ridgecv            6            1    .02093119    .02093119
       rf            7            1    .49751195    .49751195
       rf            8            1    3.948e-17    3.948e-17
       rf            9            1    5.391e-17    5.391e-17
gradboost           10            1    .00785184    .00785184
gradboost           11            1    .07406303    .07406303
     nnet           12            1    .01860288    .01860288
     nnet           13            1    .02613445    .02613445

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .23349372    .23349372
    logit            2    1.174e-16    1.174e-16
  lassocv            3    .12359088    .12359088
  ridgecv            4    .06034701    .06034701
  lassocv            5    .00173235    .00173235
  ridgecv            6    .02701312    .02701312
       rf            7    .29255125    .29255125
       rf            8    7.160e-17    7.160e-17
       rf            9    4.882e-17    4.882e-17
gradboost           10    .03427979    .03427979
gradboost           11    .20155356    .20155356
     nnet           12    3.308e-17    3.308e-17
     nnet           13    .02543833    .02543833

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .02294265    .02294265
      ols            2            0    .01341479    .01341479
  lassocv            3            0    .05967174    .05967174
  ridgecv            4            0    .16613076    .16613076
  lassocv            5            0    .10503846    .10503846
  ridgecv            6            0    .01234864    .01234864
       rf            7            0    .41814164    .41814164
       rf            8            0    8.481e-17    8.481e-17
       rf            9            0    1.139e-16    1.139e-16
gradboost           10            0    .01300425    .01300425
gradboost           11            0    .16039157    .16039157
     nnet           12            0    .01536252    .01536252
     nnet           13            0      .013553      .013553
      ols            1            1    .01025352    .01025352
      ols            2            1    .00155888    .00155888
  lassocv            3            1    .20658432    .20658432
  ridgecv            4            1    .02943128    .02943128
  lassocv            5            1    .10707665    .10707665
  ridgecv            6            1    .02093119    .02093119
       rf            7            1    .49751195    .49751195
       rf            8            1    3.948e-17    3.948e-17
       rf            9            1    5.391e-17    5.391e-17
gradboost           10            1    .00785184    .00785184
gradboost           11            1    .07406303    .07406303
     nnet           12            1    .01860288    .01860288
     nnet           13            1    .02613445    .02613445

Y1_pystacked_w_mn[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .02294265    .02294265
      ols            2            0    .01341479    .01341479
  lassocv            3            0    .05967174    .05967174
  ridgecv            4            0    .16613076    .16613076
  lassocv            5            0    .10503846    .10503846
  ridgecv            6            0    .01234864    .01234864
       rf            7            0    .41814164    .41814164
       rf            8            0    8.481e-17    8.481e-17
       rf            9            0    1.139e-16    1.139e-16
gradboost           10            0    .01300425    .01300425
gradboost           11            0    .16039157    .16039157
     nnet           12            0    .01536252    .01536252
     nnet           13            0      .013553      .013553
      ols            1            1    .01025352    .01025352
      ols            2            1    .00155888    .00155888
  lassocv            3            1    .20658432    .20658432
  ridgecv            4            1    .02943128    .02943128
  lassocv            5            1    .10707665    .10707665
  ridgecv            6            1    .02093119    .02093119
       rf            7            1    .49751195    .49751195
       rf            8            1    3.948e-17    3.948e-17
       rf            9            1    5.391e-17    5.391e-17
gradboost           10            1    .00785184    .00785184
gradboost           11            1    .07406303    .07406303
     nnet           12            1    .01860288    .01860288
     nnet           13            1    .02613445    .02613445

      +-------------------------------------------+
      | Y1_pys~1   Y1_pys~2   Y1_pys~3   Y1_pys~4 |
      |-------------------------------------------|
   1. |        1          0   .0229427   .0229427 |
   2. |        2          0   .0134148   .0134148 |
   3. |        3          0   .0596717   .0596717 |
   4. |        4          0   .1661308   .1661308 |
   5. |        5          0   .1050385   .1050385 |
      |-------------------------------------------|
   6. |        6          0   .0123486   .0123486 |
   7. |        7          0   .4181416   .4181416 |
   8. |        8          0   8.48e-17   8.48e-17 |
      +-------------------------------------------+
(note: file out_3928/Y1_pystacked_w_mn_nnls1_regular_ia.dta not found)
file out_3928/Y1_pystacked_w_mn_nnls1_regular_ia.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .23349372    .23349372
    logit            2    1.174e-16    1.174e-16
  lassocv            3    .12359088    .12359088
  ridgecv            4    .06034701    .06034701
  lassocv            5    .00173235    .00173235
  ridgecv            6    .02701312    .02701312
       rf            7    .29255125    .29255125
       rf            8    7.160e-17    7.160e-17
       rf            9    4.882e-17    4.882e-17
gradboost           10    .03427979    .03427979
gradboost           11    .20155356    .20155356
     nnet           12    3.308e-17    3.308e-17
     nnet           13    .02543833    .02543833

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .02294265    .02294265
      ols            2            0    .01341479    .01341479
  lassocv            3            0    .05967174    .05967174
  ridgecv            4            0    .16613076    .16613076
  lassocv            5            0    .10503846    .10503846
  ridgecv            6            0    .01234864    .01234864
       rf            7            0    .41814164    .41814164
       rf            8            0    8.481e-17    8.481e-17
       rf            9            0    1.139e-16    1.139e-16
gradboost           10            0    .01300425    .01300425
gradboost           11            0    .16039157    .16039157
     nnet           12            0    .01536252    .01536252
     nnet           13            0      .013553      .013553
      ols            1            1    .01025352    .01025352
      ols            2            1    .00155888    .00155888
  lassocv            3            1    .20658432    .20658432
  ridgecv            4            1    .02943128    .02943128
  lassocv            5            1    .10707665    .10707665
  ridgecv            6            1    .02093119    .02093119
       rf            7            1    .49751195    .49751195
       rf            8            1    3.948e-17    3.948e-17
       rf            9            1    5.391e-17    5.391e-17
gradboost           10            1    .00785184    .00785184
gradboost           11            1    .07406303    .07406303
     nnet           12            1    .01860288    .01860288
     nnet           13            1    .02613445    .02613445

D1_pystacked_w_mn[13,3]
               learner  mean_weight        rep_1
    logit            1    .23349372    .23349372
    logit            2    1.174e-16    1.174e-16
  lassocv            3    .12359088    .12359088
  ridgecv            4    .06034701    .06034701
  lassocv            5    .00173235    .00173235
  ridgecv            6    .02701312    .02701312
       rf            7    .29255125    .29255125
       rf            8    7.160e-17    7.160e-17
       rf            9    4.882e-17    4.882e-17
gradboost           10    .03427979    .03427979
gradboost           11    .20155356    .20155356
     nnet           12    3.308e-17    3.308e-17
     nnet           13    .02543833    .02543833

      +--------------------------------+
      | D1_pys~1   D1_pys~2   D1_pys~3 |
      |--------------------------------|
   1. |        1   .2334937   .2334937 |
   2. |        2   1.17e-16   1.17e-16 |
   3. |        3   .1235909   .1235909 |
   4. |        4    .060347    .060347 |
   5. |        5   .0017323   .0017323 |
      |--------------------------------|
   6. |        6   .0270131   .0270131 |
   7. |        7   .2925512   .2925512 |
   8. |        8   7.16e-17   7.16e-17 |
      +--------------------------------+
(note: file out_3928/D1_pystacked_w_mn_nnls1_regular_ia.dta not found)
file out_3928/D1_pystacked_w_mn_nnls1_regular_ia.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1     .2097057     .2097057
    logit            2            0            0
  lassocv            3    .03376812    .03376812
  ridgecv            4    .11264179    .11264179
  lassocv            5    2.056e-17    2.056e-17
  ridgecv            6            0            0
       rf            7    .29605338    .29605338
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11    .29476671    .29476671
     nnet           12    2.252e-16    2.252e-16
     nnet           13    .05306429    .05306429

short-stacked weights across resamples for lnearn
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .00390956    .00390956
      ols            2            0    5.173e-17    5.173e-17
  lassocv            3            0    8.072e-17    8.072e-17
  ridgecv            4            0    .28981671    .28981671
  lassocv            5            0    4.409e-17    4.409e-17
  ridgecv            6            0    3.011e-17    3.011e-17
       rf            7            0    .47669303    .47669303
       rf            8            0    3.701e-17    3.701e-17
       rf            9            0    1.147e-16    1.147e-16
gradboost           10            0    3.150e-17    3.150e-17
gradboost           11            0    .20268868    .20268868
     nnet           12            0    1.869e-17    1.869e-17
     nnet           13            0    .02689202    .02689202
      ols            1            1    1.342e-17    1.342e-17
      ols            2            1    1.237e-16    1.237e-16
  lassocv            3            1    .17388132    .17388132
  ridgecv            4            1    8.016e-17    8.016e-17
  lassocv            5            1    .22105816    .22105816
  ridgecv            6            1    .04372492    .04372492
       rf            7            1    .47485701    .47485701
       rf            8            1    5.612e-17    5.612e-17
       rf            9            1    2.835e-17    2.835e-17
gradboost           10            1            0            0
gradboost           11            1    .06251774    .06251774
     nnet           12            1            0            0
     nnet           13            1    .02396084    .02396084

short-stacked weights across resamples for gender_r
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1     .2097057     .2097057
    logit            2            0            0
  lassocv            3    .03376812    .03376812
  ridgecv            4    .11264179    .11264179
  lassocv            5    2.056e-17    2.056e-17
  ridgecv            6            0            0
       rf            7    .29605338    .29605338
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11    .29476671    .29476671
     nnet           12    2.252e-16    2.252e-16
     nnet           13    .05306429    .05306429

short-stacked weights across resamples for lnearn
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .00390956    .00390956
      ols            2            0    5.173e-17    5.173e-17
  lassocv            3            0    8.072e-17    8.072e-17
  ridgecv            4            0    .28981671    .28981671
  lassocv            5            0    4.409e-17    4.409e-17
  ridgecv            6            0    3.011e-17    3.011e-17
       rf            7            0    .47669303    .47669303
       rf            8            0    3.701e-17    3.701e-17
       rf            9            0    1.147e-16    1.147e-16
gradboost           10            0    3.150e-17    3.150e-17
gradboost           11            0    .20268868    .20268868
     nnet           12            0    1.869e-17    1.869e-17
     nnet           13            0    .02689202    .02689202
      ols            1            1    1.342e-17    1.342e-17
      ols            2            1    1.237e-16    1.237e-16
  lassocv            3            1    .17388132    .17388132
  ridgecv            4            1    8.016e-17    8.016e-17
  lassocv            5            1    .22105816    .22105816
  ridgecv            6            1    .04372492    .04372492
       rf            7            1    .47485701    .47485701
       rf            8            1    5.612e-17    5.612e-17
       rf            9            1    2.835e-17    2.835e-17
gradboost           10            1            0            0
gradboost           11            1    .06251774    .06251774
     nnet           12            1            0            0
     nnet           13            1    .02396084    .02396084

Y_lnearn_ss[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .00390956    .00390956
      ols            2            0    5.173e-17    5.173e-17
  lassocv            3            0    8.072e-17    8.072e-17
  ridgecv            4            0    .28981671    .28981671
  lassocv            5            0    4.409e-17    4.409e-17
  ridgecv            6            0    3.011e-17    3.011e-17
       rf            7            0    .47669303    .47669303
       rf            8            0    3.701e-17    3.701e-17
       rf            9            0    1.147e-16    1.147e-16
gradboost           10            0    3.150e-17    3.150e-17
gradboost           11            0    .20268868    .20268868
     nnet           12            0    1.869e-17    1.869e-17
     nnet           13            0    .02689202    .02689202
      ols            1            1    1.342e-17    1.342e-17
      ols            2            1    1.237e-16    1.237e-16
  lassocv            3            1    .17388132    .17388132
  ridgecv            4            1    8.016e-17    8.016e-17
  lassocv            5            1    .22105816    .22105816
  ridgecv            6            1    .04372492    .04372492
       rf            7            1    .47485701    .47485701
       rf            8            1    5.612e-17    5.612e-17
       rf            9            1    2.835e-17    2.835e-17
gradboost           10            1            0            0
gradboost           11            1    .06251774    .06251774
     nnet           12            1            0            0
     nnet           13            1    .02396084    .02396084

      +-------------------------------------------------------------------+
      | Y_lne~1_1   Y_lne~0_1   Y_lne~s1   Y_lnea~2   Y_lnea~3   Y_lnea~4 |
      |-------------------------------------------------------------------|
   1. | 2.5372999   2.6920912          1          0   .0039096   .0039096 |
   2. | 2.9921997   3.2774735          2          0   5.17e-17   5.17e-17 |
   3. | 2.8322508   2.8517121          3          0   8.07e-17   8.07e-17 |
   4. | 2.4713084   2.5936788          4          0   .2898167   .2898167 |
   5. | 3.0957629   3.0963782          5          0   4.41e-17   4.41e-17 |
      |-------------------------------------------------------------------|
   6. | 2.5668517   2.6564477          6          0   3.01e-17   3.01e-17 |
   7. | 2.4058147   2.7317166          7          0    .476693    .476693 |
   8. | 2.6005277    2.715041          8          0   3.70e-17   3.70e-17 |
      +-------------------------------------------------------------------+
(note: file out_3928/Y_lnearn_ss_nnls1_short_ia.dta not found)
file out_3928/Y_lnearn_ss_nnls1_short_ia.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1     .2097057     .2097057
    logit            2            0            0
  lassocv            3    .03376812    .03376812
  ridgecv            4    .11264179    .11264179
  lassocv            5    2.056e-17    2.056e-17
  ridgecv            6            0            0
       rf            7    .29605338    .29605338
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11    .29476671    .29476671
     nnet           12    2.252e-16    2.252e-16
     nnet           13    .05306429    .05306429

short-stacked weights across resamples for lnearn
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .00390956    .00390956
      ols            2            0    5.173e-17    5.173e-17
  lassocv            3            0    8.072e-17    8.072e-17
  ridgecv            4            0    .28981671    .28981671
  lassocv            5            0    4.409e-17    4.409e-17
  ridgecv            6            0    3.011e-17    3.011e-17
       rf            7            0    .47669303    .47669303
       rf            8            0    3.701e-17    3.701e-17
       rf            9            0    1.147e-16    1.147e-16
gradboost           10            0    3.150e-17    3.150e-17
gradboost           11            0    .20268868    .20268868
     nnet           12            0    1.869e-17    1.869e-17
     nnet           13            0    .02689202    .02689202
      ols            1            1    1.342e-17    1.342e-17
      ols            2            1    1.237e-16    1.237e-16
  lassocv            3            1    .17388132    .17388132
  ridgecv            4            1    8.016e-17    8.016e-17
  lassocv            5            1    .22105816    .22105816
  ridgecv            6            1    .04372492    .04372492
       rf            7            1    .47485701    .47485701
       rf            8            1    5.612e-17    5.612e-17
       rf            9            1    2.835e-17    2.835e-17
gradboost           10            1            0            0
gradboost           11            1    .06251774    .06251774
     nnet           12            1            0            0
     nnet           13            1    .02396084    .02396084

D_gender_r_ss[13,3]
               learner  mean_weight        rep_1
    logit            1     .2097057     .2097057
    logit            2            0            0
  lassocv            3    .03376812    .03376812
  ridgecv            4    .11264179    .11264179
  lassocv            5    2.056e-17    2.056e-17
  ridgecv            6            0            0
       rf            7    .29605338    .29605338
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11    .29476671    .29476671
     nnet           12    2.252e-16    2.252e-16
     nnet           13    .05306429    .05306429

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .77663061          1   .2097057   .2097057 |
   2. | .43194384          2          0          0 |
   3. | .09617756          3   .0337681   .0337681 |
   4. | .19963809          4   .1126418   .1126418 |
   5. | .54287984          5   2.06e-17   2.06e-17 |
      |--------------------------------------------|
   6. | .89204939          6          0          0 |
   7. | .78620628          7   .2960534   .2960534 |
   8. | .85568445          8          0          0 |
      +--------------------------------------------+
(note: file out_3928/D_gender_r_ss_nnls1_short_ia.dta not found)
file out_3928/D_gender_r_ss_nnls1_short_ia.dta saved

pool-stacked weights across resamples for gender_r
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .25125354    .25125354
    logit            2    5.663e-17    5.663e-17
  lassocv            3     .1392684     .1392684
  ridgecv            4    .08066563    .08066563
  lassocv            5    2.771e-16    2.771e-16
  ridgecv            6    2.680e-16    2.680e-16
       rf            7     .3053957     .3053957
       rf            8    1.186e-17    1.186e-17
       rf            9    1.614e-16    1.614e-16
gradboost           10    .00966129    .00966129
gradboost           11    .21375544    .21375544
     nnet           12    3.113e-17    3.113e-17
     nnet           13            0            0

pool-stacked weights across resamples for lnearn
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .01347536    .01347536
      ols            2            0            0            0
  lassocv            3            0    .19261953    .19261953
  ridgecv            4            0    .14873629    .14873629
  lassocv            5            0     .0025711     .0025711
  ridgecv            6            0            0            0
       rf            7            0    .45313877    .45313877
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0    .17234326    .17234326
     nnet           12            0            0            0
     nnet           13            0     .0171157     .0171157
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1    .28110566    .28110566
  ridgecv            4            1    .04785752    .04785752
  lassocv            5            1    .05346216    .05346216
  ridgecv            6            1    .00779347    .00779347
       rf            7            1    .50842935    .50842935
       rf            8            1    1.423e-16    1.423e-16
       rf            9            1    5.284e-16    5.284e-16
gradboost           10            1            0            0
gradboost           11            1    .08094535    .08094535
     nnet           12            1            0            0
     nnet           13            1    .02040648    .02040648

pool-stacked weights across resamples for gender_r
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .25125354    .25125354
    logit            2    5.663e-17    5.663e-17
  lassocv            3     .1392684     .1392684
  ridgecv            4    .08066563    .08066563
  lassocv            5    2.771e-16    2.771e-16
  ridgecv            6    2.680e-16    2.680e-16
       rf            7     .3053957     .3053957
       rf            8    1.186e-17    1.186e-17
       rf            9    1.614e-16    1.614e-16
gradboost           10    .00966129    .00966129
gradboost           11    .21375544    .21375544
     nnet           12    3.113e-17    3.113e-17
     nnet           13            0            0

pool-stacked weights across resamples for lnearn
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .01347536    .01347536
      ols            2            0            0            0
  lassocv            3            0    .19261953    .19261953
  ridgecv            4            0    .14873629    .14873629
  lassocv            5            0     .0025711     .0025711
  ridgecv            6            0            0            0
       rf            7            0    .45313877    .45313877
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0    .17234326    .17234326
     nnet           12            0            0            0
     nnet           13            0     .0171157     .0171157
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1    .28110566    .28110566
  ridgecv            4            1    .04785752    .04785752
  lassocv            5            1    .05346216    .05346216
  ridgecv            6            1    .00779347    .00779347
       rf            7            1    .50842935    .50842935
       rf            8            1    1.423e-16    1.423e-16
       rf            9            1    5.284e-16    5.284e-16
gradboost           10            1            0            0
gradboost           11            1    .08094535    .08094535
     nnet           12            1            0            0
     nnet           13            1    .02040648    .02040648

Y_lnearn_ps[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .01347536    .01347536
      ols            2            0            0            0
  lassocv            3            0    .19261953    .19261953
  ridgecv            4            0    .14873629    .14873629
  lassocv            5            0     .0025711     .0025711
  ridgecv            6            0            0            0
       rf            7            0    .45313877    .45313877
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0    .17234326    .17234326
     nnet           12            0            0            0
     nnet           13            0     .0171157     .0171157
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1    .28110566    .28110566
  ridgecv            4            1    .04785752    .04785752
  lassocv            5            1    .05346216    .05346216
  ridgecv            6            1    .00779347    .00779347
       rf            7            1    .50842935    .50842935
       rf            8            1    1.423e-16    1.423e-16
       rf            9            1    5.284e-16    5.284e-16
gradboost           10            1            0            0
gradboost           11            1    .08094535    .08094535
     nnet           12            1            0            0
     nnet           13            1    .02040648    .02040648

      +-------------------------------------------------------------------+
      | Y_lne~1_1   Y_lne~0_1   Y_lne~s1   Y_lnea~2   Y_lnea~3   Y_lnea~4 |
      |-------------------------------------------------------------------|
   1. | 2.5397638    2.675628          1          0   .0134754   .0134754 |
   2. | 2.9839306    3.282268          2          0          0          0 |
   3. | 2.8266541   2.8372948          3          0   .1926195   .1926195 |
   4. | 2.4654449   2.5883994          4          0   .1487363   .1487363 |
   5. | 3.0950945   3.0996561          5          0   .0025711   .0025711 |
      |-------------------------------------------------------------------|
   6. | 2.5596584    2.642205          6          0          0          0 |
   7. | 2.3856356   2.6945489          7          0   .4531388   .4531388 |
   8. | 2.6003507   2.7070601          8          0          0          0 |
      +-------------------------------------------------------------------+
(note: file out_3928/Y_lnearn_ps_nnls1_pooled_ia.dta not found)
file out_3928/Y_lnearn_ps_nnls1_pooled_ia.dta saved

pool-stacked weights across resamples for gender_r
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .25125354    .25125354
    logit            2    5.663e-17    5.663e-17
  lassocv            3     .1392684     .1392684
  ridgecv            4    .08066563    .08066563
  lassocv            5    2.771e-16    2.771e-16
  ridgecv            6    2.680e-16    2.680e-16
       rf            7     .3053957     .3053957
       rf            8    1.186e-17    1.186e-17
       rf            9    1.614e-16    1.614e-16
gradboost           10    .00966129    .00966129
gradboost           11    .21375544    .21375544
     nnet           12    3.113e-17    3.113e-17
     nnet           13            0            0

pool-stacked weights across resamples for lnearn
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .01347536    .01347536
      ols            2            0            0            0
  lassocv            3            0    .19261953    .19261953
  ridgecv            4            0    .14873629    .14873629
  lassocv            5            0     .0025711     .0025711
  ridgecv            6            0            0            0
       rf            7            0    .45313877    .45313877
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0    .17234326    .17234326
     nnet           12            0            0            0
     nnet           13            0     .0171157     .0171157
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1    .28110566    .28110566
  ridgecv            4            1    .04785752    .04785752
  lassocv            5            1    .05346216    .05346216
  ridgecv            6            1    .00779347    .00779347
       rf            7            1    .50842935    .50842935
       rf            8            1    1.423e-16    1.423e-16
       rf            9            1    5.284e-16    5.284e-16
gradboost           10            1            0            0
gradboost           11            1    .08094535    .08094535
     nnet           12            1            0            0
     nnet           13            1    .02040648    .02040648

D_gender_r_ps[13,3]
               learner  mean_weight        rep_1
    logit            1    .25125354    .25125354
    logit            2    5.663e-17    5.663e-17
  lassocv            3     .1392684     .1392684
  ridgecv            4    .08066563    .08066563
  lassocv            5    2.771e-16    2.771e-16
  ridgecv            6    2.680e-16    2.680e-16
       rf            7     .3053957     .3053957
       rf            8    1.186e-17    1.186e-17
       rf            9    1.614e-16    1.614e-16
gradboost           10    .00966129    .00966129
gradboost           11    .21375544    .21375544
     nnet           12    3.113e-17    3.113e-17
     nnet           13            0            0

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .76672862          1   .2512535   .2512535 |
   2. | .40650497          2   5.66e-17   5.66e-17 |
   3. | .09641115          3   .1392684   .1392684 |
   4. | .19919187          4   .0806656   .0806656 |
   5. | .53350347          5   2.77e-16   2.77e-16 |
      |--------------------------------------------|
   6. | .88560659          6   2.68e-16   2.68e-16 |
   7. |   .801643          7   .3053957   .3053957 |
   8. | .83893822          8   1.19e-17   1.19e-17 |
      +--------------------------------------------+
(note: file out_3928/D_gender_r_ps_nnls1_pooled_ia.dta not found)
file out_3928/D_gender_r_ps_nnls1_pooled_ia.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked     0.029    (0.088)
  ss  1  [shortstack]          [ss]          [ss]    -0.001    (0.081)
  ps  1   [poolstack]          [ps]          [ps]    -0.001    (0.081)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0007709   .0808121    -0.01   0.992    -.1591596    .1576179
------------------------------------------------------------------------------
Stacking final estimator: singlebest
Warning: 82 propensity scores trimmed to lower limit .01.
Warning: 16 propensity scores trimmed to upper limit .99.
Warning: . resamples had propensity scores trimmed to upper limit .99.



Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked     0.029    (0.088)
  ss  1  [shortstack]          [ss]          [ss]    -0.001    (0.081)
  ps  1   [poolstack]          [ps]          [ps]    -0.001    (0.081)

Stacking DDML model (ATET)
E[y|X,D=0]   = Y1_pystacked0_1                     Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1
E[D|X]       = D1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |   .0285534   .0875214     0.33   0.744    -.1429854    .2000923
------------------------------------------------------------------------------
Stacking final estimator: singlebest
Warning: 64 propensity scores trimmed to lower limit .01.
Warning: 11 propensity scores trimmed to upper limit .99.
Warning: . resamples had propensity scores trimmed to upper limit .99.

file out_3928/results.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  ss  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.001    (0.081)
  ss  1  [shortstack]          [ss]          [ss]    -0.001    (0.081)
  ps  1   [poolstack]          [ps]          [ps]    -0.001    (0.081)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0007709   .0808121    -0.01   0.992    -.1591596    .1576179
------------------------------------------------------------------------------
Stacking final estimator: singlebest
Warning: 82 propensity scores trimmed to lower limit .01.
Warning: 16 propensity scores trimmed to upper limit .99.
Warning: . resamples had propensity scores trimmed to upper limit .99.

file out_3928/results.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  ps  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.001    (0.081)
  ss  1  [shortstack]          [ss]          [ss]    -0.001    (0.081)
  ps  1   [poolstack]          [ps]          [ps]    -0.001    (0.081)

Poolstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ps0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ps1
E[D|X]       = D_gender_r_ps_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0007709   .0808121    -0.01   0.992    -.1591596    .1576179
------------------------------------------------------------------------------
Stacking final estimator: singlebest
Warning: 82 propensity scores trimmed to lower limit .01.
Warning: 16 propensity scores trimmed to upper limit .99.
Warning: . resamples had propensity scores trimmed to upper limit .99.

file out_3928/results.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3           .8           .8
  ridgecv            4           .1           .1
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7           .1           .1
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0           .1           .1
  lassocv            5            0           .1           .1
  ridgecv            6            0            0            0
       rf            7            0           .8           .8
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3           .8           .8
  ridgecv            4           .1           .1
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7           .1           .1
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0           .1           .1
  lassocv            5            0           .1           .1
  ridgecv            6            0            0            0
       rf            7            0           .8           .8
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

Y1_pystacked_w_mn[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0           .1           .1
  lassocv            5            0           .1           .1
  ridgecv            6            0            0            0
       rf            7            0           .8           .8
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

      +-------------------------------------------+
      | Y1_pys~1   Y1_pys~2   Y1_pys~3   Y1_pys~4 |
      |-------------------------------------------|
   1. |        1          0          0          0 |
   2. |        2          0          0          0 |
   3. |        3          0          0          0 |
   4. |        4          0         .1         .1 |
   5. |        5          0         .1         .1 |
      |-------------------------------------------|
   6. |        6          0          0          0 |
   7. |        7          0         .8         .8 |
   8. |        8          0          0          0 |
      +-------------------------------------------+
(note: file out_3928/Y1_pystacked_w_mn_singlebest_regular_ia.dta not found)
file out_3928/Y1_pystacked_w_mn_singlebest_regular_ia.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3           .8           .8
  ridgecv            4           .1           .1
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7           .1           .1
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0           .1           .1
  lassocv            5            0           .1           .1
  ridgecv            6            0            0            0
       rf            7            0           .8           .8
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

D1_pystacked_w_mn[13,3]
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3           .8           .8
  ridgecv            4           .1           .1
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7           .1           .1
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

      +--------------------------------+
      | D1_pys~1   D1_pys~2   D1_pys~3 |
      |--------------------------------|
   1. |        1          0          0 |
   2. |        2          0          0 |
   3. |        3         .8         .8 |
   4. |        4         .1         .1 |
   5. |        5          0          0 |
      |--------------------------------|
   6. |        6          0          0 |
   7. |        7         .1         .1 |
   8. |        8          0          0 |
      +--------------------------------+
(note: file out_3928/D1_pystacked_w_mn_singlebest_regular_ia.dta not found)
file out_3928/D1_pystacked_w_mn_singlebest_regular_ia.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3            1            1
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

short-stacked weights across resamples for lnearn
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

short-stacked weights across resamples for gender_r
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3            1            1
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

short-stacked weights across resamples for lnearn
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

Y_lnearn_ss[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

      +-------------------------------------------------------------------+
      | Y_lne~1_1   Y_lne~0_1   Y_lne~s1   Y_lnea~2   Y_lnea~3   Y_lnea~4 |
      |-------------------------------------------------------------------|
   1. | 2.5118794   2.7528937          1          0          0          0 |
   2. | 2.8923905   3.2184176          2          0          0          0 |
   3. | 2.9168916   2.9038236          3          0          0          0 |
   4. | 2.5131216   2.6478825          4          0          0          0 |
   5. | 3.0616705   3.1144109          5          0          0          0 |
      |-------------------------------------------------------------------|
   6. | 2.5120332   2.6416435          6          0          0          0 |
   7. | 2.5162961   2.8007903          7          0          1          1 |
   8. | 2.6071784   2.7215791          8          0          0          0 |
      +-------------------------------------------------------------------+
(note: file out_3928/Y_lnearn_ss_singlebest_short_ia.dta not found)
file out_3928/Y_lnearn_ss_singlebest_short_ia.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3            1            1
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

short-stacked weights across resamples for lnearn
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

D_gender_r_ss[13,3]
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3            1            1
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .72450328          1          0          0 |
   2. | .33522227          2          0          0 |
   3. | .02521066          3          1          1 |
   4. | .24730569          4          0          0 |
   5. |   .555399          5          0          0 |
      |--------------------------------------------|
   6. | .87178385          6          0          0 |
   7. | .86414778          7          0          0 |
   8. | .67848366          8          0          0 |
      +--------------------------------------------+
(note: file out_3928/D_gender_r_ss_singlebest_short_ia.dta not found)
file out_3928/D_gender_r_ss_singlebest_short_ia.dta saved

pool-stacked weights across resamples for gender_r
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3            1            1
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

pool-stacked weights across resamples for lnearn
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

pool-stacked weights across resamples for gender_r
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3            1            1
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

pool-stacked weights across resamples for lnearn
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

Y_lnearn_ps[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

      +-------------------------------------------------------------------+
      | Y_lne~1_1   Y_lne~0_1   Y_lne~s1   Y_lnea~2   Y_lnea~3   Y_lnea~4 |
      |-------------------------------------------------------------------|
   1. | 2.5118794   2.7528937          1          0          0          0 |
   2. | 2.8923905   3.2184176          2          0          0          0 |
   3. | 2.9168916   2.9038236          3          0          0          0 |
   4. | 2.5131216   2.6478825          4          0          0          0 |
   5. | 3.0616705   3.1144109          5          0          0          0 |
      |-------------------------------------------------------------------|
   6. | 2.5120332   2.6416435          6          0          0          0 |
   7. | 2.5162961   2.8007903          7          0          1          1 |
   8. | 2.6071784   2.7215791          8          0          0          0 |
      +-------------------------------------------------------------------+
(note: file out_3928/Y_lnearn_ps_singlebest_pooled_ia.dta not found)
file out_3928/Y_lnearn_ps_singlebest_pooled_ia.dta saved

pool-stacked weights across resamples for gender_r
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3            1            1
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

pool-stacked weights across resamples for lnearn
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

D_gender_r_ps[13,3]
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3            1            1
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .72450328          1          0          0 |
   2. | .33522227          2          0          0 |
   3. | .02521066          3          1          1 |
   4. | .24730569          4          0          0 |
   5. |   .555399          5          0          0 |
      |--------------------------------------------|
   6. | .87178385          6          0          0 |
   7. | .86414778          7          0          0 |
   8. | .67848366          8          0          0 |
      +--------------------------------------------+
(note: file out_3928/D_gender_r_ps_singlebest_pooled_ia.dta not found)
file out_3928/D_gender_r_ps_singlebest_pooled_ia.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.662    (0.271)
  ss  1  [shortstack]          [ss]          [ss]    -0.111    (0.055)
  ps  1   [poolstack]          [ps]          [ps]     0.135    (0.094)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1109417   .0547374    -2.03   0.043     -.218225   -.0036584
------------------------------------------------------------------------------
Stacking final estimator: ols
Warning: 244 propensity scores trimmed to lower limit .01.
Warning: 14 propensity scores trimmed to upper limit .99.
Warning: . resamples had propensity scores trimmed to upper limit .99.



Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.662    (0.271)
  ss  1  [shortstack]          [ss]          [ss]    -0.111    (0.055)
  ps  1   [poolstack]          [ps]          [ps]     0.135    (0.094)

Stacking DDML model (ATET)
E[y|X,D=0]   = Y1_pystacked0_1                     Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1
E[D|X]       = D1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.6623405   .2714189    -2.44   0.015    -1.194312   -.1303691
------------------------------------------------------------------------------
Stacking final estimator: ols
Warning: 2689 propensity scores trimmed to lower limit .01.
Warning: 1050 propensity scores trimmed to upper limit .99.
Warning: . resamples had propensity scores trimmed to upper limit .99.

(note: variable final was str3, now str10 to accommodate using data's values)
file out_3928/results.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  ss  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.111    (0.055)
  ss  1  [shortstack]          [ss]          [ss]    -0.111    (0.055)
  ps  1   [poolstack]          [ps]          [ps]     0.135    (0.094)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1109417   .0547374    -2.03   0.043     -.218225   -.0036584
------------------------------------------------------------------------------
Stacking final estimator: ols
Warning: 244 propensity scores trimmed to lower limit .01.
Warning: 14 propensity scores trimmed to upper limit .99.
Warning: . resamples had propensity scores trimmed to upper limit .99.

(note: variable final was str3, now str10 to accommodate using data's values)
file out_3928/results.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  ps  1  Y1_pystacked  Y1_pystacked  D1_pystacked     0.135    (0.094)
  ss  1  [shortstack]          [ss]          [ss]    -0.111    (0.055)
  ps  1   [poolstack]          [ps]          [ps]     0.135    (0.094)

Poolstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ps0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ps1
E[D|X]       = D_gender_r_ps_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |   .1352565    .093982     1.44   0.150    -.0489448    .3194578
------------------------------------------------------------------------------
Stacking final estimator: ols
Warning: 8 propensity scores trimmed to lower limit .01.
Warning: 306 propensity scores trimmed to upper limit .99.
Warning: . resamples had propensity scores trimmed to upper limit .99.

(note: variable final was str3, now str10 to accommodate using data's values)
file out_3928/results.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .19840792    .19840792
    logit            2    .08903647    .08903647
  lassocv            3     .3629891     .3629891
  ridgecv            4    .05533048    .05533048
  lassocv            5   -.28562399   -.28562399
  ridgecv            6    .12852725    .12852725
       rf            7    .42661721    .42661721
       rf            8    .14393148    .14393148
       rf            9   -.28711787   -.28711787
gradboost           10    .12065642    .12065642
gradboost           11    .12540297    .12540297
     nnet           12   -1.0942962   -1.0942962
     nnet           13   -.00044119   -.00044119

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .02415616    .02415616
      ols            2            0   -.04306526   -.04306526
  lassocv            3            0   -.13601085   -.13601085
  ridgecv            4            0    .56690461    .56690461
  lassocv            5            0    .08878922    .08878922
  ridgecv            6            0    -.0959103    -.0959103
       rf            7            0     .6443549     .6443549
       rf            8            0    .07760361    .07760361
       rf            9            0   -.17219187   -.17219187
gradboost           10            0    -.0019413    -.0019413
gradboost           11            0    .10018012    .10018012
     nnet           12            0    .06065523    .06065523
     nnet           13            0    .00718894    .00718894
      ols            1            1   -.00943273   -.00943273
      ols            2            1   -.01155138   -.01155138
  lassocv            3            1    .04099001    .04099001
  ridgecv            4            1    .25909461    .25909461
  lassocv            5            1    .19545425    .19545425
  ridgecv            6            1   -.06033519   -.06033519
       rf            7            1    .49907375    .49907375
       rf            8            1     .5785336     .5785336
       rf            9            1   -.49604544   -.49604544
gradboost           10            1   -.03325323   -.03325323
gradboost           11            1    .05632126    .05632126
     nnet           12            1    -.1332347    -.1332347
     nnet           13            1    .01422961    .01422961

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .19840792    .19840792
    logit            2    .08903647    .08903647
  lassocv            3     .3629891     .3629891
  ridgecv            4    .05533048    .05533048
  lassocv            5   -.28562399   -.28562399
  ridgecv            6    .12852725    .12852725
       rf            7    .42661721    .42661721
       rf            8    .14393148    .14393148
       rf            9   -.28711787   -.28711787
gradboost           10    .12065642    .12065642
gradboost           11    .12540297    .12540297
     nnet           12   -1.0942962   -1.0942962
     nnet           13   -.00044119   -.00044119

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .02415616    .02415616
      ols            2            0   -.04306526   -.04306526
  lassocv            3            0   -.13601085   -.13601085
  ridgecv            4            0    .56690461    .56690461
  lassocv            5            0    .08878922    .08878922
  ridgecv            6            0    -.0959103    -.0959103
       rf            7            0     .6443549     .6443549
       rf            8            0    .07760361    .07760361
       rf            9            0   -.17219187   -.17219187
gradboost           10            0    -.0019413    -.0019413
gradboost           11            0    .10018012    .10018012
     nnet           12            0    .06065523    .06065523
     nnet           13            0    .00718894    .00718894
      ols            1            1   -.00943273   -.00943273
      ols            2            1   -.01155138   -.01155138
  lassocv            3            1    .04099001    .04099001
  ridgecv            4            1    .25909461    .25909461
  lassocv            5            1    .19545425    .19545425
  ridgecv            6            1   -.06033519   -.06033519
       rf            7            1    .49907375    .49907375
       rf            8            1     .5785336     .5785336
       rf            9            1   -.49604544   -.49604544
gradboost           10            1   -.03325323   -.03325323
gradboost           11            1    .05632126    .05632126
     nnet           12            1    -.1332347    -.1332347
     nnet           13            1    .01422961    .01422961

Y1_pystacked_w_mn[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .02415616    .02415616
      ols            2            0   -.04306526   -.04306526
  lassocv            3            0   -.13601085   -.13601085
  ridgecv            4            0    .56690461    .56690461
  lassocv            5            0    .08878922    .08878922
  ridgecv            6            0    -.0959103    -.0959103
       rf            7            0     .6443549     .6443549
       rf            8            0    .07760361    .07760361
       rf            9            0   -.17219187   -.17219187
gradboost           10            0    -.0019413    -.0019413
gradboost           11            0    .10018012    .10018012
     nnet           12            0    .06065523    .06065523
     nnet           13            0    .00718894    .00718894
      ols            1            1   -.00943273   -.00943273
      ols            2            1   -.01155138   -.01155138
  lassocv            3            1    .04099001    .04099001
  ridgecv            4            1    .25909461    .25909461
  lassocv            5            1    .19545425    .19545425
  ridgecv            6            1   -.06033519   -.06033519
       rf            7            1    .49907375    .49907375
       rf            8            1     .5785336     .5785336
       rf            9            1   -.49604544   -.49604544
gradboost           10            1   -.03325323   -.03325323
gradboost           11            1    .05632126    .05632126
     nnet           12            1    -.1332347    -.1332347
     nnet           13            1    .01422961    .01422961

      +---------------------------------------------+
      | Y1_pys~1   Y1_pys~2   Y1_pyst~3   Y1_pyst~4 |
      |---------------------------------------------|
   1. |        1          0    .0241562    .0241562 |
   2. |        2          0   -.0430653   -.0430653 |
   3. |        3          0   -.1360108   -.1360108 |
   4. |        4          0    .5669046    .5669046 |
   5. |        5          0    .0887892    .0887892 |
      |---------------------------------------------|
   6. |        6          0   -.0959103   -.0959103 |
   7. |        7          0    .6443549    .6443549 |
   8. |        8          0    .0776036    .0776036 |
      +---------------------------------------------+
(note: file out_3928/Y1_pystacked_w_mn_ols_regular_ia.dta not found)
file out_3928/Y1_pystacked_w_mn_ols_regular_ia.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .19840792    .19840792
    logit            2    .08903647    .08903647
  lassocv            3     .3629891     .3629891
  ridgecv            4    .05533048    .05533048
  lassocv            5   -.28562399   -.28562399
  ridgecv            6    .12852725    .12852725
       rf            7    .42661721    .42661721
       rf            8    .14393148    .14393148
       rf            9   -.28711787   -.28711787
gradboost           10    .12065642    .12065642
gradboost           11    .12540297    .12540297
     nnet           12   -1.0942962   -1.0942962
     nnet           13   -.00044119   -.00044119

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .02415616    .02415616
      ols            2            0   -.04306526   -.04306526
  lassocv            3            0   -.13601085   -.13601085
  ridgecv            4            0    .56690461    .56690461
  lassocv            5            0    .08878922    .08878922
  ridgecv            6            0    -.0959103    -.0959103
       rf            7            0     .6443549     .6443549
       rf            8            0    .07760361    .07760361
       rf            9            0   -.17219187   -.17219187
gradboost           10            0    -.0019413    -.0019413
gradboost           11            0    .10018012    .10018012
     nnet           12            0    .06065523    .06065523
     nnet           13            0    .00718894    .00718894
      ols            1            1   -.00943273   -.00943273
      ols            2            1   -.01155138   -.01155138
  lassocv            3            1    .04099001    .04099001
  ridgecv            4            1    .25909461    .25909461
  lassocv            5            1    .19545425    .19545425
  ridgecv            6            1   -.06033519   -.06033519
       rf            7            1    .49907375    .49907375
       rf            8            1     .5785336     .5785336
       rf            9            1   -.49604544   -.49604544
gradboost           10            1   -.03325323   -.03325323
gradboost           11            1    .05632126    .05632126
     nnet           12            1    -.1332347    -.1332347
     nnet           13            1    .01422961    .01422961

D1_pystacked_w_mn[13,3]
               learner  mean_weight        rep_1
    logit            1    .19840792    .19840792
    logit            2    .08903647    .08903647
  lassocv            3     .3629891     .3629891
  ridgecv            4    .05533048    .05533048
  lassocv            5   -.28562399   -.28562399
  ridgecv            6    .12852725    .12852725
       rf            7    .42661721    .42661721
       rf            8    .14393148    .14393148
       rf            9   -.28711787   -.28711787
gradboost           10    .12065642    .12065642
gradboost           11    .12540297    .12540297
     nnet           12   -1.0942962   -1.0942962
     nnet           13   -.00044119   -.00044119

      +--------------------------------+
      | D1_pys~1   D1_pys~2   D1_pys~3 |
      |--------------------------------|
   1. |        1   .1984079   .1984079 |
   2. |        2   .0890365   .0890365 |
   3. |        3   .3629891   .3629891 |
   4. |        4   .0553305   .0553305 |
   5. |        5   -.285624   -.285624 |
      |--------------------------------|
   6. |        6   .1285273   .1285273 |
   7. |        7   .4266172   .4266172 |
   8. |        8   .1439315   .1439315 |
      +--------------------------------+
(note: file out_3928/D1_pystacked_w_mn_ols_regular_ia.dta not found)
file out_3928/D1_pystacked_w_mn_ols_regular_ia.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .19046824    .19046824
    logit            2    .08453925    .08453925
  lassocv            3    .21169184    .21169184
  ridgecv            4    .14799892    .14799892
  lassocv            5   -.33564103   -.33564103
  ridgecv            6    .15783837    .15783837
       rf            7    .47806137    .47806137
       rf            8    .21452011    .21452011
       rf            9   -.37560631   -.37560631
gradboost           10    .00812253    .00812253
gradboost           11    .23274019    .23274019
     nnet           12   -.08323792   -.08323792
     nnet           13     .0397753     .0397753

short-stacked weights across resamples for lnearn
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .02174727    .02174727
      ols            2            0   -.08852241   -.08852241
  lassocv            3            0   -.28054789   -.28054789
  ridgecv            4            0    .90145157    .90145157
  lassocv            5            0    .00608807    .00608807
  ridgecv            6            0   -.23251368   -.23251368
       rf            7            0     .7253165     .7253165
       rf            8            0   -.27293959   -.27293959
       rf            9            0    .26541936    .26541936
gradboost           10            0    -.0769879    -.0769879
gradboost           11            0    .16377858    .16377858
     nnet           12            0    .01915059    .01915059
     nnet           13            0    .02054739    .02054739
      ols            1            1   -.00253439   -.00253439
      ols            2            1   -.03634918   -.03634918
  lassocv            3            1   -.04079024   -.04079024
  ridgecv            4            1     .3461995     .3461995
  lassocv            5            1    .34077836    .34077836
  ridgecv            6            1   -.10476439   -.10476439
       rf            7            1    .58151451    .58151451
       rf            8            1   -.34759832   -.34759832
       rf            9            1    .46150965    .46150965
gradboost           10            1   -.08687923   -.08687923
gradboost           11            1    .04472599    .04472599
     nnet           12            1    .01184073    .01184073
     nnet           13            1    .01955432    .01955432

short-stacked weights across resamples for gender_r
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .19046824    .19046824
    logit            2    .08453925    .08453925
  lassocv            3    .21169184    .21169184
  ridgecv            4    .14799892    .14799892
  lassocv            5   -.33564103   -.33564103
  ridgecv            6    .15783837    .15783837
       rf            7    .47806137    .47806137
       rf            8    .21452011    .21452011
       rf            9   -.37560631   -.37560631
gradboost           10    .00812253    .00812253
gradboost           11    .23274019    .23274019
     nnet           12   -.08323792   -.08323792
     nnet           13     .0397753     .0397753

short-stacked weights across resamples for lnearn
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .02174727    .02174727
      ols            2            0   -.08852241   -.08852241
  lassocv            3            0   -.28054789   -.28054789
  ridgecv            4            0    .90145157    .90145157
  lassocv            5            0    .00608807    .00608807
  ridgecv            6            0   -.23251368   -.23251368
       rf            7            0     .7253165     .7253165
       rf            8            0   -.27293959   -.27293959
       rf            9            0    .26541936    .26541936
gradboost           10            0    -.0769879    -.0769879
gradboost           11            0    .16377858    .16377858
     nnet           12            0    .01915059    .01915059
     nnet           13            0    .02054739    .02054739
      ols            1            1   -.00253439   -.00253439
      ols            2            1   -.03634918   -.03634918
  lassocv            3            1   -.04079024   -.04079024
  ridgecv            4            1     .3461995     .3461995
  lassocv            5            1    .34077836    .34077836
  ridgecv            6            1   -.10476439   -.10476439
       rf            7            1    .58151451    .58151451
       rf            8            1   -.34759832   -.34759832
       rf            9            1    .46150965    .46150965
gradboost           10            1   -.08687923   -.08687923
gradboost           11            1    .04472599    .04472599
     nnet           12            1    .01184073    .01184073
     nnet           13            1    .01955432    .01955432

Y_lnearn_ss[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .02174727    .02174727
      ols            2            0   -.08852241   -.08852241
  lassocv            3            0   -.28054789   -.28054789
  ridgecv            4            0    .90145157    .90145157
  lassocv            5            0    .00608807    .00608807
  ridgecv            6            0   -.23251368   -.23251368
       rf            7            0     .7253165     .7253165
       rf            8            0   -.27293959   -.27293959
       rf            9            0    .26541936    .26541936
gradboost           10            0    -.0769879    -.0769879
gradboost           11            0    .16377858    .16377858
     nnet           12            0    .01915059    .01915059
     nnet           13            0    .02054739    .02054739
      ols            1            1   -.00253439   -.00253439
      ols            2            1   -.03634918   -.03634918
  lassocv            3            1   -.04079024   -.04079024
  ridgecv            4            1     .3461995     .3461995
  lassocv            5            1    .34077836    .34077836
  ridgecv            6            1   -.10476439   -.10476439
       rf            7            1    .58151451    .58151451
       rf            8            1   -.34759832   -.34759832
       rf            9            1    .46150965    .46150965
gradboost           10            1   -.08687923   -.08687923
gradboost           11            1    .04472599    .04472599
     nnet           12            1    .01184073    .01184073
     nnet           13            1    .01955432    .01955432

      +---------------------------------------------------------------------+
      | Y_lne~1_1   Y_lne~0_1   Y_lne~s1   Y_lnea~2   Y_lnear~3   Y_lnear~4 |
      |---------------------------------------------------------------------|
   1. | 3.0236971   3.1880342          1          0    .0217473    .0217473 |
   2. | 3.4803202   3.7508127          2          0   -.0885224   -.0885224 |
   3. | 3.3270929   3.3883754          3          0   -.2805479   -.2805479 |
   4. | 2.9517714   3.0730271          4          0    .9014516    .9014516 |
   5. | 3.6467198   3.6102762          5          0    .0060881    .0060881 |
      |---------------------------------------------------------------------|
   6. | 3.0712271   3.1349225          6          0   -.2325137   -.2325137 |
   7. | 2.8982963   3.2182605          7          0    .7253165    .7253165 |
   8. | 3.0969796   3.1443839          8          0   -.2729396   -.2729396 |
      +---------------------------------------------------------------------+
(note: file out_3928/Y_lnearn_ss_ols_short_ia.dta not found)
file out_3928/Y_lnearn_ss_ols_short_ia.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .19046824    .19046824
    logit            2    .08453925    .08453925
  lassocv            3    .21169184    .21169184
  ridgecv            4    .14799892    .14799892
  lassocv            5   -.33564103   -.33564103
  ridgecv            6    .15783837    .15783837
       rf            7    .47806137    .47806137
       rf            8    .21452011    .21452011
       rf            9   -.37560631   -.37560631
gradboost           10    .00812253    .00812253
gradboost           11    .23274019    .23274019
     nnet           12   -.08323792   -.08323792
     nnet           13     .0397753     .0397753

short-stacked weights across resamples for lnearn
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .02174727    .02174727
      ols            2            0   -.08852241   -.08852241
  lassocv            3            0   -.28054789   -.28054789
  ridgecv            4            0    .90145157    .90145157
  lassocv            5            0    .00608807    .00608807
  ridgecv            6            0   -.23251368   -.23251368
       rf            7            0     .7253165     .7253165
       rf            8            0   -.27293959   -.27293959
       rf            9            0    .26541936    .26541936
gradboost           10            0    -.0769879    -.0769879
gradboost           11            0    .16377858    .16377858
     nnet           12            0    .01915059    .01915059
     nnet           13            0    .02054739    .02054739
      ols            1            1   -.00253439   -.00253439
      ols            2            1   -.03634918   -.03634918
  lassocv            3            1   -.04079024   -.04079024
  ridgecv            4            1     .3461995     .3461995
  lassocv            5            1    .34077836    .34077836
  ridgecv            6            1   -.10476439   -.10476439
       rf            7            1    .58151451    .58151451
       rf            8            1   -.34759832   -.34759832
       rf            9            1    .46150965    .46150965
gradboost           10            1   -.08687923   -.08687923
gradboost           11            1    .04472599    .04472599
     nnet           12            1    .01184073    .01184073
     nnet           13            1    .01955432    .01955432

D_gender_r_ss[13,3]
               learner  mean_weight        rep_1
    logit            1    .19046824    .19046824
    logit            2    .08453925    .08453925
  lassocv            3    .21169184    .21169184
  ridgecv            4    .14799892    .14799892
  lassocv            5   -.33564103   -.33564103
  ridgecv            6    .15783837    .15783837
       rf            7    .47806137    .47806137
       rf            8    .21452011    .21452011
       rf            9   -.37560631   -.37560631
gradboost           10    .00812253    .00812253
gradboost           11    .23274019    .23274019
     nnet           12   -.08323792   -.08323792
     nnet           13     .0397753     .0397753

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .71671683          1   .1904682   .1904682 |
   2. | .42117124          2   .0845392   .0845392 |
   3. | .04444165          3   .2116918   .2116918 |
   4. | .12434161          4   .1479989   .1479989 |
   5. |  .5233665          5   -.335641   -.335641 |
      |--------------------------------------------|
   6. |  .9122106          6   .1578384   .1578384 |
   7. | .79811427          7   .4780614   .4780614 |
   8. | .84414197          8   .2145201   .2145201 |
      +--------------------------------------------+
(note: file out_3928/D_gender_r_ss_ols_short_ia.dta not found)
file out_3928/D_gender_r_ss_ols_short_ia.dta saved

pool-stacked weights across resamples for gender_r
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .20707214    .20707214
    logit            2    .09171369    .09171369
  lassocv            3    .21683512    .21683512
  ridgecv            4    .07963034    .07963034
  lassocv            5   -.14926541   -.14926541
  ridgecv            6    .10238096    .10238096
       rf            7    .42902091    .42902091
       rf            8    .14605542    .14605542
       rf            9    -.2823655    -.2823655
gradboost           10    .12085942    .12085942
gradboost           11    .12534072    .12534072
     nnet           12   -.00094933   -.00094933
     nnet           13   -.00402265   -.00402265

pool-stacked weights across resamples for lnearn
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .00681594    .00681594
      ols            2            0   -.04558798   -.04558798
  lassocv            3            0   -.01561405   -.01561405
  ridgecv            4            0     .4467937     .4467937
  lassocv            5            0    .00505491    .00505491
  ridgecv            6            0   -.02047192   -.02047192
       rf            7            0    .67244356    .67244356
       rf            8            0     .0663742     .0663742
       rf            9            0   -.17127855   -.17127855
gradboost           10            0    -.0018359    -.0018359
gradboost           11            0    .10337076    .10337076
     nnet           12            0   -.00131126   -.00131126
     nnet           13            0    .01095011    .01095011
      ols            1            1   -.00120478   -.00120478
      ols            2            1    -.0138987    -.0138987
  lassocv            3            1    .10580127    .10580127
  ridgecv            4            1    .28037211    .28037211
  lassocv            5            1    .10503295    .10503295
  ridgecv            6            1   -.05853957   -.05853957
       rf            7            1    .49640759    .49640759
       rf            8            1    .63640078    .63640078
       rf            9            1   -.54132667   -.54132667
gradboost           10            1   -.03294025   -.03294025
gradboost           11            1    .05485986    .05485986
     nnet           12            1    .00711489    .00711489
     nnet           13            1    .01479673    .01479673

pool-stacked weights across resamples for gender_r
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .20707214    .20707214
    logit            2    .09171369    .09171369
  lassocv            3    .21683512    .21683512
  ridgecv            4    .07963034    .07963034
  lassocv            5   -.14926541   -.14926541
  ridgecv            6    .10238096    .10238096
       rf            7    .42902091    .42902091
       rf            8    .14605542    .14605542
       rf            9    -.2823655    -.2823655
gradboost           10    .12085942    .12085942
gradboost           11    .12534072    .12534072
     nnet           12   -.00094933   -.00094933
     nnet           13   -.00402265   -.00402265

pool-stacked weights across resamples for lnearn
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .00681594    .00681594
      ols            2            0   -.04558798   -.04558798
  lassocv            3            0   -.01561405   -.01561405
  ridgecv            4            0     .4467937     .4467937
  lassocv            5            0    .00505491    .00505491
  ridgecv            6            0   -.02047192   -.02047192
       rf            7            0    .67244356    .67244356
       rf            8            0     .0663742     .0663742
       rf            9            0   -.17127855   -.17127855
gradboost           10            0    -.0018359    -.0018359
gradboost           11            0    .10337076    .10337076
     nnet           12            0   -.00131126   -.00131126
     nnet           13            0    .01095011    .01095011
      ols            1            1   -.00120478   -.00120478
      ols            2            1    -.0138987    -.0138987
  lassocv            3            1    .10580127    .10580127
  ridgecv            4            1    .28037211    .28037211
  lassocv            5            1    .10503295    .10503295
  ridgecv            6            1   -.05853957   -.05853957
       rf            7            1    .49640759    .49640759
       rf            8            1    .63640078    .63640078
       rf            9            1   -.54132667   -.54132667
gradboost           10            1   -.03294025   -.03294025
gradboost           11            1    .05485986    .05485986
     nnet           12            1    .00711489    .00711489
     nnet           13            1    .01479673    .01479673

Y_lnearn_ps[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .00681594    .00681594
      ols            2            0   -.04558798   -.04558798
  lassocv            3            0   -.01561405   -.01561405
  ridgecv            4            0     .4467937     .4467937
  lassocv            5            0    .00505491    .00505491
  ridgecv            6            0   -.02047192   -.02047192
       rf            7            0    .67244356    .67244356
       rf            8            0     .0663742     .0663742
       rf            9            0   -.17127855   -.17127855
gradboost           10            0    -.0018359    -.0018359
gradboost           11            0    .10337076    .10337076
     nnet           12            0   -.00131126   -.00131126
     nnet           13            0    .01095011    .01095011
      ols            1            1   -.00120478   -.00120478
      ols            2            1    -.0138987    -.0138987
  lassocv            3            1    .10580127    .10580127
  ridgecv            4            1    .28037211    .28037211
  lassocv            5            1    .10503295    .10503295
  ridgecv            6            1   -.05853957   -.05853957
       rf            7            1    .49640759    .49640759
       rf            8            1    .63640078    .63640078
       rf            9            1   -.54132667   -.54132667
gradboost           10            1   -.03294025   -.03294025
gradboost           11            1    .05485986    .05485986
     nnet           12            1    .00711489    .00711489
     nnet           13            1    .01479673    .01479673

      +---------------------------------------------------------------------+
      | Y_lne~1_1   Y_lne~0_1   Y_lne~s1   Y_lnea~2   Y_lnear~3   Y_lnear~4 |
      |---------------------------------------------------------------------|
   1. | 2.6691837   2.8388812          1          0    .0068159    .0068159 |
   2. |  3.112663   3.4222823          2          0    -.045588    -.045588 |
   3. | 2.9585995   3.0274321          3          0   -.0156141   -.0156141 |
   4. | 2.5901883   2.7380718          4          0    .4467937    .4467937 |
   5. | 3.2826207   3.2684896          5          0    .0050549    .0050549 |
      |---------------------------------------------------------------------|
   6. | 2.6966528   2.7820734          6          0   -.0204719   -.0204719 |
   7. | 2.5042453    2.850256          7          0    .6724436    .6724436 |
   8. | 2.7502818    2.828908          8          0    .0663742    .0663742 |
      +---------------------------------------------------------------------+
(note: file out_3928/Y_lnearn_ps_ols_pooled_ia.dta not found)
file out_3928/Y_lnearn_ps_ols_pooled_ia.dta saved

pool-stacked weights across resamples for gender_r
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .20707214    .20707214
    logit            2    .09171369    .09171369
  lassocv            3    .21683512    .21683512
  ridgecv            4    .07963034    .07963034
  lassocv            5   -.14926541   -.14926541
  ridgecv            6    .10238096    .10238096
       rf            7    .42902091    .42902091
       rf            8    .14605542    .14605542
       rf            9    -.2823655    -.2823655
gradboost           10    .12085942    .12085942
gradboost           11    .12534072    .12534072
     nnet           12   -.00094933   -.00094933
     nnet           13   -.00402265   -.00402265

pool-stacked weights across resamples for lnearn
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .00681594    .00681594
      ols            2            0   -.04558798   -.04558798
  lassocv            3            0   -.01561405   -.01561405
  ridgecv            4            0     .4467937     .4467937
  lassocv            5            0    .00505491    .00505491
  ridgecv            6            0   -.02047192   -.02047192
       rf            7            0    .67244356    .67244356
       rf            8            0     .0663742     .0663742
       rf            9            0   -.17127855   -.17127855
gradboost           10            0    -.0018359    -.0018359
gradboost           11            0    .10337076    .10337076
     nnet           12            0   -.00131126   -.00131126
     nnet           13            0    .01095011    .01095011
      ols            1            1   -.00120478   -.00120478
      ols            2            1    -.0138987    -.0138987
  lassocv            3            1    .10580127    .10580127
  ridgecv            4            1    .28037211    .28037211
  lassocv            5            1    .10503295    .10503295
  ridgecv            6            1   -.05853957   -.05853957
       rf            7            1    .49640759    .49640759
       rf            8            1    .63640078    .63640078
       rf            9            1   -.54132667   -.54132667
gradboost           10            1   -.03294025   -.03294025
gradboost           11            1    .05485986    .05485986
     nnet           12            1    .00711489    .00711489
     nnet           13            1    .01479673    .01479673

D_gender_r_ps[13,3]
               learner  mean_weight        rep_1
    logit            1    .20707214    .20707214
    logit            2    .09171369    .09171369
  lassocv            3    .21683512    .21683512
  ridgecv            4    .07963034    .07963034
  lassocv            5   -.14926541   -.14926541
  ridgecv            6    .10238096    .10238096
       rf            7    .42902091    .42902091
       rf            8    .14605542    .14605542
       rf            9    -.2823655    -.2823655
gradboost           10    .12085942    .12085942
gradboost           11    .12534072    .12534072
     nnet           12   -.00094933   -.00094933
     nnet           13   -.00402265   -.00402265

      +----------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gende~2   D_gende~3 |
      |----------------------------------------------|
   1. | .80076884          1    .2070721    .2070721 |
   2. | .43899709          2    .0917137    .0917137 |
   3. | .10353588          3    .2168351    .2168351 |
   4. | .20663702          4    .0796303    .0796303 |
   5. | .58090273          5   -.1492654   -.1492654 |
      |----------------------------------------------|
   6. | .96990966          6     .102381     .102381 |
   7. | .88529215          7    .4290209    .4290209 |
   8. | .89114057          8    .1460554    .1460554 |
      +----------------------------------------------+
(note: file out_3928/D_gender_r_ps_ols_pooled_ia.dta not found)
file out_3928/D_gender_r_ps_ols_pooled_ia.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.100    (0.016)
  ss  1  [shortstack]          [ss]          [ss]    -0.100    (0.016)
  ps  1   [poolstack]          [ps]          [ps]    -0.100    (0.016)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0996422   .0158075    -6.30   0.000    -.1306244     -.06866
------------------------------------------------------------------------------
Stacking final estimator: avg



Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.100    (0.016)
  ss  1  [shortstack]          [ss]          [ss]    -0.100    (0.016)
  ps  1   [poolstack]          [ps]          [ps]    -0.100    (0.016)

Stacking DDML model (ATET)
E[y|X,D=0]   = Y1_pystacked0_1                     Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1
E[D|X]       = D1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0996422   .0158075    -6.30   0.000    -.1306244     -.06866
------------------------------------------------------------------------------
Stacking final estimator: avg

(note: variable final was str3, now str10 to accommodate using data's values)
file out_3928/results.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  ss  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.100    (0.016)
  ss  1  [shortstack]          [ss]          [ss]    -0.100    (0.016)
  ps  1   [poolstack]          [ps]          [ps]    -0.100    (0.016)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0996422   .0158075    -6.30   0.000    -.1306244     -.06866
------------------------------------------------------------------------------
Stacking final estimator: avg

(note: variable final was str3, now str10 to accommodate using data's values)
file out_3928/results.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  ps  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.100    (0.016)
  ss  1  [shortstack]          [ss]          [ss]    -0.100    (0.016)
  ps  1   [poolstack]          [ps]          [ps]    -0.100    (0.016)

Poolstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ps0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ps1
E[D|X]       = D_gender_r_ps_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0996422   .0158075    -6.30   0.000    -.1306244     -.06866
------------------------------------------------------------------------------
Stacking final estimator: avg

(note: variable final was str3, now str10 to accommodate using data's values)
file out_3928/results.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

Y1_pystacked_w_mn[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

      +-------------------------------------------+
      | Y1_pys~1   Y1_pys~2   Y1_pys~3   Y1_pys~4 |
      |-------------------------------------------|
   1. |        1          0   .0769231   .0769231 |
   2. |        2          0   .0769231   .0769231 |
   3. |        3          0   .0769231   .0769231 |
   4. |        4          0   .0769231   .0769231 |
   5. |        5          0   .0769231   .0769231 |
      |-------------------------------------------|
   6. |        6          0   .0769231   .0769231 |
   7. |        7          0   .0769231   .0769231 |
   8. |        8          0   .0769231   .0769231 |
      +-------------------------------------------+
(note: file out_3928/Y1_pystacked_w_mn_avg_regular_ia.dta not found)
file out_3928/Y1_pystacked_w_mn_avg_regular_ia.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

D1_pystacked_w_mn[13,3]
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

      +--------------------------------+
      | D1_pys~1   D1_pys~2   D1_pys~3 |
      |--------------------------------|
   1. |        1   .0769231   .0769231 |
   2. |        2   .0769231   .0769231 |
   3. |        3   .0769231   .0769231 |
   4. |        4   .0769231   .0769231 |
   5. |        5   .0769231   .0769231 |
      |--------------------------------|
   6. |        6   .0769231   .0769231 |
   7. |        7   .0769231   .0769231 |
   8. |        8   .0769231   .0769231 |
      +--------------------------------+
(note: file out_3928/D1_pystacked_w_mn_avg_regular_ia.dta not found)
file out_3928/D1_pystacked_w_mn_avg_regular_ia.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

short-stacked weights across resamples for lnearn
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

short-stacked weights across resamples for gender_r
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

short-stacked weights across resamples for lnearn
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

Y_lnearn_ss[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

      +-------------------------------------------------------------------+
      | Y_lne~1_1   Y_lne~0_1   Y_lne~s1   Y_lnea~2   Y_lnea~3   Y_lnea~4 |
      |-------------------------------------------------------------------|
   1. | 2.6334731    2.691962          1          0   .0769231   .0769231 |
   2. | 3.0105539   3.3252506          2          0   .0769231   .0769231 |
   3. | 2.7830902   2.8485078          3          0   .0769231   .0769231 |
   4. | 2.4786566   2.5562659          4          0   .0769231   .0769231 |
   5. | 3.1000671   3.0538631          5          0   .0769231   .0769231 |
      |-------------------------------------------------------------------|
   6. | 2.6423515   2.7011747          6          0   .0769231   .0769231 |
   7. | 2.4739401   2.5938061          7          0   .0769231   .0769231 |
   8. | 2.6887097    2.834873          8          0   .0769231   .0769231 |
      +-------------------------------------------------------------------+
(note: file out_3928/Y_lnearn_ss_avg_short_ia.dta not found)
file out_3928/Y_lnearn_ss_avg_short_ia.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

short-stacked weights across resamples for lnearn
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

D_gender_r_ss[13,3]
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .74674899          1   .0769231   .0769231 |
   2. | .41495348          2   .0769231   .0769231 |
   3. | .16886397          3   .0769231   .0769231 |
   4. | .32091007          4   .0769231   .0769231 |
   5. | .56123756          5   .0769231   .0769231 |
      |--------------------------------------------|
   6. | .82787223          6   .0769231   .0769231 |
   7. | .78958293          7   .0769231   .0769231 |
   8. | .75782071          8   .0769231   .0769231 |
      +--------------------------------------------+
(note: file out_3928/D_gender_r_ss_avg_short_ia.dta not found)
file out_3928/D_gender_r_ss_avg_short_ia.dta saved

pool-stacked weights across resamples for gender_r
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

pool-stacked weights across resamples for lnearn
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

pool-stacked weights across resamples for gender_r
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

pool-stacked weights across resamples for lnearn
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

Y_lnearn_ps[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

      +-------------------------------------------------------------------+
      | Y_lne~1_1   Y_lne~0_1   Y_lne~s1   Y_lnea~2   Y_lnea~3   Y_lnea~4 |
      |-------------------------------------------------------------------|
   1. | 2.6334731    2.691962          1          0   .0769231   .0769231 |
   2. | 3.0105539   3.3252506          2          0   .0769231   .0769231 |
   3. | 2.7830902   2.8485078          3          0   .0769231   .0769231 |
   4. | 2.4786566   2.5562659          4          0   .0769231   .0769231 |
   5. | 3.1000671   3.0538631          5          0   .0769231   .0769231 |
      |-------------------------------------------------------------------|
   6. | 2.6423515   2.7011747          6          0   .0769231   .0769231 |
   7. | 2.4739401   2.5938061          7          0   .0769231   .0769231 |
   8. | 2.6887097    2.834873          8          0   .0769231   .0769231 |
      +-------------------------------------------------------------------+
(note: file out_3928/Y_lnearn_ps_avg_pooled_ia.dta not found)
file out_3928/Y_lnearn_ps_avg_pooled_ia.dta saved

pool-stacked weights across resamples for gender_r
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

pool-stacked weights across resamples for lnearn
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

D_gender_r_ps[13,3]
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .74674899          1   .0769231   .0769231 |
   2. | .41495348          2   .0769231   .0769231 |
   3. | .16886397          3   .0769231   .0769231 |
   4. | .32091007          4   .0769231   .0769231 |
   5. | .56123756          5   .0769231   .0769231 |
      |--------------------------------------------|
   6. | .82787223          6   .0769231   .0769231 |
   7. | .78958293          7   .0769231   .0769231 |
   8. | .75782071          8   .0769231   .0769231 |
      +--------------------------------------------+
(note: file out_3928/D_gender_r_ps_avg_pooled_ia.dta not found)
file out_3928/D_gender_r_ps_avg_pooled_ia.dta saved
. 
.         forvalues i = 1(1)$L {
  2.                         ddml estimate, y1(Y1_pystacked1_L`i'_1) y0(Y1_pyst
> acked0_L`i'_1) ///
>                                                         d(D1_pystacked_L`i'_1
> ) robust atet foldvar(m0_sample_1  )
  3.                         regsave gender_r using `folder'/results.dta, ci //
> /
>                                                 addlabel(model,interactive,se
> ed,`seed',final,indiv,learner,`i') ///
>                                                 append
  4.         }

E[y|X,D=0]   = Y1_pystacked0_L1_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L1_1
E[D|X]       = D1_pystacked_L1_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1086865   .0829621    -1.31   0.190    -.2712893    .0539163
------------------------------------------------------------------------------
Warning: 132 propensity scores trimmed to lower limit ..
Warning: 36 propensity scores trimmed to upper limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_3928/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L2_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L2_1
E[D|X]       = D1_pystacked_L2_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1192512   .0163953    -7.27   0.000    -.1513853   -.0871171
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_3928/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L3_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L3_1
E[D|X]       = D1_pystacked_L3_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |   .0327777   .0869628     0.38   0.706    -.1376663    .2032216
------------------------------------------------------------------------------
Warning: 82 propensity scores trimmed to lower limit ..
Warning: 16 propensity scores trimmed to upper limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_3928/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L4_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L4_1
E[D|X]       = D1_pystacked_L4_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0121041    .094311    -0.13   0.898    -.1969502    .1727421
------------------------------------------------------------------------------
Warning: 100 propensity scores trimmed to lower limit ..
Warning: 29 propensity scores trimmed to upper limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_3928/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L5_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L5_1
E[D|X]       = D1_pystacked_L5_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |   .0215553   .0924344     0.23   0.816    -.1596129    .2027234
------------------------------------------------------------------------------
Warning: 85 propensity scores trimmed to lower limit ..
Warning: 19 propensity scores trimmed to upper limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_3928/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L6_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L6_1
E[D|X]       = D1_pystacked_L6_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1707861   .1810137    -0.94   0.345    -.5255665    .1839942
------------------------------------------------------------------------------
Warning: 92 propensity scores trimmed to lower limit ..
Warning: 19 propensity scores trimmed to upper limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_3928/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L7_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L7_1
E[D|X]       = D1_pystacked_L7_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0792297   .0198485    -3.99   0.000     -.118132   -.0403273
------------------------------------------------------------------------------
Warning: 3 propensity scores trimmed to lower limit ..
Warning: 2 propensity scores trimmed to upper limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_3928/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L8_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L8_1
E[D|X]       = D1_pystacked_L8_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1039604   .0157525    -6.60   0.000    -.1348348    -.073086
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_3928/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L9_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L9_1
E[D|X]       = D1_pystacked_L9_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1094243   .0149031    -7.34   0.000    -.1386338   -.0802147
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_3928/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L10_1                 Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L10_1
E[D|X]       = D1_pystacked_L10_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0739581   .0216305    -3.42   0.001    -.1163532    -.031563
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_3928/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L11_1                 Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L11_1
E[D|X]       = D1_pystacked_L11_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0300239   .0409308    -0.73   0.463    -.1102468     .050199
------------------------------------------------------------------------------
Warning: 81 propensity scores trimmed to lower limit ..
Warning: 24 propensity scores trimmed to upper limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_3928/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L12_1                 Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L12_1
E[D|X]       = D1_pystacked_L12_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |    .097184   .0850149     1.14   0.253    -.0694421    .2638101
------------------------------------------------------------------------------
Warning: 28 propensity scores trimmed to upper limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_3928/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L13_1                 Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L13_1
E[D|X]       = D1_pystacked_L13_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |    -.21826   .2483986    -0.88   0.380    -.7051122    .2685922
------------------------------------------------------------------------------
Warning: 159 propensity scores trimmed to lower limit ..
Warning: 160 propensity scores trimmed to upper limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_3928/results.dta saved
. 
. }       

.         
. *****************************************************************************
> *  
. *** interactive NX: short-stacking                                           
>                                       ***
. *****************************************************************************
> *
. 
. if (`estimator'==3) {
. 
. gen one = 1     
. 
.         cap drop y0base*
.         cap drop dbase*
.         cap drop y1base*
. 
.         *** no cross-fitting
.         pystacked lnearn $X_expanded   $pystring_reg0  if gender_r == 0, type
> (reg) njobs($cores)  
.                 mat nxw_ia_y0 = e(weights)
.                 mat list nxw_ia_y0
.                                 preserve
.                                 svmat nxw_ia_y0
.                                 keep nxw_ia_y0*
.                                 save `folder'/nxw_ia_y0, replace
.                                 restore
.         predict y0base0, xb
.         predict y0base, base
. 
.         pystacked lnearn $X_expanded  $pystring_reg0 if gender_r == 1  , type
> (reg) njobs($cores)  
.                 mat nxw_ia_y1 = e(weights)
.                 mat list nxw_ia_y1
.                                 preserve
.                                 svmat nxw_ia_y1
.                                 keep nxw_ia_y1*
.                                 save `folder'/nxw_ia_y1, replace
.                                 restore
.         predict y1base0, xb
.         predict y1base, base
. 
.         pystacked gender_r $X_expanded $pystring_class  
.                 mat nxw_ia_d = e(weights)
.                 mat list nxw_ia_d
.                                 preserve
.                                 svmat nxw_ia_d
.                                 keep nxw_ia_d*
.                                 save `folder'/nxw_ia_d, replace
.                                 restore         
.         predict dbase0, pr
.         predict dbase, base pr
.         
.         forvalues i = 0(1)$L {
  2.                         _estimate_ate interactive, yname(lnearn) dname(gen
> der_r) ///
>                                                 y0(y0base`i') y1(y1base`i') d
> (dbase`i') ///
>                                                 atet foldid(one) robust model
> (interactive)
  3.                         regsave gender_r using `folder'/results.dta, ///
>                                                 ci addlabel(model,nxinter,see
> d,`seed',final,nx,learner,`i') append
  4.         }
.                 
. }

.         
. *****************************************************************************
> *  
. *** partial NX: short-stacking                                               
>                                       ***
. *****************************************************************************
> *
. 
. if (`estimator'==4) {
.         
. cap gen one = 1 
. 
.         cap drop Ybase* 
.         cap drop Dbase*
. 
.         *** no cross-fitting
.         pystacked lnearn $X_expanded $pystring_reg 
.                 mat nxw_y = e(weights)
.                 mat list nxw_y
.                                 preserve
.                                 svmat nxw_y
.                                 keep nxw_y*
.                                 save `folder'/nxw_y, replace
.                                 restore
.         predict Ybase0
.         predict Ybase, basexb
. 
.         pystacked gender_r $X_expanded $pystring_reg 
.                 mat nxw_d = e(weights)
.                 mat list nxw_d
.                                 preserve
.                                 svmat nxw_d
.                                 keep nxw_d*
.                                 save `folder'/nxw_d, replace
.                                 restore         
.         predict Dbase0
.         predict Dbase, basexb
. 
.         forvalues i = 0(1)$L {
  2.                 cap drop Ytil
  3.                 cap drop Dtil
  4.                 gen Ytil = lnearn - Ybase`i'
  5.                 gen Dtil = gender_r - Dbase`i'
  6.                 reg Ytil Dtil, robust
  7.                 regsave Dtil using `folder'/results.dta, ///
>                         ci addlabel(model,nxpartial,seed,`seed',final,nx,lear
> ner,`i') append
  8.         }
. 
. }

.         
. cap log close
