-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /cluster/home/kahrens/ddml_applied/GWG/Output/GWG_8756_2.txt
  log type:  text
 opened on:  10 Dec 2023, 19:14:53

. 
. which ddml
/cluster/home/kahrens/ado/plus/d/ddml.ado
*! ddml v1.4.3
*! last edited: 17aug2023
*! authors: aa/ms

. which pystacked
/cluster/home/kahrens/ado/plus/p/pystacked.ado
*! pystacked v0.7.5
*! last edited: 7aug2023
*! authors: aa/ms

. 
. set seed `seed'

. local folder out_`seed'

. 
. use "../Data/gender_gap_ML_processed", clear

. 
. cap mkdir `folder'

. 
. *****************************************************************************
> ***
. ***  controls
. *****************************************************************************
> ***
. 
. // create squared age and tenure here
. gen age_r2 = age_r^2

. gen tenure2 = tenure^2
(2 missing values generated)

. 
. // no base categories
. global continuous                                                            
>                                                            ///
>         age_r                                                                
>                                                                    /// no mis
> sing
>         yrsqual         /* years of education (derived) */                   
>                                    /// 355 missing
>         /// leavedu             /* age when left education (derived) */      
>                            /// 1,081 missing
>         pvlit1          /* literacy score: plausible value 1 (also 2-10 avail
> ) */       /// no missing
>         pvnum1          /* numeracy score: plausible value 1 (also 2-10 avail
> ) */       /// no missing
>         tenure          /* tenure = years in work for current employer */    
>                    /// 2 missing
>                                                                              
>                                                                            //

. // add second order terms here
. global continuous $continuous age_r2 tenure2

. 
. global discrete0                                                             
>                                                            ///             
>         b_q01a          /* education, highest level attained */              
>                            /// no missing
>         b_q01b          /* area of study */                                  
>                                                    /// 434 missing
>         d_q06c          /* part of a larger organization */                  
>                                    /// 13 missing
>         d_q08a          /* management position */                            
>                                            /// no missing
>         d_q09           /* type of contract */                               
>                                            /// 12 missing
>         d_q10_t1        /* hours per week at this job or business */         
>                    /// 1 missing
>         d_q14           /* job satisfaction */                               
>                                            /// 1 missing
>         i_q08           /* health status */                                  
>                                                    /// 2 missing
>         j_q02a          /* living with a partner */                          
>                                            /// 899 missing
>         j_q03d1_c       /* age of youngest child */                          
>                                            /// 2,718 missing
>         j_q04c1_c       /* immigration: age */                               
>                                            /// 4,375 missing
>         j_q06b          /* mother's highest level of educ */                 
>                            /// 445 missing
>         j_q07b          /* father's highest level of educ */                 
>                            /// 515 missing
>         j_q03b          /* number of children*/                              
>                                            /// 1,856 missing
>         impar           /* immigration: parents */                           
>                                            /// 21 missing
>         imgen           /* immigration: generation */                        
>                                    /// 344 missing
>         nfe12jr         /* informal job-related educ in prev 12 months */    
>                    /// 116 missing
>         nfe12njr        /* informal non-job-related educ in prev 12 months */
>            /// 116 missing
>                                                                              
>                                                                            //
>                                                                              
>                                                          

. global personality                                                           
>                                                            ///
>         i_q04b          /* Learning strategies, Relate new ideas into real li
> fe */      /// 16 missing
>         i_q04d          /* Learning strategies, Like learning new things */  
>                    /// no missing
>         i_q04h          /* Learning strategies, Attribute something new */   
>                    /// 10 missing
>         i_q04j          /* Learning strategies, Deal with difficult things */
>            /// no missing
>         i_q04l          /* Learning strategies, Fit different ideas together 
> */         /// 5 missing
>         i_q04m          /* Learning strategies, Looking for additional info *
> /          /// 1 missing
>         i_q05f          /* Cultural engagement, Voluntary non-profit work */ 
>            /// no missing
>         i_q06a          /* Political efficacy, No influence on the government
>  */        /// 14 missing
>         i_q07a          /* Social trust, Trust only few people */            
>                            /// 4 missing
>         i_q07b          /* Social trust, Other people take advantage of you *
> /          /// 6 missing
>                                                                              
>                                                                            //

. global discrete $discrete0                                                   
>                                                    ///
>         new_reg_tl2     /* geographical region */                            
>                                            /// 2 missing
>         new_isco1c      /* occupation */                                     
>                                                    /// no missing
>         new_isic1c      /* industry */                                       
>                                                    // no missing

. 
. global X_simple                                                         ///
>         i.(b_q01a d_q10_t1 j_q03b)                              ///
>         c.($continuous)

. 
. global X_fullinteracted                                         ///
>         i.($discrete0 )                                                 ///
>         i.new_isco1c#i.new_isic1c#i.new_reg_tl2 ///
>         c.($continuous)                  

.         
. global X_cont                                                           ///
>         c.($continuous)##i.($discrete)

. 
. global X_expanded                                                       ///
>         i.($discrete)                                                   ///
>         c.($continuous)                                                 ///
>         c.age_r#i.($discrete)                                   ///
>         c.tenure#i.($discrete)

. 
.         
. 
. *****************************************************************************
> ***
. ***  estimation sample
. *****************************************************************************
> ***
. 
. gen byte touse=1

. markout touse lnearn $X_expanded

. keep if touse
(53 observations deleted)

. 
. 
. *****************************************************************************
> ***
. ***  learners
. *****************************************************************************
> ***
. 
. global cores = 5

. 
. global rf1 min_samples_leaf(1)  max_features(sqrt) n_estimators(500)

. global rf2 min_samples_leaf(50)  max_features(sqrt) n_estimators(500)

. global rf3 min_samples_leaf(100)  max_features(sqrt) n_estimators(500)

. global grad1 n_estimators(500) n_iter_no_change(10)  

. global grad2 n_estimators(500)  

. global nnet1 hidden_layer_sizes(40 20 1 20 50) early_stopping 

. global nnet2 hidden_layer_sizes(30 30 30) early_stopping  

. 
. global pystring_reg0                                                         
>    || ///
>                                         m(ols)                               
>                            || ///
>                                         m(ols) xvars($X_simple)              
>            || ///
>                                         m(lassocv)                           
>                            || ///
>                                         m(ridgecv)                           
>                            || ///
>                                         m(lassocv)      xvars($X_cont)       
>            || ///
>                                         m(ridgecv)      xvars($X_cont)       
>            || ///
>                                         m(rf) opt($rf1)                      
>                    || ///
>                                         m(rf) opt($rf2)                      
>                    || ///
>                                         m(rf) opt($rf3)                      
>                    || ///
>                                         m(gradboost) opt($grad1)             
>            || ///
>                                         m(gradboost) opt($grad2)             
>            || ///
>                                         m(nnet) opt($nnet1)                  
>            || ///
>                                         m(nnet) opt($nnet2)                  
>            || //

. 
. global pystring_reg  $pystring_reg0 , type(reg) njobs($cores) 

.  
. global pystring_class0                                                       
>            || ///
>                                         m(logit)                             
>                            || ///
>                                         m(logit) xvars($X_simple)            
>            || ///
>                                         m(lassocv)                           
>                            || ///
>                                         m(ridgecv)                           
>                            || ///
>                                         m(lassocv)      xvars($X_cont)       
>            || ///
>                                         m(ridgecv)      xvars($X_cont)       
>            || ///
>                                         m(rf) opt($rf1)                      
>                    || ///
>                                         m(rf) opt($rf2)                      
>                    || ///
>                                         m(rf) opt($rf3)                      
>                    || ///
>                                         m(gradboost) opt($grad1)             
>            || ///
>                                         m(gradboost) opt($grad2)             
>            || ///
>                                         m(nnet) opt($nnet1)                  
>            || ///
>                                         m(nnet) opt($nnet2)                  
>            || //                   

.                                 
. global pystring_class $pystring_class0 , type(class) njobs($cores)

.                                         
. global R =1  

. global K=10 

. global L =13

.         
. *****************************************************************************
> *  
. *** ddml: estimation                                                         
>                                               ***
. *****************************************************************************
> *
. 
. if (`estimator'==1) {
. 
.         ddml init partial,  reps($R) kfolds($K)
.         ddml E[Y|X]: pystacked lnearn $X_expanded $pystring_reg
.         ddml E[D|X]: pystacked gender_r $X_expanded $pystring_reg
.         ddml crossfit, shortstack poolstack
.         ddml estimate, robust
.         
.         foreach mat in lnearn_mse gender_r_mse {
  2.                         ddml extract, show(mse)
  3.                         mat `mat' = r(`mat')
  4.                         mat list `mat'
  5.                                 preserve
  6.                                 svmat `mat'
  7.                                 keep `mat'*
  8.                                 keep if _n<=$L
  9.                                 gen stack_type = "conventional" if _n==1
 10.                                 replace stack_type = "pooled" if _n==2
 11.                                 replace stack_type = "short" if _n==3
 12.                                 gen model = "plm"
 13.                                 list if _n<=$L
 14.                                 save `folder'/`mat'_plm_mse, replace
 15.                                 restore 
 16.         }       
. 
.         cap drop mse_*
.         foreach var of varlist Y1_* {
  2.                  cap drop sqerr_`var'
  3.                  gen double sqerr_`var'=(lnearn-`var')^2
  4.                  sum sqerr_`var', meanonly
  5.                  gen double mse_`var'=r(mean) if _n ==1 
  6.         }
.         foreach var of varlist D1_* {
  2.                  cap drop sqerr_`var'
  3.                  gen double sqerr_`var'=(gender_r-`var')^2
  4.                  sum sqerr_`var', meanonly
  5.                  gen double mse_`var'=r(mean) if _n ==1 
  6.         }
.         preserve
.                 keep mse_*
.                 keep if _n==1
.                 save `folder'/plm_mse, replace
.         restore
.         cap drop mse_*
. 
.         ** initialize results file
.         regsave gender_r using `folder'/results.dta, ci addlabel(model,partia
> l,seed,`seed',final,init,learner,-99) replace
. 
.         foreach final in nnls1 singlebest ols avg {
  2. 
.                 ddml estimate, robust finalest(`final')
  3.         
.                         // regular stacking results
.                         ddml estimate, mname(m0) spec(st) replay  
  4.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,partial,seed,`seed',final,`final',learner,-1) append
  5.                         
.                         // shortstacking results
.                         ddml estimate, mname(m0) spec(ss) replay 
  6.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,partial,seed,`seed',final,`final',learner,-2) append
  7.                         
.                         // poolstacking results
.                         ddml estimate, mname(m0) spec(ps) replay  
  8.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,partial,seed,`seed',final,`final',learner,-3) append     
  9.                 
.                         // pystacked weights
.                         ddml extract, show(stweights)   
 10.                         foreach mat in Y1_pystacked_w_mn D1_pystacked_w_mn
>  {
 11.                                         ddml extract, show(stweights)   
 12.                                         mat `mat' = r(`mat')
 13.                                         mat list `mat'
 14.                                                 preserve
 15.                                                 svmat `mat'
 16.                                                 keep `mat'*
 17.                                                 list if _n<=4
 18.                                                 save `folder'/`mat'_`final
> '_regular, replace
 19.                                                 restore
 20.                         }       
 21.                         // shortstacked weights
.                         ddml extract, show(ssweights)
 22.                         foreach mat in Y_lnearn_ss D_gender_r_ss {
 23.                                         qui ddml extract, show(ssweights)
 24.                                         mat `mat' = r(`mat')
 25.                                         mat list `mat'
 26.                                                 preserve
 27.                                                 svmat `mat'
 28.                                                 keep `mat'*
 29.                                                 list if _n<=4
 30.                                                 save `folder'/`mat'_`final
> '_short, replace
 31.                                                 restore
 32.                         }       
 33.                         // poolstacked weights
. 
.                         foreach mat in Y_lnearn_ps D_gender_r_ps {
 34.                                         qui ddml extract, show(psweights)
 35.                                         mat `mat' = r(`mat')
 36.                                         mat list `mat'
 37.                                                 preserve
 38.                                                 svmat `mat'
 39.                                                 keep `mat'*
 40.                                                 list if _n<=4
 41.                                                 save `folder'/`mat'_`final
> '_pooled, replace
 42.                                                 restore
 43.                         }       
 44.         
.         }
. 
.         forvalues i = 1(1)$L {
  2.                         ddml estimate, y(Y1_pystacked_L`i'_1) ///
>                                                         d(D1_pystacked_L`i'_1
> ) robust
  3.                         regsave gender_r using `folder'/results.dta, ci //
> /
>                                                 addlabel(model,partial,seed,`
> seed',final,indiv,learner,`i') ///
>                                                 append
  4.         }
. 
. }

.         
. *****************************************************************************
> *  
. *** interactive: estimation                                                  
>                                       ***
. *****************************************************************************
> *
.         
. if (`estimator'==2) {   
. 
.         ddml init interactive, kfolds($K) reps($R)
.         ddml E[Y|X,D]: pystacked lnearn $X_expanded $pystring_reg
Learner Y1_pystacked added successfully.
.         ddml E[D|X]: pystacked gender_r $X_expanded $pystring_class
Learner D1_pystacked added successfully.
.         ddml crossfit, shortstack poolstack
Cross-fitting E[y|X,D] equation: lnearn
Cross-fitting fold 1 2 3 4 5 6 7 8 9 10 ...completed cross-fitting...completed 
> short-stacking...completed pooled-stacking
Cross-fitting E[D|X] equation: gender_r
Cross-fitting fold 1 2 3 4 5 6 7 8 9 10 ...completed cross-fitting...completed 
> short-stacking...completed pooled-stacking
.         ddml estimate, robust atet


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.086    (0.022)
  ss  1  [shortstack]          [ss]          [ss]    -0.080    (0.023)
  ps  1   [poolstack]          [ps]          [ps]    -0.085    (0.022)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0800461    .023393    -3.42   0.001    -.1258956   -.0341966
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 4 propensity scores trimmed to lower limit .01.

. 
.         cap drop mse_*
.         foreach var of varlist Y1_pystacked0* {
  2.                  cap drop sqerr_`var'
  3.                  gen double sqerr_`var'=(lnearn-`var')^2 if gender_r==0
  4.                  sum sqerr_`var' if gender_r==0, meanonly
  5.                  gen double mse_`var'=r(mean) if _n ==1 
  6.         }
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
.         foreach var of varlist Y1_pystacked1* {
  2.                  cap drop sqerr_`var'
  3.                  gen double sqerr_`var'=(lnearn-`var')^2 if gender_r==1
  4.                  sum sqerr_`var' if gender_r==1, meanonly
  5.                  gen double mse_`var'=r(mean) if _n ==1 
  6.         }
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
.         foreach var of varlist D1_* {
  2.                  cap drop sqerr_`var'
  3.                  gen double sqerr_`var'=(gender_r-`var')^2
  4.                  sum sqerr_`var', meanonly
  5.                  gen double mse_`var'=r(mean) if _n ==1 
  6.         }
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
.         preserve
.                 keep mse_*
.                 keep if _n==1
(4,835 observations deleted)
.                 save `folder'/inter_mse, replace
(note: file out_8756/inter_mse.dta not found)
file out_8756/inter_mse.dta saved
.         restore
.         cap drop mse_*
.         
.         local mat gender_r_mse
.                         ddml extract, show(mse)

MSEs for gender_r:
                 rep   full smp      fold 1      fold 2      fold 3      fold 4
>       fold 5      fold 6      fold 7      fold 8      fold 9     fold 10 
    D1_pystacked   1      0.156       0.145       0.173       0.158       0.157
>        0.160       0.149       0.150       0.149       0.160       0.158  
   D_gender_r_ps   1      0.155       0.145       0.173       0.158       0.156
>        0.159       0.149       0.150       0.148       0.159       0.158  
   D_gender_r_ss   1      0.155       0.144       0.172       0.157       0.156
>        0.159       0.148       0.150       0.148       0.159       0.159  

MSEs for lnearn:
                D=  rep   full smp      fold 1      fold 2      fold 3      fol
> d 4      fold 5      fold 6      fold 7      fold 8      fold 9     fold 10 
    Y1_pystacked 0    1      0.228       0.236       0.180       0.205       0.
> 506       0.179       0.222       0.207       0.189       0.176       0.177  
    Y1_pystacked 1    1      0.172       0.183       0.139       0.201       0.
> 187       0.139       0.131       0.358       0.114       0.130       0.115  
     Y_lnearn_ps 0    1      8.292       8.427       8.408       8.322       8.
> 266       8.303       8.426       8.272       8.129       8.227       8.163  
     Y_lnearn_ps 1    1      7.497       7.479       7.406       7.486       7.
> 519       7.442       7.518       7.466       7.638       7.556       7.473  
     Y_lnearn_ss 0    1      0.225       0.217       0.180       0.206       0.
> 503       0.180       0.218       0.202       0.190       0.172       0.176  
     Y_lnearn_ss 1    1      0.171       0.182       0.141       0.201       0.
> 187       0.139       0.130       0.355       0.113       0.130       0.116  
.                         mat `mat' = r(`mat')
.                         mat list `mat'

gender_r_mse[3,12]
                      rep  full_sample        fold1        fold2        fold3
D1_pystacked            1    .15587805    .14476012     .1731626    .15808628
D_gender_r~s            1    .15541104     .1445158    .17259241    .15753002
D_gender_r~s            1     .1553032    .14427885     .1721915    .15705628

                    fold4        fold5        fold6        fold7        fold8
D1_pystacked    .15697178    .15950586     .1494367    .15038913     .1487546
D_gender_r~s    .15598406    .15925754    .14876115    .14993274    .14828846
D_gender_r~s     .1563235    .15895661     .1482744    .14961218    .14823483

                    fold9       fold10
D1_pystacked    .15962003     .1580469
D_gender_r~s    .15913261    .15806907
D_gender_r~s    .15948707    .15856852
.                                 preserve
.                                 svmat `mat'
.                                 keep `mat'*
.                                 keep if _n<=$L
(4,823 observations deleted)
.                                 gen stack_type = "conventional" if _n==1
(12 missing values generated)
.                                 replace stack_type = "pooled" if _n==2
(1 real change made)
.                                 replace stack_type = "short" if _n==3
(1 real change made)
.                                 gen model = "interactive"
.                                 list if _n<=$L

     +-----------------------------------------------------------------+
  1. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        1 | .1558781 | .1447601 | .1731626 | .1580863 | .1569718 |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     | .1595059 | .1494367 | .1503891 | .1487546 |   .15962 | .1580469 |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |          conventional          |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  2. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        1 |  .155411 | .1445158 | .1725924 |   .15753 | .1559841 |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     | .1592575 | .1487612 | .1499327 | .1482885 | .1591326 | .1580691 |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                pooled          |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  3. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        1 | .1553032 | .1442788 | .1721915 | .1570563 | .1563235 |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     | .1589566 | .1482744 | .1496122 | .1482348 | .1594871 | .1585685 |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                 short          |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  4. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  5. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  6. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  7. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  8. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  9. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 10. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 11. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 12. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 13. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+
.                                 save `folder'/`mat'_inter_gender_mse, replace
(note: file out_8756/gender_r_mse_inter_gender_mse.dta not found)
file out_8756/gender_r_mse_inter_gender_mse.dta saved
.                                 restore 
.                                 
.         local mat lnearn_mse
.                         ddml extract, show(mse)

MSEs for gender_r:
                 rep   full smp      fold 1      fold 2      fold 3      fold 4
>       fold 5      fold 6      fold 7      fold 8      fold 9     fold 10 
    D1_pystacked   1      0.156       0.145       0.173       0.158       0.157
>        0.160       0.149       0.150       0.149       0.160       0.158  
   D_gender_r_ps   1      0.155       0.145       0.173       0.158       0.156
>        0.159       0.149       0.150       0.148       0.159       0.158  
   D_gender_r_ss   1      0.155       0.144       0.172       0.157       0.156
>        0.159       0.148       0.150       0.148       0.159       0.159  

MSEs for lnearn:
                D=  rep   full smp      fold 1      fold 2      fold 3      fol
> d 4      fold 5      fold 6      fold 7      fold 8      fold 9     fold 10 
    Y1_pystacked 0    1      0.228       0.236       0.180       0.205       0.
> 506       0.179       0.222       0.207       0.189       0.176       0.177  
    Y1_pystacked 1    1      0.172       0.183       0.139       0.201       0.
> 187       0.139       0.131       0.358       0.114       0.130       0.115  
     Y_lnearn_ps 0    1      8.292       8.427       8.408       8.322       8.
> 266       8.303       8.426       8.272       8.129       8.227       8.163  
     Y_lnearn_ps 1    1      7.497       7.479       7.406       7.486       7.
> 519       7.442       7.518       7.466       7.638       7.556       7.473  
     Y_lnearn_ss 0    1      0.225       0.217       0.180       0.206       0.
> 503       0.180       0.218       0.202       0.190       0.172       0.176  
     Y_lnearn_ss 1    1      0.171       0.182       0.141       0.201       0.
> 187       0.139       0.130       0.355       0.113       0.130       0.116  
.                         mat `mat' = r(`mat')
.                         mat list `mat'

lnearn_mse[6,13]
                    D=0/1          rep  full_sample        fold1        fold2
Y1_pystacked            0            1    .22791682    .23570511    .18040722
Y1_pystacked            1            1    .17174694     .1827728    .13893217
 Y_lnearn_ps            0            1     8.291815    8.4266094    8.4080686
 Y_lnearn_ps            1            1    7.4973944    7.4788477    7.4061544
 Y_lnearn_ss            0            1    .22471954    .21733162    .18031175
 Y_lnearn_ss            1            1     .1713416    .18204969    .14092178

                    fold3        fold4        fold5        fold6        fold7
Y1_pystacked    .20497942    .50580075    .17909434    .22233212    .20702884
Y1_pystacked    .20146356    .18739032     .1385462    .13116423    .35768965
 Y_lnearn_ps    8.3218056    8.2656766    8.3030244    8.4260889    8.2722438
 Y_lnearn_ps    7.4862865    7.5194194    7.4422534    7.5178736    7.4663719
 Y_lnearn_ss    .20604775    .50327008    .18018027    .21837798     .2015187
 Y_lnearn_ss    .20071177     .1874444    .13916719     .1298825    .35530551

                    fold8        fold9       fold10
Y1_pystacked    .18947391    .17605117    .17658252
Y1_pystacked    .11425068    .13024432    .11544938
 Y_lnearn_ps    8.1285573    8.2268945    8.1633082
 Y_lnearn_ps    7.6375734    7.5557073    7.4733382
 Y_lnearn_ss    .18985457    .17178424    .17557503
 Y_lnearn_ss    .11285509    .13019087    .11555981
.                                 preserve
.                                 svmat `mat'
.                                 keep `mat'*
.                                 keep if _n<=(2*$L)
(4,810 observations deleted)
.                                 gen stack_type = "conventional" if _n<=2
(24 missing values generated)
.                                 replace stack_type = "pooled" if _n>=3 & _n<=
> 4
(2 real changes made)
.                                 replace stack_type = "short" if _n>4
(22 real changes made)
.                                 gen model = "interactive"
.                                 list if _n<=(2*$L)

     +-----------------------------------------------------------------+
  1. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        0 |        1 | .2279168 | .2357051 | .1804072 | .2049794 |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     | .5058007 | .1790943 | .2223321 | .2070288 | .1894739 | .1760512 |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |     .1765825     |     conventional      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  2. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        1 |        1 | .1717469 | .1827728 | .1389322 | .2014636 |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     | .1873903 | .1385462 | .1311642 | .3576896 | .1142507 | .1302443 |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |     .1154494     |     conventional      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  3. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        0 |        1 | 8.291815 | 8.426609 | 8.408069 | 8.321806 |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     | 8.265676 | 8.303024 | 8.426089 | 8.272243 | 8.128557 | 8.226894 |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |     8.163308     |           pooled      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  4. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        1 |        1 | 7.497395 | 7.478848 | 7.406154 | 7.486287 |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     | 7.519419 | 7.442254 | 7.517874 | 7.466372 | 7.637573 | 7.555707 |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |     7.473338     |           pooled      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  5. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        0 |        1 | .2247195 | .2173316 | .1803117 | .2060477 |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     | .5032701 | .1801803 |  .218378 | .2015187 | .1898546 | .1717842 |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |      .175575     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  6. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        1 |        1 | .1713416 | .1820497 | .1409218 | .2007118 |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     | .1874444 | .1391672 | .1298825 | .3553055 | .1128551 | .1301909 |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |     .1155598     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  7. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  8. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  9. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 10. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 11. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 12. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 13. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 14. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 15. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 16. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 17. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 18. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 19. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 20. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 21. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 22. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 23. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 24. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 25. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 26. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+
.                                 save `folder'/`mat'_inter_lnearn_mse, replace
(note: file out_8756/lnearn_mse_inter_lnearn_mse.dta not found)
file out_8756/lnearn_mse_inter_lnearn_mse.dta saved
.                                 restore 
.         
.         foreach final in nnls1 singlebest ols avg {
  2. 
.                 ddml estimate, robust finalest(`final') atet
  3.         
.                         // regular stacking results
.                         ddml estimate, mname(m0) spec(st) replay atet
  4.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,interactive,seed,`seed',final,`final',learner,-1) append
  5.                         
.                         // shortstacking results
.                         ddml estimate, mname(m0) spec(ss) replay atet
  6.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,interactive,seed,`seed',final,`final',learner,-2) append
  7.                         
.                         // poolstacking results
.                         ddml estimate, mname(m0) spec(ps) replay atet
  8.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,interactive,seed,`seed',final,`final',learner,-3) append
  9.                 
.                         // pystacked weights
.                         ddml extract, show(stweights)
 10.                         foreach mat in Y1_pystacked_w_mn D1_pystacked_w_mn
>  {
 11.                                         ddml extract, show(stweights)
 12.                                         mat `mat' = r(`mat')
 13.                                         mat list `mat'
 14.                                                 preserve
 15.                                                 svmat `mat'
 16.                                                 keep `mat'*
 17.                                                 list if _n<=8
 18.                                                 save `folder'/`mat'_`final
> '_regular_ia, replace
 19.                                                 restore
 20.                         }       
 21.                         // shortstacked weights
.                         ddml extract, show(ssweights)
 22.                         foreach mat in Y_lnearn_ss D_gender_r_ss {
 23.                                         ddml extract, show(ssweights)
 24.                                         mat `mat' = r(`mat')
 25.                                         mat list `mat'
 26.                                                 preserve
 27.                                                 svmat `mat'
 28.                                                 keep `mat'*
 29.                                                 list if _n<=8
 30.                                                 save `folder'/`mat'_`final
> '_short_ia, replace
 31.                                                 restore
 32.                         }       
 33.                         // poolstacked weights
.                         ddml extract, show(psweights)
 34.                         foreach mat in Y_lnearn_ps D_gender_r_ps {
 35.                                         ddml extract, show(psweights)
 36.                                         mat `mat' = r(`mat')
 37.                                         mat list `mat'
 38.                                                 preserve
 39.                                                 svmat `mat'
 40.                                                 keep `mat'*
 41.                                                 list if _n<=8
 42.                                                 save `folder'/`mat'_`final
> '_pooled_ia, replace
 43.                                                 restore
 44.                         }       
 45.         
.         }


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.086    (0.022)
  ss  1  [shortstack]          [ss]          [ss]    -0.080    (0.023)
  ps  1   [poolstack]          [ps]          [ps]    -0.085    (0.022)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0800461    .023393    -3.42   0.001    -.1258956   -.0341966
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 4 propensity scores trimmed to lower limit .01.



Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.086    (0.022)
  ss  1  [shortstack]          [ss]          [ss]    -0.080    (0.023)
  ps  1   [poolstack]          [ps]          [ps]    -0.085    (0.022)

Stacking DDML model (ATET)
E[y|X,D=0]   = Y1_pystacked0_1                     Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1
E[D|X]       = D1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0863401   .0224024    -3.85   0.000    -.1302479   -.0424323
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 3 propensity scores trimmed to lower limit .01.

(note: variable final was str5, now str10 to accommodate using data's values)
file out_8756/results.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  ss  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.080    (0.023)
  ss  1  [shortstack]          [ss]          [ss]    -0.080    (0.023)
  ps  1   [poolstack]          [ps]          [ps]    -0.085    (0.022)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0800461    .023393    -3.42   0.001    -.1258956   -.0341966
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 4 propensity scores trimmed to lower limit .01.

(note: variable final was str5, now str10 to accommodate using data's values)
file out_8756/results.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  ps  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.085    (0.022)
  ss  1  [shortstack]          [ss]          [ss]    -0.080    (0.023)
  ps  1   [poolstack]          [ps]          [ps]    -0.085    (0.022)

Poolstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ps0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ps1
E[D|X]       = D_gender_r_ps_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0850341   .0219026    -3.88   0.000    -.1279624   -.0421058
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 5 propensity scores trimmed to lower limit .01.

(note: variable final was str5, now str10 to accommodate using data's values)
file out_8756/results.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .25475798    .25475798
    logit            2    8.442e-17    8.442e-17
  lassocv            3    .13131362    .13131362
  ridgecv            4    .02538287    .02538287
  lassocv            5    .00697585    .00697585
  ridgecv            6    .01080453    .01080453
       rf            7    .28304222    .28304222
       rf            8    1.372e-17    1.372e-17
       rf            9    2.375e-17    2.375e-17
gradboost           10    .03138802    .03138802
gradboost           11     .2254507     .2254507
     nnet           12    1.805e-17    1.805e-17
     nnet           13    .03088422    .03088422

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .02117921    .02117921
      ols            2            0    .00559431    .00559431
  lassocv            3            0    .17123026    .17123026
  ridgecv            4            0    .16723868    .16723868
  lassocv            5            0    3.551e-17    3.551e-17
  ridgecv            6            0     .0162353     .0162353
       rf            7            0    .44551617    .44551617
       rf            8            0    9.127e-17    9.127e-17
       rf            9            0    1.291e-16    1.291e-16
gradboost           10            0    .01563051    .01563051
gradboost           11            0    .13913059    .13913059
     nnet           12            0     .0093285     .0093285
     nnet           13            0    .00891646    .00891646
      ols            1            1    .00597831    .00597831
      ols            2            1    .00155753    .00155753
  lassocv            3            1    .12523953    .12523953
  ridgecv            4            1    .06952244    .06952244
  lassocv            5            1     .1336733     .1336733
  ridgecv            6            1    .05859166    .05859166
       rf            7            1    .50404016    .50404016
       rf            8            1    1.663e-17    1.663e-17
       rf            9            1    5.504e-17    5.504e-17
gradboost           10            1    4.179e-18    4.179e-18
gradboost           11            1    .05697489    .05697489
     nnet           12            1    .02654436    .02654436
     nnet           13            1    .01787783    .01787783

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .25475798    .25475798
    logit            2    8.442e-17    8.442e-17
  lassocv            3    .13131362    .13131362
  ridgecv            4    .02538287    .02538287
  lassocv            5    .00697585    .00697585
  ridgecv            6    .01080453    .01080453
       rf            7    .28304222    .28304222
       rf            8    1.372e-17    1.372e-17
       rf            9    2.375e-17    2.375e-17
gradboost           10    .03138802    .03138802
gradboost           11     .2254507     .2254507
     nnet           12    1.805e-17    1.805e-17
     nnet           13    .03088422    .03088422

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .02117921    .02117921
      ols            2            0    .00559431    .00559431
  lassocv            3            0    .17123026    .17123026
  ridgecv            4            0    .16723868    .16723868
  lassocv            5            0    3.551e-17    3.551e-17
  ridgecv            6            0     .0162353     .0162353
       rf            7            0    .44551617    .44551617
       rf            8            0    9.127e-17    9.127e-17
       rf            9            0    1.291e-16    1.291e-16
gradboost           10            0    .01563051    .01563051
gradboost           11            0    .13913059    .13913059
     nnet           12            0     .0093285     .0093285
     nnet           13            0    .00891646    .00891646
      ols            1            1    .00597831    .00597831
      ols            2            1    .00155753    .00155753
  lassocv            3            1    .12523953    .12523953
  ridgecv            4            1    .06952244    .06952244
  lassocv            5            1     .1336733     .1336733
  ridgecv            6            1    .05859166    .05859166
       rf            7            1    .50404016    .50404016
       rf            8            1    1.663e-17    1.663e-17
       rf            9            1    5.504e-17    5.504e-17
gradboost           10            1    4.179e-18    4.179e-18
gradboost           11            1    .05697489    .05697489
     nnet           12            1    .02654436    .02654436
     nnet           13            1    .01787783    .01787783

Y1_pystacked_w_mn[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .02117921    .02117921
      ols            2            0    .00559431    .00559431
  lassocv            3            0    .17123026    .17123026
  ridgecv            4            0    .16723868    .16723868
  lassocv            5            0    3.551e-17    3.551e-17
  ridgecv            6            0     .0162353     .0162353
       rf            7            0    .44551617    .44551617
       rf            8            0    9.127e-17    9.127e-17
       rf            9            0    1.291e-16    1.291e-16
gradboost           10            0    .01563051    .01563051
gradboost           11            0    .13913059    .13913059
     nnet           12            0     .0093285     .0093285
     nnet           13            0    .00891646    .00891646
      ols            1            1    .00597831    .00597831
      ols            2            1    .00155753    .00155753
  lassocv            3            1    .12523953    .12523953
  ridgecv            4            1    .06952244    .06952244
  lassocv            5            1     .1336733     .1336733
  ridgecv            6            1    .05859166    .05859166
       rf            7            1    .50404016    .50404016
       rf            8            1    1.663e-17    1.663e-17
       rf            9            1    5.504e-17    5.504e-17
gradboost           10            1    4.179e-18    4.179e-18
gradboost           11            1    .05697489    .05697489
     nnet           12            1    .02654436    .02654436
     nnet           13            1    .01787783    .01787783

      +-------------------------------------------+
      | Y1_pys~1   Y1_pys~2   Y1_pys~3   Y1_pys~4 |
      |-------------------------------------------|
   1. |        1          0   .0211792   .0211792 |
   2. |        2          0   .0055943   .0055943 |
   3. |        3          0   .1712303   .1712303 |
   4. |        4          0   .1672387   .1672387 |
   5. |        5          0   3.55e-17   3.55e-17 |
      |-------------------------------------------|
   6. |        6          0   .0162353   .0162353 |
   7. |        7          0   .4455162   .4455162 |
   8. |        8          0   9.13e-17   9.13e-17 |
      +-------------------------------------------+
(note: file out_8756/Y1_pystacked_w_mn_nnls1_regular_ia.dta not found)
file out_8756/Y1_pystacked_w_mn_nnls1_regular_ia.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .25475798    .25475798
    logit            2    8.442e-17    8.442e-17
  lassocv            3    .13131362    .13131362
  ridgecv            4    .02538287    .02538287
  lassocv            5    .00697585    .00697585
  ridgecv            6    .01080453    .01080453
       rf            7    .28304222    .28304222
       rf            8    1.372e-17    1.372e-17
       rf            9    2.375e-17    2.375e-17
gradboost           10    .03138802    .03138802
gradboost           11     .2254507     .2254507
     nnet           12    1.805e-17    1.805e-17
     nnet           13    .03088422    .03088422

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .02117921    .02117921
      ols            2            0    .00559431    .00559431
  lassocv            3            0    .17123026    .17123026
  ridgecv            4            0    .16723868    .16723868
  lassocv            5            0    3.551e-17    3.551e-17
  ridgecv            6            0     .0162353     .0162353
       rf            7            0    .44551617    .44551617
       rf            8            0    9.127e-17    9.127e-17
       rf            9            0    1.291e-16    1.291e-16
gradboost           10            0    .01563051    .01563051
gradboost           11            0    .13913059    .13913059
     nnet           12            0     .0093285     .0093285
     nnet           13            0    .00891646    .00891646
      ols            1            1    .00597831    .00597831
      ols            2            1    .00155753    .00155753
  lassocv            3            1    .12523953    .12523953
  ridgecv            4            1    .06952244    .06952244
  lassocv            5            1     .1336733     .1336733
  ridgecv            6            1    .05859166    .05859166
       rf            7            1    .50404016    .50404016
       rf            8            1    1.663e-17    1.663e-17
       rf            9            1    5.504e-17    5.504e-17
gradboost           10            1    4.179e-18    4.179e-18
gradboost           11            1    .05697489    .05697489
     nnet           12            1    .02654436    .02654436
     nnet           13            1    .01787783    .01787783

D1_pystacked_w_mn[13,3]
               learner  mean_weight        rep_1
    logit            1    .25475798    .25475798
    logit            2    8.442e-17    8.442e-17
  lassocv            3    .13131362    .13131362
  ridgecv            4    .02538287    .02538287
  lassocv            5    .00697585    .00697585
  ridgecv            6    .01080453    .01080453
       rf            7    .28304222    .28304222
       rf            8    1.372e-17    1.372e-17
       rf            9    2.375e-17    2.375e-17
gradboost           10    .03138802    .03138802
gradboost           11     .2254507     .2254507
     nnet           12    1.805e-17    1.805e-17
     nnet           13    .03088422    .03088422

      +--------------------------------+
      | D1_pys~1   D1_pys~2   D1_pys~3 |
      |--------------------------------|
   1. |        1    .254758    .254758 |
   2. |        2   8.44e-17   8.44e-17 |
   3. |        3   .1313136   .1313136 |
   4. |        4   .0253829   .0253829 |
   5. |        5   .0069759   .0069759 |
      |--------------------------------|
   6. |        6   .0108045   .0108045 |
   7. |        7   .2830422   .2830422 |
   8. |        8   1.37e-17   1.37e-17 |
      +--------------------------------+
(note: file out_8756/D1_pystacked_w_mn_nnls1_regular_ia.dta not found)
file out_8756/D1_pystacked_w_mn_nnls1_regular_ia.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1     .2665012     .2665012
    logit            2            0            0
  lassocv            3    .00245737    .00245737
  ridgecv            4    .07516094    .07516094
  lassocv            5    .01805439    .01805439
  ridgecv            6            0            0
       rf            7    .29085879    .29085879
       rf            8    8.225e-17    8.225e-17
       rf            9    7.545e-17    7.545e-17
gradboost           10            0            0
gradboost           11    .28469901    .28469901
     nnet           12    2.105e-16    2.105e-16
     nnet           13    .06226831    .06226831

short-stacked weights across resamples for lnearn
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0    2.194e-16    2.194e-16
  lassocv            3            0    .00440084    .00440084
  ridgecv            4            0    .25811804    .25811804
  lassocv            5            0    .03412971    .03412971
  ridgecv            6            0            0            0
       rf            7            0    .43135448    .43135448
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0    .24899598    .24899598
     nnet           12            0            0            0
     nnet           13            0    .02300095    .02300095
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1    .04587313    .04587313
  ridgecv            4            1            0            0
  lassocv            5            1    .36505377    .36505377
  ridgecv            6            1    1.854e-17    1.854e-17
       rf            7            1    .45553238    .45553238
       rf            8            1            0            0
       rf            9            1    1.729e-17    1.729e-17
gradboost           10            1    1.562e-17    1.562e-17
gradboost           11            1    .11937258    .11937258
     nnet           12            1            0            0
     nnet           13            1    .01416814    .01416814

short-stacked weights across resamples for gender_r
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1     .2665012     .2665012
    logit            2            0            0
  lassocv            3    .00245737    .00245737
  ridgecv            4    .07516094    .07516094
  lassocv            5    .01805439    .01805439
  ridgecv            6            0            0
       rf            7    .29085879    .29085879
       rf            8    8.225e-17    8.225e-17
       rf            9    7.545e-17    7.545e-17
gradboost           10            0            0
gradboost           11    .28469901    .28469901
     nnet           12    2.105e-16    2.105e-16
     nnet           13    .06226831    .06226831

short-stacked weights across resamples for lnearn
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0    2.194e-16    2.194e-16
  lassocv            3            0    .00440084    .00440084
  ridgecv            4            0    .25811804    .25811804
  lassocv            5            0    .03412971    .03412971
  ridgecv            6            0            0            0
       rf            7            0    .43135448    .43135448
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0    .24899598    .24899598
     nnet           12            0            0            0
     nnet           13            0    .02300095    .02300095
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1    .04587313    .04587313
  ridgecv            4            1            0            0
  lassocv            5            1    .36505377    .36505377
  ridgecv            6            1    1.854e-17    1.854e-17
       rf            7            1    .45553238    .45553238
       rf            8            1            0            0
       rf            9            1    1.729e-17    1.729e-17
gradboost           10            1    1.562e-17    1.562e-17
gradboost           11            1    .11937258    .11937258
     nnet           12            1            0            0
     nnet           13            1    .01416814    .01416814

Y_lnearn_ss[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0    2.194e-16    2.194e-16
  lassocv            3            0    .00440084    .00440084
  ridgecv            4            0    .25811804    .25811804
  lassocv            5            0    .03412971    .03412971
  ridgecv            6            0            0            0
       rf            7            0    .43135448    .43135448
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0    .24899598    .24899598
     nnet           12            0            0            0
     nnet           13            0    .02300095    .02300095
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1    .04587313    .04587313
  ridgecv            4            1            0            0
  lassocv            5            1    .36505377    .36505377
  ridgecv            6            1    1.854e-17    1.854e-17
       rf            7            1    .45553238    .45553238
       rf            8            1            0            0
       rf            9            1    1.729e-17    1.729e-17
gradboost           10            1    1.562e-17    1.562e-17
gradboost           11            1    .11937258    .11937258
     nnet           12            1            0            0
     nnet           13            1    .01416814    .01416814

      +-------------------------------------------------------------------+
      | Y_lne~1_1   Y_lne~0_1   Y_lne~s1   Y_lnea~2   Y_lnea~3   Y_lnea~4 |
      |-------------------------------------------------------------------|
   1. | 2.5275143   2.7053215          1          0          0          0 |
   2. | 2.9861861   3.1976636          2          0   2.19e-16   2.19e-16 |
   3. | 2.8076659   2.8780473          3          0   .0044008   .0044008 |
   4. | 2.4819866   2.6137085          4          0    .258118    .258118 |
   5. | 3.0915314   3.1795174          5          0   .0341297   .0341297 |
      |-------------------------------------------------------------------|
   6. | 2.5564471   2.6612353          6          0          0          0 |
   7. | 2.4266868   2.2786461          7          0   .4313545   .4313545 |
   8. | 2.6784588    2.689415          8          0          0          0 |
      +-------------------------------------------------------------------+
(note: file out_8756/Y_lnearn_ss_nnls1_short_ia.dta not found)
file out_8756/Y_lnearn_ss_nnls1_short_ia.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1     .2665012     .2665012
    logit            2            0            0
  lassocv            3    .00245737    .00245737
  ridgecv            4    .07516094    .07516094
  lassocv            5    .01805439    .01805439
  ridgecv            6            0            0
       rf            7    .29085879    .29085879
       rf            8    8.225e-17    8.225e-17
       rf            9    7.545e-17    7.545e-17
gradboost           10            0            0
gradboost           11    .28469901    .28469901
     nnet           12    2.105e-16    2.105e-16
     nnet           13    .06226831    .06226831

short-stacked weights across resamples for lnearn
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0    2.194e-16    2.194e-16
  lassocv            3            0    .00440084    .00440084
  ridgecv            4            0    .25811804    .25811804
  lassocv            5            0    .03412971    .03412971
  ridgecv            6            0            0            0
       rf            7            0    .43135448    .43135448
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0    .24899598    .24899598
     nnet           12            0            0            0
     nnet           13            0    .02300095    .02300095
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1    .04587313    .04587313
  ridgecv            4            1            0            0
  lassocv            5            1    .36505377    .36505377
  ridgecv            6            1    1.854e-17    1.854e-17
       rf            7            1    .45553238    .45553238
       rf            8            1            0            0
       rf            9            1    1.729e-17    1.729e-17
gradboost           10            1    1.562e-17    1.562e-17
gradboost           11            1    .11937258    .11937258
     nnet           12            1            0            0
     nnet           13            1    .01416814    .01416814

D_gender_r_ss[13,3]
               learner  mean_weight        rep_1
    logit            1     .2665012     .2665012
    logit            2            0            0
  lassocv            3    .00245737    .00245737
  ridgecv            4    .07516094    .07516094
  lassocv            5    .01805439    .01805439
  ridgecv            6            0            0
       rf            7    .29085879    .29085879
       rf            8    8.225e-17    8.225e-17
       rf            9    7.545e-17    7.545e-17
gradboost           10            0            0
gradboost           11    .28469901    .28469901
     nnet           12    2.105e-16    2.105e-16
     nnet           13    .06226831    .06226831

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .75954501          1   .2665012   .2665012 |
   2. | .41361816          2          0          0 |
   3. | .09602006          3   .0024574   .0024574 |
   4. | .17853484          4   .0751609   .0751609 |
   5. | .58528097          5   .0180544   .0180544 |
      |--------------------------------------------|
   6. |  .8651174          6          0          0 |
   7. | .82633356          7   .2908588   .2908588 |
   8. | .84080761          8   8.23e-17   8.23e-17 |
      +--------------------------------------------+
(note: file out_8756/D_gender_r_ss_nnls1_short_ia.dta not found)
file out_8756/D_gender_r_ss_nnls1_short_ia.dta saved

pool-stacked weights across resamples for gender_r
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .26020572    .26020572
    logit            2            0            0
  lassocv            3    .16792388    .16792388
  ridgecv            4    .01367852    .01367852
  lassocv            5    4.081e-16    4.081e-16
  ridgecv            6    4.097e-16    4.097e-16
       rf            7    .29299223    .29299223
       rf            8            0            0
       rf            9    5.770e-16    5.770e-16
gradboost           10            0            0
gradboost           11    .23692334    .23692334
     nnet           12            0            0
     nnet           13     .0282763     .0282763

pool-stacked weights across resamples for lnearn
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .01944531    .01944531
      ols            2            0            0            0
  lassocv            3            0    .18244935    .18244935
  ridgecv            4            0     .1853034     .1853034
  lassocv            5            0            0            0
  ridgecv            6            0    5.289e-16    5.289e-16
       rf            7            0    .46198985    .46198985
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0     .1454019     .1454019
     nnet           12            0            0            0
     nnet           13            0    .00541017    .00541017
      ols            1            1    1.378e-16    1.378e-16
      ols            2            1    6.200e-17    6.200e-17
  lassocv            3            1    .26556963    .26556963
  ridgecv            4            1    .07992089    .07992089
  lassocv            5            1            0            0
  ridgecv            6            1    .05219205    .05219205
       rf            7            1    .52550237    .52550237
       rf            8            1    1.497e-16    1.497e-16
       rf            9            1    5.785e-16    5.785e-16
gradboost           10            1    5.682e-17    5.682e-17
gradboost           11            1    .06652058    .06652058
     nnet           12            1            0            0
     nnet           13            1    .01029447    .01029447

pool-stacked weights across resamples for gender_r
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .26020572    .26020572
    logit            2            0            0
  lassocv            3    .16792388    .16792388
  ridgecv            4    .01367852    .01367852
  lassocv            5    4.081e-16    4.081e-16
  ridgecv            6    4.097e-16    4.097e-16
       rf            7    .29299223    .29299223
       rf            8            0            0
       rf            9    5.770e-16    5.770e-16
gradboost           10            0            0
gradboost           11    .23692334    .23692334
     nnet           12            0            0
     nnet           13     .0282763     .0282763

pool-stacked weights across resamples for lnearn
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .01944531    .01944531
      ols            2            0            0            0
  lassocv            3            0    .18244935    .18244935
  ridgecv            4            0     .1853034     .1853034
  lassocv            5            0            0            0
  ridgecv            6            0    5.289e-16    5.289e-16
       rf            7            0    .46198985    .46198985
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0     .1454019     .1454019
     nnet           12            0            0            0
     nnet           13            0    .00541017    .00541017
      ols            1            1    1.378e-16    1.378e-16
      ols            2            1    6.200e-17    6.200e-17
  lassocv            3            1    .26556963    .26556963
  ridgecv            4            1    .07992089    .07992089
  lassocv            5            1            0            0
  ridgecv            6            1    .05219205    .05219205
       rf            7            1    .52550237    .52550237
       rf            8            1    1.497e-16    1.497e-16
       rf            9            1    5.785e-16    5.785e-16
gradboost           10            1    5.682e-17    5.682e-17
gradboost           11            1    .06652058    .06652058
     nnet           12            1            0            0
     nnet           13            1    .01029447    .01029447

Y_lnearn_ps[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .01944531    .01944531
      ols            2            0            0            0
  lassocv            3            0    .18244935    .18244935
  ridgecv            4            0     .1853034     .1853034
  lassocv            5            0            0            0
  ridgecv            6            0    5.289e-16    5.289e-16
       rf            7            0    .46198985    .46198985
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0     .1454019     .1454019
     nnet           12            0            0            0
     nnet           13            0    .00541017    .00541017
      ols            1            1    1.378e-16    1.378e-16
      ols            2            1    6.200e-17    6.200e-17
  lassocv            3            1    .26556963    .26556963
  ridgecv            4            1    .07992089    .07992089
  lassocv            5            1            0            0
  ridgecv            6            1    .05219205    .05219205
       rf            7            1    .52550237    .52550237
       rf            8            1    1.497e-16    1.497e-16
       rf            9            1    5.785e-16    5.785e-16
gradboost           10            1    5.682e-17    5.682e-17
gradboost           11            1    .06652058    .06652058
     nnet           12            1            0            0
     nnet           13            1    .01029447    .01029447

      +-------------------------------------------------------------------+
      | Y_lne~1_1   Y_lne~0_1   Y_lne~s1   Y_lnea~2   Y_lnea~3   Y_lnea~4 |
      |-------------------------------------------------------------------|
   1. | 2.5347516    2.706248          1          0   .0194453   .0194453 |
   2. | 2.9660161   3.2034682          2          0          0          0 |
   3. | 2.8362723    2.867338          3          0   .1824494   .1824494 |
   4. | 2.4602145   2.5795766          4          0   .1853034   .1853034 |
   5. | 3.0964204   3.1626855          5          0          0          0 |
      |-------------------------------------------------------------------|
   6. | 2.5579435   2.6658077          6          0   5.29e-16   5.29e-16 |
   7. | 2.3804688   2.2957041          7          0   .4619898   .4619898 |
   8. | 2.6799118    2.707175          8          0          0          0 |
      +-------------------------------------------------------------------+
(note: file out_8756/Y_lnearn_ps_nnls1_pooled_ia.dta not found)
file out_8756/Y_lnearn_ps_nnls1_pooled_ia.dta saved

pool-stacked weights across resamples for gender_r
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .26020572    .26020572
    logit            2            0            0
  lassocv            3    .16792388    .16792388
  ridgecv            4    .01367852    .01367852
  lassocv            5    4.081e-16    4.081e-16
  ridgecv            6    4.097e-16    4.097e-16
       rf            7    .29299223    .29299223
       rf            8            0            0
       rf            9    5.770e-16    5.770e-16
gradboost           10            0            0
gradboost           11    .23692334    .23692334
     nnet           12            0            0
     nnet           13     .0282763     .0282763

pool-stacked weights across resamples for lnearn
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .01944531    .01944531
      ols            2            0            0            0
  lassocv            3            0    .18244935    .18244935
  ridgecv            4            0     .1853034     .1853034
  lassocv            5            0            0            0
  ridgecv            6            0    5.289e-16    5.289e-16
       rf            7            0    .46198985    .46198985
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0     .1454019     .1454019
     nnet           12            0            0            0
     nnet           13            0    .00541017    .00541017
      ols            1            1    1.378e-16    1.378e-16
      ols            2            1    6.200e-17    6.200e-17
  lassocv            3            1    .26556963    .26556963
  ridgecv            4            1    .07992089    .07992089
  lassocv            5            1            0            0
  ridgecv            6            1    .05219205    .05219205
       rf            7            1    .52550237    .52550237
       rf            8            1    1.497e-16    1.497e-16
       rf            9            1    5.785e-16    5.785e-16
gradboost           10            1    5.682e-17    5.682e-17
gradboost           11            1    .06652058    .06652058
     nnet           12            1            0            0
     nnet           13            1    .01029447    .01029447

D_gender_r_ps[13,3]
               learner  mean_weight        rep_1
    logit            1    .26020572    .26020572
    logit            2            0            0
  lassocv            3    .16792388    .16792388
  ridgecv            4    .01367852    .01367852
  lassocv            5    4.081e-16    4.081e-16
  ridgecv            6    4.097e-16    4.097e-16
       rf            7    .29299223    .29299223
       rf            8            0            0
       rf            9    5.770e-16    5.770e-16
gradboost           10            0            0
gradboost           11    .23692334    .23692334
     nnet           12            0            0
     nnet           13     .0282763     .0282763

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .76060325          1   .2602057   .2602057 |
   2. | .40850166          2          0          0 |
   3. |  .1018487          3   .1679239   .1679239 |
   4. | .17646246          4   .0136785   .0136785 |
   5. | .57610698          5   4.08e-16   4.08e-16 |
      |--------------------------------------------|
   6. | .86193061          6   4.10e-16   4.10e-16 |
   7. | .81875192          7   .2929922   .2929922 |
   8. | .82605859          8          0          0 |
      +--------------------------------------------+
(note: file out_8756/D_gender_r_ps_nnls1_pooled_ia.dta not found)
file out_8756/D_gender_r_ps_nnls1_pooled_ia.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.105    (0.034)
  ss  1  [shortstack]          [ss]          [ss]    -0.091    (0.019)
  ps  1   [poolstack]          [ps]          [ps]    -0.096    (0.034)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0911908   .0186362    -4.89   0.000     -.127717   -.0546645
------------------------------------------------------------------------------
Stacking final estimator: singlebest



Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.105    (0.034)
  ss  1  [shortstack]          [ss]          [ss]    -0.091    (0.019)
  ps  1   [poolstack]          [ps]          [ps]    -0.096    (0.034)

Stacking DDML model (ATET)
E[y|X,D=0]   = Y1_pystacked0_1                     Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1
E[D|X]       = D1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1046575   .0344253    -3.04   0.002    -.1721299   -.0371852
------------------------------------------------------------------------------
Stacking final estimator: singlebest
Warning: 71 propensity scores trimmed to lower limit .01.
Warning: 19 propensity scores trimmed to upper limit .99.
Warning: . resamples had propensity scores trimmed to upper limit .99.

file out_8756/results.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  ss  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.091    (0.019)
  ss  1  [shortstack]          [ss]          [ss]    -0.091    (0.019)
  ps  1   [poolstack]          [ps]          [ps]    -0.096    (0.034)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0911908   .0186362    -4.89   0.000     -.127717   -.0546645
------------------------------------------------------------------------------
Stacking final estimator: singlebest

file out_8756/results.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  ps  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.096    (0.034)
  ss  1  [shortstack]          [ss]          [ss]    -0.091    (0.019)
  ps  1   [poolstack]          [ps]          [ps]    -0.096    (0.034)

Poolstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ps0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ps1
E[D|X]       = D_gender_r_ps_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0960442   .0342456    -2.80   0.005    -.1631643   -.0289242
------------------------------------------------------------------------------
Stacking final estimator: singlebest
Warning: 98 propensity scores trimmed to lower limit .01.
Warning: 20 propensity scores trimmed to upper limit .99.
Warning: . resamples had propensity scores trimmed to upper limit .99.

file out_8756/results.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3           .8           .8
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10           .2           .2
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0           .1           .1
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0           .9           .9
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1           .1           .1
  ridgecv            6            1            0            0
       rf            7            1           .9           .9
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3           .8           .8
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10           .2           .2
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0           .1           .1
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0           .9           .9
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1           .1           .1
  ridgecv            6            1            0            0
       rf            7            1           .9           .9
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

Y1_pystacked_w_mn[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0           .1           .1
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0           .9           .9
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1           .1           .1
  ridgecv            6            1            0            0
       rf            7            1           .9           .9
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

      +-------------------------------------------+
      | Y1_pys~1   Y1_pys~2   Y1_pys~3   Y1_pys~4 |
      |-------------------------------------------|
   1. |        1          0          0          0 |
   2. |        2          0          0          0 |
   3. |        3          0          0          0 |
   4. |        4          0         .1         .1 |
   5. |        5          0          0          0 |
      |-------------------------------------------|
   6. |        6          0          0          0 |
   7. |        7          0         .9         .9 |
   8. |        8          0          0          0 |
      +-------------------------------------------+
(note: file out_8756/Y1_pystacked_w_mn_singlebest_regular_ia.dta not found)
file out_8756/Y1_pystacked_w_mn_singlebest_regular_ia.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3           .8           .8
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10           .2           .2
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0           .1           .1
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0           .9           .9
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1           .1           .1
  ridgecv            6            1            0            0
       rf            7            1           .9           .9
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

D1_pystacked_w_mn[13,3]
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3           .8           .8
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10           .2           .2
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

      +--------------------------------+
      | D1_pys~1   D1_pys~2   D1_pys~3 |
      |--------------------------------|
   1. |        1          0          0 |
   2. |        2          0          0 |
   3. |        3         .8         .8 |
   4. |        4          0          0 |
   5. |        5          0          0 |
      |--------------------------------|
   6. |        6          0          0 |
   7. |        7          0          0 |
   8. |        8          0          0 |
      +--------------------------------+
(note: file out_8756/D1_pystacked_w_mn_singlebest_regular_ia.dta not found)
file out_8756/D1_pystacked_w_mn_singlebest_regular_ia.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3            0            0
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            1            1
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

short-stacked weights across resamples for lnearn
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

short-stacked weights across resamples for gender_r
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3            0            0
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            1            1
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

short-stacked weights across resamples for lnearn
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

Y_lnearn_ss[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

      +-------------------------------------------------------------------+
      | Y_lne~1_1   Y_lne~0_1   Y_lne~s1   Y_lnea~2   Y_lnea~3   Y_lnea~4 |
      |-------------------------------------------------------------------|
   1. | 2.4930961   2.7880454          1          0          0          0 |
   2. | 2.8965251   3.1455264          2          0          0          0 |
   3. | 2.9009833   2.9094024          3          0          0          0 |
   4. | 2.4868057   2.5900228          4          0          0          0 |
   5. | 3.0507851   3.1608658          5          0          0          0 |
      |-------------------------------------------------------------------|
   6. | 2.5260704   2.6424327          6          0          0          0 |
   7. | 2.4762795   2.5187142          7          0          1          1 |
   8. | 2.6944299   2.7874815          8          0          0          0 |
      +-------------------------------------------------------------------+
(note: file out_8756/Y_lnearn_ss_singlebest_short_ia.dta not found)
file out_8756/Y_lnearn_ss_singlebest_short_ia.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3            0            0
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            1            1
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

short-stacked weights across resamples for lnearn
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

D_gender_r_ss[13,3]
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3            0            0
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            1            1
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .83602387          1          0          0 |
   2. | .47418055          2          0          0 |
   3. | .09550226          3          0          0 |
   4. | .25864476          4          0          0 |
   5. | .58233958          5          0          0 |
      |--------------------------------------------|
   6. | .84831953          6          0          0 |
   7. | .73924333          7          0          0 |
   8. | .69799322          8          0          0 |
      +--------------------------------------------+
(note: file out_8756/D_gender_r_ss_singlebest_short_ia.dta not found)
file out_8756/D_gender_r_ss_singlebest_short_ia.dta saved

pool-stacked weights across resamples for gender_r
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3            1            1
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

pool-stacked weights across resamples for lnearn
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

pool-stacked weights across resamples for gender_r
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3            1            1
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

pool-stacked weights across resamples for lnearn
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

Y_lnearn_ps[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

      +-------------------------------------------------------------------+
      | Y_lne~1_1   Y_lne~0_1   Y_lne~s1   Y_lnea~2   Y_lnea~3   Y_lnea~4 |
      |-------------------------------------------------------------------|
   1. | 2.4930961   2.7880454          1          0          0          0 |
   2. | 2.8965251   3.1455264          2          0          0          0 |
   3. | 2.9009833   2.9094024          3          0          0          0 |
   4. | 2.4868057   2.5900228          4          0          0          0 |
   5. | 3.0507851   3.1608658          5          0          0          0 |
      |-------------------------------------------------------------------|
   6. | 2.5260704   2.6424327          6          0          0          0 |
   7. | 2.4762795   2.5187142          7          0          1          1 |
   8. | 2.6944299   2.7874815          8          0          0          0 |
      +-------------------------------------------------------------------+
(note: file out_8756/Y_lnearn_ps_singlebest_pooled_ia.dta not found)
file out_8756/Y_lnearn_ps_singlebest_pooled_ia.dta saved

pool-stacked weights across resamples for gender_r
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3            1            1
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

pool-stacked weights across resamples for lnearn
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

D_gender_r_ps[13,3]
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3            1            1
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .74653584          1          0          0 |
   2. | .34712097          2          0          0 |
   3. | .08483139          3          1          1 |
   4. | .21509174          4          0          0 |
   5. | .55637544          5          0          0 |
      |--------------------------------------------|
   6. | .84360737          6          0          0 |
   7. | .82097822          7          0          0 |
   8. | .76361394          8          0          0 |
      +--------------------------------------------+
(note: file out_8756/D_gender_r_ps_singlebest_pooled_ia.dta not found)
file out_8756/D_gender_r_ps_singlebest_pooled_ia.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked    33.698    (2.249)
  ss  1  [shortstack]          [ss]          [ss]     0.063    (0.092)
  ps  1   [poolstack]          [ps]          [ps]     0.131    (0.099)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |   .0633315   .0917338     0.69   0.490    -.1164634    .2431264
------------------------------------------------------------------------------
Stacking final estimator: ols
Warning: 2 propensity scores trimmed to lower limit .01.
Warning: 341 propensity scores trimmed to upper limit .99.
Warning: . resamples had propensity scores trimmed to upper limit .99.



Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked    33.698    (2.249)
  ss  1  [shortstack]          [ss]          [ss]     0.063    (0.092)
  ps  1   [poolstack]          [ps]          [ps]     0.131    (0.099)

Stacking DDML model (ATET)
E[y|X,D=0]   = Y1_pystacked0_1                     Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1
E[D|X]       = D1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |   33.69802   2.249092    14.98   0.000     29.28988    38.10616
------------------------------------------------------------------------------
Stacking final estimator: ols
Warning: 1773 propensity scores trimmed to lower limit .01.
Warning: 1096 propensity scores trimmed to upper limit .99.
Warning: . resamples had propensity scores trimmed to upper limit .99.

(note: variable final was str3, now str10 to accommodate using data's values)
file out_8756/results.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  ss  1  Y1_pystacked  Y1_pystacked  D1_pystacked     0.063    (0.092)
  ss  1  [shortstack]          [ss]          [ss]     0.063    (0.092)
  ps  1   [poolstack]          [ps]          [ps]     0.131    (0.099)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |   .0633315   .0917338     0.69   0.490    -.1164634    .2431264
------------------------------------------------------------------------------
Stacking final estimator: ols
Warning: 2 propensity scores trimmed to lower limit .01.
Warning: 341 propensity scores trimmed to upper limit .99.
Warning: . resamples had propensity scores trimmed to upper limit .99.

(note: variable final was str3, now str10 to accommodate using data's values)
file out_8756/results.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  ps  1  Y1_pystacked  Y1_pystacked  D1_pystacked     0.131    (0.099)
  ss  1  [shortstack]          [ss]          [ss]     0.063    (0.092)
  ps  1   [poolstack]          [ps]          [ps]     0.131    (0.099)

Poolstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ps0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ps1
E[D|X]       = D_gender_r_ps_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |    .130916   .0990966     1.32   0.186    -.0633097    .3251417
------------------------------------------------------------------------------
Stacking final estimator: ols
Warning: 7 propensity scores trimmed to lower limit .01.
Warning: 260 propensity scores trimmed to upper limit .99.
Warning: . resamples had propensity scores trimmed to upper limit .99.

(note: variable final was str3, now str10 to accommodate using data's values)
file out_8756/results.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .21898286    .21898286
    logit            2    .07883047    .07883047
  lassocv            3    .33090824    .33090824
  ridgecv            4    .03650332    .03650332
  lassocv            5   -.18146526   -.18146526
  ridgecv            6    .03869044    .03869044
       rf            7    .41809986    .41809986
       rf            8    .07596619    .07596619
       rf            9   -.20482037   -.20482037
gradboost           10    .07508415    .07508415
gradboost           11    .16056491    .16056491
     nnet           12    .03989432    .03989432
     nnet           13    .02846888    .02846888

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .01816773    .01816773
      ols            2            0   -.03750351   -.03750351
  lassocv            3            0    .18784984    .18784984
  ridgecv            4            0    .46503906    .46503906
  lassocv            5            0   -.14037218   -.14037218
  ridgecv            6            0   -.07086146   -.07086146
       rf            7            0    .68446528    .68446528
       rf            8            0   -.02194165   -.02194165
       rf            9            0   -.09569144   -.09569144
gradboost           10            0     .0150908     .0150908
gradboost           11            0    .08106036    .08106036
     nnet           12            0   -.09518552   -.09518552
     nnet           13            0   -.00419454   -.00419454
      ols            1            1   -.02846177   -.02846177
      ols            2            1   -.02235493   -.02235493
  lassocv            3            1     -.034604     -.034604
  ridgecv            4            1    .30274216    .30274216
  lassocv            5            1    .24474692    .24474692
  ridgecv            6            1   -.02216718   -.02216718
       rf            7            1    .54742761    .54742761
       rf            8            1    .42685878    .42685878
       rf            9            1   -.34311868   -.34311868
gradboost           10            1    -.0664794    -.0664794
gradboost           11            1    .04208652    .04208652
     nnet           12            1   -.03165816   -.03165816
     nnet           13            1    .00249954    .00249954

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .21898286    .21898286
    logit            2    .07883047    .07883047
  lassocv            3    .33090824    .33090824
  ridgecv            4    .03650332    .03650332
  lassocv            5   -.18146526   -.18146526
  ridgecv            6    .03869044    .03869044
       rf            7    .41809986    .41809986
       rf            8    .07596619    .07596619
       rf            9   -.20482037   -.20482037
gradboost           10    .07508415    .07508415
gradboost           11    .16056491    .16056491
     nnet           12    .03989432    .03989432
     nnet           13    .02846888    .02846888

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .01816773    .01816773
      ols            2            0   -.03750351   -.03750351
  lassocv            3            0    .18784984    .18784984
  ridgecv            4            0    .46503906    .46503906
  lassocv            5            0   -.14037218   -.14037218
  ridgecv            6            0   -.07086146   -.07086146
       rf            7            0    .68446528    .68446528
       rf            8            0   -.02194165   -.02194165
       rf            9            0   -.09569144   -.09569144
gradboost           10            0     .0150908     .0150908
gradboost           11            0    .08106036    .08106036
     nnet           12            0   -.09518552   -.09518552
     nnet           13            0   -.00419454   -.00419454
      ols            1            1   -.02846177   -.02846177
      ols            2            1   -.02235493   -.02235493
  lassocv            3            1     -.034604     -.034604
  ridgecv            4            1    .30274216    .30274216
  lassocv            5            1    .24474692    .24474692
  ridgecv            6            1   -.02216718   -.02216718
       rf            7            1    .54742761    .54742761
       rf            8            1    .42685878    .42685878
       rf            9            1   -.34311868   -.34311868
gradboost           10            1    -.0664794    -.0664794
gradboost           11            1    .04208652    .04208652
     nnet           12            1   -.03165816   -.03165816
     nnet           13            1    .00249954    .00249954

Y1_pystacked_w_mn[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .01816773    .01816773
      ols            2            0   -.03750351   -.03750351
  lassocv            3            0    .18784984    .18784984
  ridgecv            4            0    .46503906    .46503906
  lassocv            5            0   -.14037218   -.14037218
  ridgecv            6            0   -.07086146   -.07086146
       rf            7            0    .68446528    .68446528
       rf            8            0   -.02194165   -.02194165
       rf            9            0   -.09569144   -.09569144
gradboost           10            0     .0150908     .0150908
gradboost           11            0    .08106036    .08106036
     nnet           12            0   -.09518552   -.09518552
     nnet           13            0   -.00419454   -.00419454
      ols            1            1   -.02846177   -.02846177
      ols            2            1   -.02235493   -.02235493
  lassocv            3            1     -.034604     -.034604
  ridgecv            4            1    .30274216    .30274216
  lassocv            5            1    .24474692    .24474692
  ridgecv            6            1   -.02216718   -.02216718
       rf            7            1    .54742761    .54742761
       rf            8            1    .42685878    .42685878
       rf            9            1   -.34311868   -.34311868
gradboost           10            1    -.0664794    -.0664794
gradboost           11            1    .04208652    .04208652
     nnet           12            1   -.03165816   -.03165816
     nnet           13            1    .00249954    .00249954

      +---------------------------------------------+
      | Y1_pys~1   Y1_pys~2   Y1_pyst~3   Y1_pyst~4 |
      |---------------------------------------------|
   1. |        1          0    .0181677    .0181677 |
   2. |        2          0   -.0375035   -.0375035 |
   3. |        3          0    .1878498    .1878498 |
   4. |        4          0    .4650391    .4650391 |
   5. |        5          0   -.1403722   -.1403722 |
      |---------------------------------------------|
   6. |        6          0   -.0708615   -.0708615 |
   7. |        7          0    .6844653    .6844653 |
   8. |        8          0   -.0219417   -.0219417 |
      +---------------------------------------------+
(note: file out_8756/Y1_pystacked_w_mn_ols_regular_ia.dta not found)
file out_8756/Y1_pystacked_w_mn_ols_regular_ia.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .21898286    .21898286
    logit            2    .07883047    .07883047
  lassocv            3    .33090824    .33090824
  ridgecv            4    .03650332    .03650332
  lassocv            5   -.18146526   -.18146526
  ridgecv            6    .03869044    .03869044
       rf            7    .41809986    .41809986
       rf            8    .07596619    .07596619
       rf            9   -.20482037   -.20482037
gradboost           10    .07508415    .07508415
gradboost           11    .16056491    .16056491
     nnet           12    .03989432    .03989432
     nnet           13    .02846888    .02846888

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .01816773    .01816773
      ols            2            0   -.03750351   -.03750351
  lassocv            3            0    .18784984    .18784984
  ridgecv            4            0    .46503906    .46503906
  lassocv            5            0   -.14037218   -.14037218
  ridgecv            6            0   -.07086146   -.07086146
       rf            7            0    .68446528    .68446528
       rf            8            0   -.02194165   -.02194165
       rf            9            0   -.09569144   -.09569144
gradboost           10            0     .0150908     .0150908
gradboost           11            0    .08106036    .08106036
     nnet           12            0   -.09518552   -.09518552
     nnet           13            0   -.00419454   -.00419454
      ols            1            1   -.02846177   -.02846177
      ols            2            1   -.02235493   -.02235493
  lassocv            3            1     -.034604     -.034604
  ridgecv            4            1    .30274216    .30274216
  lassocv            5            1    .24474692    .24474692
  ridgecv            6            1   -.02216718   -.02216718
       rf            7            1    .54742761    .54742761
       rf            8            1    .42685878    .42685878
       rf            9            1   -.34311868   -.34311868
gradboost           10            1    -.0664794    -.0664794
gradboost           11            1    .04208652    .04208652
     nnet           12            1   -.03165816   -.03165816
     nnet           13            1    .00249954    .00249954

D1_pystacked_w_mn[13,3]
               learner  mean_weight        rep_1
    logit            1    .21898286    .21898286
    logit            2    .07883047    .07883047
  lassocv            3    .33090824    .33090824
  ridgecv            4    .03650332    .03650332
  lassocv            5   -.18146526   -.18146526
  ridgecv            6    .03869044    .03869044
       rf            7    .41809986    .41809986
       rf            8    .07596619    .07596619
       rf            9   -.20482037   -.20482037
gradboost           10    .07508415    .07508415
gradboost           11    .16056491    .16056491
     nnet           12    .03989432    .03989432
     nnet           13    .02846888    .02846888

      +----------------------------------+
      | D1_pys~1   D1_pyst~2   D1_pyst~3 |
      |----------------------------------|
   1. |        1    .2189829    .2189829 |
   2. |        2    .0788305    .0788305 |
   3. |        3    .3309082    .3309082 |
   4. |        4    .0365033    .0365033 |
   5. |        5   -.1814653   -.1814653 |
      |----------------------------------|
   6. |        6    .0386904    .0386904 |
   7. |        7    .4180999    .4180999 |
   8. |        8    .0759662    .0759662 |
      +----------------------------------+
(note: file out_8756/D1_pystacked_w_mn_ols_regular_ia.dta not found)
file out_8756/D1_pystacked_w_mn_ols_regular_ia.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .20731357    .20731357
    logit            2    .10268403    .10268403
  lassocv            3   -.05566735   -.05566735
  ridgecv            4    .25012426    .25012426
  lassocv            5    .08481018    .08481018
  ridgecv            6   -.14501866   -.14501866
       rf            7    .34468657    .34468657
       rf            8    .41044376    .41044376
       rf            9   -.43800566   -.43800566
gradboost           10    .03105333    .03105333
gradboost           11    .23316011    .23316011
     nnet           12    .01004098    .01004098
     nnet           13    .05553213    .05553213

short-stacked weights across resamples for lnearn
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .01765429    .01765429
      ols            2            0   -.06493398   -.06493398
  lassocv            3            0   -.17342663   -.17342663
  ridgecv            4            0    .67613334    .67613334
  lassocv            5            0    .02619319    .02619319
  ridgecv            6            0    -.1618331    -.1618331
       rf            7            0     .5507261     .5507261
       rf            8            0    .42692243    .42692243
       rf            9            0   -.50274265   -.50274265
gradboost           10            0    .02055936    .02055936
gradboost           11            0    .19549961    .19549961
     nnet           12            0   -.01349734   -.01349734
     nnet           13            0    .01426242    .01426242
      ols            1            1   -.00808562   -.00808562
      ols            2            1   -.01077062   -.01077062
  lassocv            3            1   -.04765867   -.04765867
  ridgecv            4            1    .15247009    .15247009
  lassocv            5            1    .42156217    .42156217
  ridgecv            6            1   -.05831502   -.05831502
       rf            7            1    .55697871    .55697871
       rf            8            1   -.09661246   -.09661246
       rf            9            1    .08229255    .08229255
gradboost           10            1   -.01873991   -.01873991
gradboost           11            1    .08278582    .08278582
     nnet           12            1    .04743695    .04743695
     nnet           13            1    .00575196    .00575196

short-stacked weights across resamples for gender_r
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .20731357    .20731357
    logit            2    .10268403    .10268403
  lassocv            3   -.05566735   -.05566735
  ridgecv            4    .25012426    .25012426
  lassocv            5    .08481018    .08481018
  ridgecv            6   -.14501866   -.14501866
       rf            7    .34468657    .34468657
       rf            8    .41044376    .41044376
       rf            9   -.43800566   -.43800566
gradboost           10    .03105333    .03105333
gradboost           11    .23316011    .23316011
     nnet           12    .01004098    .01004098
     nnet           13    .05553213    .05553213

short-stacked weights across resamples for lnearn
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .01765429    .01765429
      ols            2            0   -.06493398   -.06493398
  lassocv            3            0   -.17342663   -.17342663
  ridgecv            4            0    .67613334    .67613334
  lassocv            5            0    .02619319    .02619319
  ridgecv            6            0    -.1618331    -.1618331
       rf            7            0     .5507261     .5507261
       rf            8            0    .42692243    .42692243
       rf            9            0   -.50274265   -.50274265
gradboost           10            0    .02055936    .02055936
gradboost           11            0    .19549961    .19549961
     nnet           12            0   -.01349734   -.01349734
     nnet           13            0    .01426242    .01426242
      ols            1            1   -.00808562   -.00808562
      ols            2            1   -.01077062   -.01077062
  lassocv            3            1   -.04765867   -.04765867
  ridgecv            4            1    .15247009    .15247009
  lassocv            5            1    .42156217    .42156217
  ridgecv            6            1   -.05831502   -.05831502
       rf            7            1    .55697871    .55697871
       rf            8            1   -.09661246   -.09661246
       rf            9            1    .08229255    .08229255
gradboost           10            1   -.01873991   -.01873991
gradboost           11            1    .08278582    .08278582
     nnet           12            1    .04743695    .04743695
     nnet           13            1    .00575196    .00575196

Y_lnearn_ss[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .01765429    .01765429
      ols            2            0   -.06493398   -.06493398
  lassocv            3            0   -.17342663   -.17342663
  ridgecv            4            0    .67613334    .67613334
  lassocv            5            0    .02619319    .02619319
  ridgecv            6            0    -.1618331    -.1618331
       rf            7            0     .5507261     .5507261
       rf            8            0    .42692243    .42692243
       rf            9            0   -.50274265   -.50274265
gradboost           10            0    .02055936    .02055936
gradboost           11            0    .19549961    .19549961
     nnet           12            0   -.01349734   -.01349734
     nnet           13            0    .01426242    .01426242
      ols            1            1   -.00808562   -.00808562
      ols            2            1   -.01077062   -.01077062
  lassocv            3            1   -.04765867   -.04765867
  ridgecv            4            1    .15247009    .15247009
  lassocv            5            1    .42156217    .42156217
  ridgecv            6            1   -.05831502   -.05831502
       rf            7            1    .55697871    .55697871
       rf            8            1   -.09661246   -.09661246
       rf            9            1    .08229255    .08229255
gradboost           10            1   -.01873991   -.01873991
gradboost           11            1    .08278582    .08278582
     nnet           12            1    .04743695    .04743695
     nnet           13            1    .00575196    .00575196

      +---------------------------------------------------------------------+
      | Y_lne~1_1   Y_lne~0_1   Y_lne~s1   Y_lnea~2   Y_lnear~3   Y_lnear~4 |
      |---------------------------------------------------------------------|
   1. | 2.7958752   2.7310317          1          0    .0176543    .0176543 |
   2. | 3.2876921   3.2244396          2          0    -.064934    -.064934 |
   3. | 3.0767945   2.9260668          3          0   -.1734266   -.1734266 |
   4. | 2.7631338   2.6144858          4          0    .6761333    .6761333 |
   5. | 3.4031151   3.2432028          5          0    .0261932    .0261932 |
      |---------------------------------------------------------------------|
   6. | 2.8516646   2.6727865          6          0   -.1618331   -.1618331 |
   7. | 2.6827083   2.2988686          7          0    .5507261    .5507261 |
   8. | 2.9736745   2.7028864          8          0    .4269224    .4269224 |
      +---------------------------------------------------------------------+
(note: file out_8756/Y_lnearn_ss_ols_short_ia.dta not found)
file out_8756/Y_lnearn_ss_ols_short_ia.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .20731357    .20731357
    logit            2    .10268403    .10268403
  lassocv            3   -.05566735   -.05566735
  ridgecv            4    .25012426    .25012426
  lassocv            5    .08481018    .08481018
  ridgecv            6   -.14501866   -.14501866
       rf            7    .34468657    .34468657
       rf            8    .41044376    .41044376
       rf            9   -.43800566   -.43800566
gradboost           10    .03105333    .03105333
gradboost           11    .23316011    .23316011
     nnet           12    .01004098    .01004098
     nnet           13    .05553213    .05553213

short-stacked weights across resamples for lnearn
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .01765429    .01765429
      ols            2            0   -.06493398   -.06493398
  lassocv            3            0   -.17342663   -.17342663
  ridgecv            4            0    .67613334    .67613334
  lassocv            5            0    .02619319    .02619319
  ridgecv            6            0    -.1618331    -.1618331
       rf            7            0     .5507261     .5507261
       rf            8            0    .42692243    .42692243
       rf            9            0   -.50274265   -.50274265
gradboost           10            0    .02055936    .02055936
gradboost           11            0    .19549961    .19549961
     nnet           12            0   -.01349734   -.01349734
     nnet           13            0    .01426242    .01426242
      ols            1            1   -.00808562   -.00808562
      ols            2            1   -.01077062   -.01077062
  lassocv            3            1   -.04765867   -.04765867
  ridgecv            4            1    .15247009    .15247009
  lassocv            5            1    .42156217    .42156217
  ridgecv            6            1   -.05831502   -.05831502
       rf            7            1    .55697871    .55697871
       rf            8            1   -.09661246   -.09661246
       rf            9            1    .08229255    .08229255
gradboost           10            1   -.01873991   -.01873991
gradboost           11            1    .08278582    .08278582
     nnet           12            1    .04743695    .04743695
     nnet           13            1    .00575196    .00575196

D_gender_r_ss[13,3]
               learner  mean_weight        rep_1
    logit            1    .20731357    .20731357
    logit            2    .10268403    .10268403
  lassocv            3   -.05566735   -.05566735
  ridgecv            4    .25012426    .25012426
  lassocv            5    .08481018    .08481018
  ridgecv            6   -.14501866   -.14501866
       rf            7    .34468657    .34468657
       rf            8    .41044376    .41044376
       rf            9   -.43800566   -.43800566
gradboost           10    .03105333    .03105333
gradboost           11    .23316011    .23316011
     nnet           12    .01004098    .01004098
     nnet           13    .05553213    .05553213

      +----------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gende~2   D_gende~3 |
      |----------------------------------------------|
   1. | .81404887          1    .2073136    .2073136 |
   2. | .46664653          2     .102684     .102684 |
   3. | .09915283          3   -.0556673   -.0556673 |
   4. | .17945347          4    .2501242    .2501242 |
   5. | .62134769          5    .0848102    .0848102 |
      |----------------------------------------------|
   6. | .93941943          6   -.1450187   -.1450187 |
   7. | .90568582          7    .3446866    .3446866 |
   8. | .90406201          8    .4104438    .4104438 |
      +----------------------------------------------+
(note: file out_8756/D_gender_r_ss_ols_short_ia.dta not found)
file out_8756/D_gender_r_ss_ols_short_ia.dta saved

pool-stacked weights across resamples for gender_r
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .21915256    .21915256
    logit            2    .07976947    .07976947
  lassocv            3    .22872013    .22872013
  ridgecv            4    .05681481    .05681481
  lassocv            5   -.08190137   -.08190137
  ridgecv            6    .01762498    .01762498
       rf            7    .42438969    .42438969
       rf            8    .05957615    .05957615
       rf            9   -.19376081   -.19376081
gradboost           10    .07825168    .07825168
gradboost           11    .16048497    .16048497
     nnet           12   -.00623044   -.00623044
     nnet           13    .02904085    .02904085

pool-stacked weights across resamples for lnearn
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .01376153    .01376153
      ols            2            0   -.04492068   -.04492068
  lassocv            3            0    .21838376    .21838376
  ridgecv            4            0    .40307237    .40307237
  lassocv            5            0    -.1501997    -.1501997
  ridgecv            6            0   -.04298544   -.04298544
       rf            7            0    .69355839    .69355839
       rf            8            0   -.00392608   -.00392608
       rf            9            0   -.12144834   -.12144834
gradboost           10            0    .02276355    .02276355
gradboost           11            0    .07492834    .07492834
     nnet           12            0   -.00347188   -.00347188
     nnet           13            0   -.00017986   -.00017986
      ols            1            1   -.01167065   -.01167065
      ols            2            1   -.01874991   -.01874991
  lassocv            3            1    .14462891    .14462891
  ridgecv            4            1    .31216214    .31216214
  lassocv            5            1    .02515496    .02515496
  ridgecv            6            1   -.02165783   -.02165783
       rf            7            1     .5438743     .5438743
       rf            8            1    .47263789    .47263789
       rf            9            1   -.38203503   -.38203503
gradboost           10            1   -.04987427   -.04987427
gradboost           11            1    .04194392    .04194392
     nnet           12            1    .02185366    .02185366
     nnet           13            1    .00486855    .00486855

pool-stacked weights across resamples for gender_r
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .21915256    .21915256
    logit            2    .07976947    .07976947
  lassocv            3    .22872013    .22872013
  ridgecv            4    .05681481    .05681481
  lassocv            5   -.08190137   -.08190137
  ridgecv            6    .01762498    .01762498
       rf            7    .42438969    .42438969
       rf            8    .05957615    .05957615
       rf            9   -.19376081   -.19376081
gradboost           10    .07825168    .07825168
gradboost           11    .16048497    .16048497
     nnet           12   -.00623044   -.00623044
     nnet           13    .02904085    .02904085

pool-stacked weights across resamples for lnearn
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .01376153    .01376153
      ols            2            0   -.04492068   -.04492068
  lassocv            3            0    .21838376    .21838376
  ridgecv            4            0    .40307237    .40307237
  lassocv            5            0    -.1501997    -.1501997
  ridgecv            6            0   -.04298544   -.04298544
       rf            7            0    .69355839    .69355839
       rf            8            0   -.00392608   -.00392608
       rf            9            0   -.12144834   -.12144834
gradboost           10            0    .02276355    .02276355
gradboost           11            0    .07492834    .07492834
     nnet           12            0   -.00347188   -.00347188
     nnet           13            0   -.00017986   -.00017986
      ols            1            1   -.01167065   -.01167065
      ols            2            1   -.01874991   -.01874991
  lassocv            3            1    .14462891    .14462891
  ridgecv            4            1    .31216214    .31216214
  lassocv            5            1    .02515496    .02515496
  ridgecv            6            1   -.02165783   -.02165783
       rf            7            1     .5438743     .5438743
       rf            8            1    .47263789    .47263789
       rf            9            1   -.38203503   -.38203503
gradboost           10            1   -.04987427   -.04987427
gradboost           11            1    .04194392    .04194392
     nnet           12            1    .02185366    .02185366
     nnet           13            1    .00486855    .00486855

Y_lnearn_ps[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .01376153    .01376153
      ols            2            0   -.04492068   -.04492068
  lassocv            3            0    .21838376    .21838376
  ridgecv            4            0    .40307237    .40307237
  lassocv            5            0    -.1501997    -.1501997
  ridgecv            6            0   -.04298544   -.04298544
       rf            7            0    .69355839    .69355839
       rf            8            0   -.00392608   -.00392608
       rf            9            0   -.12144834   -.12144834
gradboost           10            0    .02276355    .02276355
gradboost           11            0    .07492834    .07492834
     nnet           12            0   -.00347188   -.00347188
     nnet           13            0   -.00017986   -.00017986
      ols            1            1   -.01167065   -.01167065
      ols            2            1   -.01874991   -.01874991
  lassocv            3            1    .14462891    .14462891
  ridgecv            4            1    .31216214    .31216214
  lassocv            5            1    .02515496    .02515496
  ridgecv            6            1   -.02165783   -.02165783
       rf            7            1     .5438743     .5438743
       rf            8            1    .47263789    .47263789
       rf            9            1   -.38203503   -.38203503
gradboost           10            1   -.04987427   -.04987427
gradboost           11            1    .04194392    .04194392
     nnet           12            1    .02185366    .02185366
     nnet           13            1    .00486855    .00486855

      +---------------------------------------------------------------------+
      | Y_lne~1_1   Y_lne~0_1   Y_lne~s1   Y_lnea~2   Y_lnear~3   Y_lnear~4 |
      |---------------------------------------------------------------------|
   1. | 2.7320531   2.8774864          1          0    .0137615    .0137615 |
   2. | 3.1893754    3.372838          2          0   -.0449207   -.0449207 |
   3. | 3.0226592   3.0488395          3          0    .2183838    .2183838 |
   4. | 2.6590588   2.7103214          4          0    .4030724    .4030724 |
   5. | 3.3688082   3.3492537          5          0   -.1501997   -.1501997 |
      |---------------------------------------------------------------------|
   6. | 2.7714892   2.8049238          6          0   -.0429854   -.0429854 |
   7. |  2.554325    2.472908          7          0    .6935584    .6935584 |
   8. | 2.9070434   2.8671093          8          0   -.0039261   -.0039261 |
      +---------------------------------------------------------------------+
(note: file out_8756/Y_lnearn_ps_ols_pooled_ia.dta not found)
file out_8756/Y_lnearn_ps_ols_pooled_ia.dta saved

pool-stacked weights across resamples for gender_r
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .21915256    .21915256
    logit            2    .07976947    .07976947
  lassocv            3    .22872013    .22872013
  ridgecv            4    .05681481    .05681481
  lassocv            5   -.08190137   -.08190137
  ridgecv            6    .01762498    .01762498
       rf            7    .42438969    .42438969
       rf            8    .05957615    .05957615
       rf            9   -.19376081   -.19376081
gradboost           10    .07825168    .07825168
gradboost           11    .16048497    .16048497
     nnet           12   -.00623044   -.00623044
     nnet           13    .02904085    .02904085

pool-stacked weights across resamples for lnearn
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .01376153    .01376153
      ols            2            0   -.04492068   -.04492068
  lassocv            3            0    .21838376    .21838376
  ridgecv            4            0    .40307237    .40307237
  lassocv            5            0    -.1501997    -.1501997
  ridgecv            6            0   -.04298544   -.04298544
       rf            7            0    .69355839    .69355839
       rf            8            0   -.00392608   -.00392608
       rf            9            0   -.12144834   -.12144834
gradboost           10            0    .02276355    .02276355
gradboost           11            0    .07492834    .07492834
     nnet           12            0   -.00347188   -.00347188
     nnet           13            0   -.00017986   -.00017986
      ols            1            1   -.01167065   -.01167065
      ols            2            1   -.01874991   -.01874991
  lassocv            3            1    .14462891    .14462891
  ridgecv            4            1    .31216214    .31216214
  lassocv            5            1    .02515496    .02515496
  ridgecv            6            1   -.02165783   -.02165783
       rf            7            1     .5438743     .5438743
       rf            8            1    .47263789    .47263789
       rf            9            1   -.38203503   -.38203503
gradboost           10            1   -.04987427   -.04987427
gradboost           11            1    .04194392    .04194392
     nnet           12            1    .02185366    .02185366
     nnet           13            1    .00486855    .00486855

D_gender_r_ps[13,3]
               learner  mean_weight        rep_1
    logit            1    .21915256    .21915256
    logit            2    .07976947    .07976947
  lassocv            3    .22872013    .22872013
  ridgecv            4    .05681481    .05681481
  lassocv            5   -.08190137   -.08190137
  ridgecv            6    .01762498    .01762498
       rf            7    .42438969    .42438969
       rf            8    .05957615    .05957615
       rf            9   -.19376081   -.19376081
gradboost           10    .07825168    .07825168
gradboost           11    .16048497    .16048497
     nnet           12   -.00623044   -.00623044
     nnet           13    .02904085    .02904085

      +----------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gende~2   D_gende~3 |
      |----------------------------------------------|
   1. | .80566384          1    .2191526    .2191526 |
   2. | .44620205          2    .0797695    .0797695 |
   3. |  .1148326          3    .2287201    .2287201 |
   4. | .17552139          4    .0568148    .0568148 |
   5. | .58968397          5   -.0819014   -.0819014 |
      |----------------------------------------------|
   6. | .93064617          6     .017625     .017625 |
   7. | .87677678          7    .4243897    .4243897 |
   8. | .86918607          8    .0595762    .0595762 |
      +----------------------------------------------+
(note: file out_8756/D_gender_r_ps_ols_pooled_ia.dta not found)
file out_8756/D_gender_r_ps_ols_pooled_ia.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.103    (0.016)
  ss  1  [shortstack]          [ss]          [ss]    -0.103    (0.016)
  ps  1   [poolstack]          [ps]          [ps]    -0.103    (0.016)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1025529   .0162606    -6.31   0.000    -.1344231   -.0706827
------------------------------------------------------------------------------
Stacking final estimator: avg



Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.103    (0.016)
  ss  1  [shortstack]          [ss]          [ss]    -0.103    (0.016)
  ps  1   [poolstack]          [ps]          [ps]    -0.103    (0.016)

Stacking DDML model (ATET)
E[y|X,D=0]   = Y1_pystacked0_1                     Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1
E[D|X]       = D1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1025529   .0162606    -6.31   0.000    -.1344231   -.0706827
------------------------------------------------------------------------------
Stacking final estimator: avg

(note: variable final was str3, now str10 to accommodate using data's values)
file out_8756/results.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  ss  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.103    (0.016)
  ss  1  [shortstack]          [ss]          [ss]    -0.103    (0.016)
  ps  1   [poolstack]          [ps]          [ps]    -0.103    (0.016)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1025529   .0162606    -6.31   0.000    -.1344231   -.0706827
------------------------------------------------------------------------------
Stacking final estimator: avg

(note: variable final was str3, now str10 to accommodate using data's values)
file out_8756/results.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  ps  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.103    (0.016)
  ss  1  [shortstack]          [ss]          [ss]    -0.103    (0.016)
  ps  1   [poolstack]          [ps]          [ps]    -0.103    (0.016)

Poolstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ps0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ps1
E[D|X]       = D_gender_r_ps_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1025529   .0162606    -6.31   0.000    -.1344231   -.0706827
------------------------------------------------------------------------------
Stacking final estimator: avg

(note: variable final was str3, now str10 to accommodate using data's values)
file out_8756/results.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

Y1_pystacked_w_mn[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

      +-------------------------------------------+
      | Y1_pys~1   Y1_pys~2   Y1_pys~3   Y1_pys~4 |
      |-------------------------------------------|
   1. |        1          0   .0769231   .0769231 |
   2. |        2          0   .0769231   .0769231 |
   3. |        3          0   .0769231   .0769231 |
   4. |        4          0   .0769231   .0769231 |
   5. |        5          0   .0769231   .0769231 |
      |-------------------------------------------|
   6. |        6          0   .0769231   .0769231 |
   7. |        7          0   .0769231   .0769231 |
   8. |        8          0   .0769231   .0769231 |
      +-------------------------------------------+
(note: file out_8756/Y1_pystacked_w_mn_avg_regular_ia.dta not found)
file out_8756/Y1_pystacked_w_mn_avg_regular_ia.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

D1_pystacked_w_mn[13,3]
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

      +--------------------------------+
      | D1_pys~1   D1_pys~2   D1_pys~3 |
      |--------------------------------|
   1. |        1   .0769231   .0769231 |
   2. |        2   .0769231   .0769231 |
   3. |        3   .0769231   .0769231 |
   4. |        4   .0769231   .0769231 |
   5. |        5   .0769231   .0769231 |
      |--------------------------------|
   6. |        6   .0769231   .0769231 |
   7. |        7   .0769231   .0769231 |
   8. |        8   .0769231   .0769231 |
      +--------------------------------+
(note: file out_8756/D1_pystacked_w_mn_avg_regular_ia.dta not found)
file out_8756/D1_pystacked_w_mn_avg_regular_ia.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

short-stacked weights across resamples for lnearn
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

short-stacked weights across resamples for gender_r
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

short-stacked weights across resamples for lnearn
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

Y_lnearn_ss[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

      +-------------------------------------------------------------------+
      | Y_lne~1_1   Y_lne~0_1   Y_lne~s1   Y_lnea~2   Y_lnea~3   Y_lnea~4 |
      |-------------------------------------------------------------------|
   1. | 2.6381553   2.7311157          1          0   .0769231   .0769231 |
   2. | 3.0590938   3.1229755          2          0   .0769231   .0769231 |
   3. | 2.9987499   2.8520588          3          0   .0769231   .0769231 |
   4. |  2.482323   2.6085041          4          0   .0769231   .0769231 |
   5. | 3.0603403   3.1391283          5          0   .0769231   .0769231 |
      |-------------------------------------------------------------------|
   6. | 2.5934743   2.6968099          6          0   .0769231   .0769231 |
   7. | 2.4761699   2.2686957          7          0   .0769231   .0769231 |
   8. | 2.7559518   2.7498923          8          0   .0769231   .0769231 |
      +-------------------------------------------------------------------+
(note: file out_8756/Y_lnearn_ss_avg_short_ia.dta not found)
file out_8756/Y_lnearn_ss_avg_short_ia.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

short-stacked weights across resamples for lnearn
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

D_gender_r_ss[13,3]
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .72569788          1   .0769231   .0769231 |
   2. | .42636153          2   .0769231   .0769231 |
   3. | .17025999          3   .0769231   .0769231 |
   4. | .30267461          4   .0769231   .0769231 |
   5. | .55631967          5   .0769231   .0769231 |
      |--------------------------------------------|
   6. | .80512982          6   .0769231   .0769231 |
   7. | .78655358          7   .0769231   .0769231 |
   8. | .76714295          8   .0769231   .0769231 |
      +--------------------------------------------+
(note: file out_8756/D_gender_r_ss_avg_short_ia.dta not found)
file out_8756/D_gender_r_ss_avg_short_ia.dta saved

pool-stacked weights across resamples for gender_r
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

pool-stacked weights across resamples for lnearn
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

pool-stacked weights across resamples for gender_r
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

pool-stacked weights across resamples for lnearn
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

Y_lnearn_ps[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

      +-------------------------------------------------------------------+
      | Y_lne~1_1   Y_lne~0_1   Y_lne~s1   Y_lnea~2   Y_lnea~3   Y_lnea~4 |
      |-------------------------------------------------------------------|
   1. | 2.6381553   2.7311157          1          0   .0769231   .0769231 |
   2. | 3.0590938   3.1229755          2          0   .0769231   .0769231 |
   3. | 2.9987499   2.8520588          3          0   .0769231   .0769231 |
   4. |  2.482323   2.6085041          4          0   .0769231   .0769231 |
   5. | 3.0603403   3.1391283          5          0   .0769231   .0769231 |
      |-------------------------------------------------------------------|
   6. | 2.5934743   2.6968099          6          0   .0769231   .0769231 |
   7. | 2.4761699   2.2686957          7          0   .0769231   .0769231 |
   8. | 2.7559518   2.7498923          8          0   .0769231   .0769231 |
      +-------------------------------------------------------------------+
(note: file out_8756/Y_lnearn_ps_avg_pooled_ia.dta not found)
file out_8756/Y_lnearn_ps_avg_pooled_ia.dta saved

pool-stacked weights across resamples for gender_r
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

pool-stacked weights across resamples for lnearn
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

D_gender_r_ps[13,3]
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .72569788          1   .0769231   .0769231 |
   2. | .42636153          2   .0769231   .0769231 |
   3. | .17025999          3   .0769231   .0769231 |
   4. | .30267461          4   .0769231   .0769231 |
   5. | .55631967          5   .0769231   .0769231 |
      |--------------------------------------------|
   6. | .80512982          6   .0769231   .0769231 |
   7. | .78655358          7   .0769231   .0769231 |
   8. | .76714295          8   .0769231   .0769231 |
      +--------------------------------------------+
(note: file out_8756/D_gender_r_ps_avg_pooled_ia.dta not found)
file out_8756/D_gender_r_ps_avg_pooled_ia.dta saved
. 
.         forvalues i = 1(1)$L {
  2.                         ddml estimate, y1(Y1_pystacked1_L`i'_1) y0(Y1_pyst
> acked0_L`i'_1) ///
>                                                         d(D1_pystacked_L`i'_1
> ) robust atet foldvar(m0_sample_1  )
  3.                         regsave gender_r using `folder'/results.dta, ci //
> /
>                                                 addlabel(model,interactive,se
> ed,`seed',final,indiv,learner,`i') ///
>                                                 append
  4.         }

E[y|X,D=0]   = Y1_pystacked0_L1_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L1_1
E[D|X]       = D1_pystacked_L1_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1202476   .0629302    -1.91   0.056    -.2435885    .0030933
------------------------------------------------------------------------------
Warning: 134 propensity scores trimmed to lower limit ..
Warning: 45 propensity scores trimmed to upper limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_8756/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L2_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L2_1
E[D|X]       = D1_pystacked_L2_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1186154   .0162097    -7.32   0.000    -.1503858    -.086845
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_8756/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L3_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L3_1
E[D|X]       = D1_pystacked_L3_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0748227   .0470548    -1.59   0.112    -.1670483     .017403
------------------------------------------------------------------------------
Warning: 98 propensity scores trimmed to lower limit ..
Warning: 20 propensity scores trimmed to upper limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_8756/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L4_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L4_1
E[D|X]       = D1_pystacked_L4_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0919478   .0719241    -1.28   0.201    -.2329164    .0490207
------------------------------------------------------------------------------
Warning: 82 propensity scores trimmed to lower limit ..
Warning: 19 propensity scores trimmed to upper limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_8756/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L5_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L5_1
E[D|X]       = D1_pystacked_L5_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0567436   .0476484    -1.19   0.234    -.1501328    .0366456
------------------------------------------------------------------------------
Warning: 91 propensity scores trimmed to lower limit ..
Warning: 19 propensity scores trimmed to upper limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_8756/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L6_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L6_1
E[D|X]       = D1_pystacked_L6_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0735674   .0785803    -0.94   0.349    -.2275819    .0804471
------------------------------------------------------------------------------
Warning: 77 propensity scores trimmed to lower limit ..
Warning: 20 propensity scores trimmed to upper limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_8756/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L7_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L7_1
E[D|X]       = D1_pystacked_L7_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0793095   .0200877    -3.95   0.000    -.1186807   -.0399384
------------------------------------------------------------------------------
Warning: 4 propensity scores trimmed to lower limit ..
Warning: 1 propensity scores trimmed to upper limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_8756/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L8_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L8_1
E[D|X]       = D1_pystacked_L8_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1050444   .0156777    -6.70   0.000    -.1357721   -.0743167
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_8756/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L9_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L9_1
E[D|X]       = D1_pystacked_L9_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1103786   .0150641    -7.33   0.000    -.1399037   -.0808534
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_8756/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L10_1                 Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L10_1
E[D|X]       = D1_pystacked_L10_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0867641   .0186783    -4.65   0.000    -.1233728   -.0501554
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_8756/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L11_1                 Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L11_1
E[D|X]       = D1_pystacked_L11_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |   -.070086   .0310936    -2.25   0.024    -.1310284   -.0091436
------------------------------------------------------------------------------
Warning: 83 propensity scores trimmed to lower limit ..
Warning: 20 propensity scores trimmed to upper limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_8756/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L12_1                 Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L12_1
E[D|X]       = D1_pystacked_L12_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1237656   .0153973    -8.04   0.000    -.1539438   -.0935874
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_8756/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L13_1                 Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L13_1
E[D|X]       = D1_pystacked_L13_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |   .5017543   .2437855     2.06   0.040     .0239435    .9795651
------------------------------------------------------------------------------
Warning: 191 propensity scores trimmed to lower limit ..
Warning: 145 propensity scores trimmed to upper limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_8756/results.dta saved
. 
. }       

.         
. *****************************************************************************
> *  
. *** interactive NX: short-stacking                                           
>                                       ***
. *****************************************************************************
> *
. 
. if (`estimator'==3) {
. 
. gen one = 1     
. 
.         cap drop y0base*
.         cap drop dbase*
.         cap drop y1base*
. 
.         *** no cross-fitting
.         pystacked lnearn $X_expanded   $pystring_reg0  if gender_r == 0, type
> (reg) njobs($cores)  
.                 mat nxw_ia_y0 = e(weights)
.                 mat list nxw_ia_y0
.                                 preserve
.                                 svmat nxw_ia_y0
.                                 keep nxw_ia_y0*
.                                 save `folder'/nxw_ia_y0, replace
.                                 restore
.         predict y0base0, xb
.         predict y0base, base
. 
.         pystacked lnearn $X_expanded  $pystring_reg0 if gender_r == 1  , type
> (reg) njobs($cores)  
.                 mat nxw_ia_y1 = e(weights)
.                 mat list nxw_ia_y1
.                                 preserve
.                                 svmat nxw_ia_y1
.                                 keep nxw_ia_y1*
.                                 save `folder'/nxw_ia_y1, replace
.                                 restore
.         predict y1base0, xb
.         predict y1base, base
. 
.         pystacked gender_r $X_expanded $pystring_class  
.                 mat nxw_ia_d = e(weights)
.                 mat list nxw_ia_d
.                                 preserve
.                                 svmat nxw_ia_d
.                                 keep nxw_ia_d*
.                                 save `folder'/nxw_ia_d, replace
.                                 restore         
.         predict dbase0, pr
.         predict dbase, base pr
.         
.         forvalues i = 0(1)$L {
  2.                         _estimate_ate interactive, yname(lnearn) dname(gen
> der_r) ///
>                                                 y0(y0base`i') y1(y1base`i') d
> (dbase`i') ///
>                                                 atet foldid(one) robust model
> (interactive)
  3.                         regsave gender_r using `folder'/results.dta, ///
>                                                 ci addlabel(model,nxinter,see
> d,`seed',final,nx,learner,`i') append
  4.         }
.                 
. }

.         
. *****************************************************************************
> *  
. *** partial NX: short-stacking                                               
>                                       ***
. *****************************************************************************
> *
. 
. if (`estimator'==4) {
.         
. cap gen one = 1 
. 
.         cap drop Ybase* 
.         cap drop Dbase*
. 
.         *** no cross-fitting
.         pystacked lnearn $X_expanded $pystring_reg 
.                 mat nxw_y = e(weights)
.                 mat list nxw_y
.                                 preserve
.                                 svmat nxw_y
.                                 keep nxw_y*
.                                 save `folder'/nxw_y, replace
.                                 restore
.         predict Ybase0
.         predict Ybase, basexb
. 
.         pystacked gender_r $X_expanded $pystring_reg 
.                 mat nxw_d = e(weights)
.                 mat list nxw_d
.                                 preserve
.                                 svmat nxw_d
.                                 keep nxw_d*
.                                 save `folder'/nxw_d, replace
.                                 restore         
.         predict Dbase0
.         predict Dbase, basexb
. 
.         forvalues i = 0(1)$L {
  2.                 cap drop Ytil
  3.                 cap drop Dtil
  4.                 gen Ytil = lnearn - Ybase`i'
  5.                 gen Dtil = gender_r - Dbase`i'
  6.                 reg Ytil Dtil, robust
  7.                 regsave Dtil using `folder'/results.dta, ///
>                         ci addlabel(model,nxpartial,seed,`seed',final,nx,lear
> ner,`i') append
  8.         }
. 
. }

.         
. cap log close
