-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /cluster/home/kahrens/ddml_applied/GWG/Output/GWG_3702_2.txt
  log type:  text
 opened on:  10 Dec 2023, 19:14:53

. 
. which ddml
/cluster/home/kahrens/ado/plus/d/ddml.ado
*! ddml v1.4.3
*! last edited: 17aug2023
*! authors: aa/ms

. which pystacked
/cluster/home/kahrens/ado/plus/p/pystacked.ado
*! pystacked v0.7.5
*! last edited: 7aug2023
*! authors: aa/ms

. 
. set seed `seed'

. local folder out_`seed'

. 
. use "../Data/gender_gap_ML_processed", clear

. 
. cap mkdir `folder'

. 
. *****************************************************************************
> ***
. ***  controls
. *****************************************************************************
> ***
. 
. // create squared age and tenure here
. gen age_r2 = age_r^2

. gen tenure2 = tenure^2
(2 missing values generated)

. 
. // no base categories
. global continuous                                                            
>                                                            ///
>         age_r                                                                
>                                                                    /// no mis
> sing
>         yrsqual         /* years of education (derived) */                   
>                                    /// 355 missing
>         /// leavedu             /* age when left education (derived) */      
>                            /// 1,081 missing
>         pvlit1          /* literacy score: plausible value 1 (also 2-10 avail
> ) */       /// no missing
>         pvnum1          /* numeracy score: plausible value 1 (also 2-10 avail
> ) */       /// no missing
>         tenure          /* tenure = years in work for current employer */    
>                    /// 2 missing
>                                                                              
>                                                                            //

. // add second order terms here
. global continuous $continuous age_r2 tenure2

. 
. global discrete0                                                             
>                                                            ///             
>         b_q01a          /* education, highest level attained */              
>                            /// no missing
>         b_q01b          /* area of study */                                  
>                                                    /// 434 missing
>         d_q06c          /* part of a larger organization */                  
>                                    /// 13 missing
>         d_q08a          /* management position */                            
>                                            /// no missing
>         d_q09           /* type of contract */                               
>                                            /// 12 missing
>         d_q10_t1        /* hours per week at this job or business */         
>                    /// 1 missing
>         d_q14           /* job satisfaction */                               
>                                            /// 1 missing
>         i_q08           /* health status */                                  
>                                                    /// 2 missing
>         j_q02a          /* living with a partner */                          
>                                            /// 899 missing
>         j_q03d1_c       /* age of youngest child */                          
>                                            /// 2,718 missing
>         j_q04c1_c       /* immigration: age */                               
>                                            /// 4,375 missing
>         j_q06b          /* mother's highest level of educ */                 
>                            /// 445 missing
>         j_q07b          /* father's highest level of educ */                 
>                            /// 515 missing
>         j_q03b          /* number of children*/                              
>                                            /// 1,856 missing
>         impar           /* immigration: parents */                           
>                                            /// 21 missing
>         imgen           /* immigration: generation */                        
>                                    /// 344 missing
>         nfe12jr         /* informal job-related educ in prev 12 months */    
>                    /// 116 missing
>         nfe12njr        /* informal non-job-related educ in prev 12 months */
>            /// 116 missing
>                                                                              
>                                                                            //
>                                                                              
>                                                          

. global personality                                                           
>                                                            ///
>         i_q04b          /* Learning strategies, Relate new ideas into real li
> fe */      /// 16 missing
>         i_q04d          /* Learning strategies, Like learning new things */  
>                    /// no missing
>         i_q04h          /* Learning strategies, Attribute something new */   
>                    /// 10 missing
>         i_q04j          /* Learning strategies, Deal with difficult things */
>            /// no missing
>         i_q04l          /* Learning strategies, Fit different ideas together 
> */         /// 5 missing
>         i_q04m          /* Learning strategies, Looking for additional info *
> /          /// 1 missing
>         i_q05f          /* Cultural engagement, Voluntary non-profit work */ 
>            /// no missing
>         i_q06a          /* Political efficacy, No influence on the government
>  */        /// 14 missing
>         i_q07a          /* Social trust, Trust only few people */            
>                            /// 4 missing
>         i_q07b          /* Social trust, Other people take advantage of you *
> /          /// 6 missing
>                                                                              
>                                                                            //

. global discrete $discrete0                                                   
>                                                    ///
>         new_reg_tl2     /* geographical region */                            
>                                            /// 2 missing
>         new_isco1c      /* occupation */                                     
>                                                    /// no missing
>         new_isic1c      /* industry */                                       
>                                                    // no missing

. 
. global X_simple                                                         ///
>         i.(b_q01a d_q10_t1 j_q03b)                              ///
>         c.($continuous)

. 
. global X_fullinteracted                                         ///
>         i.($discrete0 )                                                 ///
>         i.new_isco1c#i.new_isic1c#i.new_reg_tl2 ///
>         c.($continuous)                  

.         
. global X_cont                                                           ///
>         c.($continuous)##i.($discrete)

. 
. global X_expanded                                                       ///
>         i.($discrete)                                                   ///
>         c.($continuous)                                                 ///
>         c.age_r#i.($discrete)                                   ///
>         c.tenure#i.($discrete)

. 
.         
. 
. *****************************************************************************
> ***
. ***  estimation sample
. *****************************************************************************
> ***
. 
. gen byte touse=1

. markout touse lnearn $X_expanded

. keep if touse
(53 observations deleted)

. 
. 
. *****************************************************************************
> ***
. ***  learners
. *****************************************************************************
> ***
. 
. global cores = 5

. 
. global rf1 min_samples_leaf(1)  max_features(sqrt) n_estimators(500)

. global rf2 min_samples_leaf(50)  max_features(sqrt) n_estimators(500)

. global rf3 min_samples_leaf(100)  max_features(sqrt) n_estimators(500)

. global grad1 n_estimators(500) n_iter_no_change(10)  

. global grad2 n_estimators(500)  

. global nnet1 hidden_layer_sizes(40 20 1 20 50) early_stopping 

. global nnet2 hidden_layer_sizes(30 30 30) early_stopping  

. 
. global pystring_reg0                                                         
>    || ///
>                                         m(ols)                               
>                            || ///
>                                         m(ols) xvars($X_simple)              
>            || ///
>                                         m(lassocv)                           
>                            || ///
>                                         m(ridgecv)                           
>                            || ///
>                                         m(lassocv)      xvars($X_cont)       
>            || ///
>                                         m(ridgecv)      xvars($X_cont)       
>            || ///
>                                         m(rf) opt($rf1)                      
>                    || ///
>                                         m(rf) opt($rf2)                      
>                    || ///
>                                         m(rf) opt($rf3)                      
>                    || ///
>                                         m(gradboost) opt($grad1)             
>            || ///
>                                         m(gradboost) opt($grad2)             
>            || ///
>                                         m(nnet) opt($nnet1)                  
>            || ///
>                                         m(nnet) opt($nnet2)                  
>            || //

. 
. global pystring_reg  $pystring_reg0 , type(reg) njobs($cores) 

.  
. global pystring_class0                                                       
>            || ///
>                                         m(logit)                             
>                            || ///
>                                         m(logit) xvars($X_simple)            
>            || ///
>                                         m(lassocv)                           
>                            || ///
>                                         m(ridgecv)                           
>                            || ///
>                                         m(lassocv)      xvars($X_cont)       
>            || ///
>                                         m(ridgecv)      xvars($X_cont)       
>            || ///
>                                         m(rf) opt($rf1)                      
>                    || ///
>                                         m(rf) opt($rf2)                      
>                    || ///
>                                         m(rf) opt($rf3)                      
>                    || ///
>                                         m(gradboost) opt($grad1)             
>            || ///
>                                         m(gradboost) opt($grad2)             
>            || ///
>                                         m(nnet) opt($nnet1)                  
>            || ///
>                                         m(nnet) opt($nnet2)                  
>            || //                   

.                                 
. global pystring_class $pystring_class0 , type(class) njobs($cores)

.                                         
. global R =1  

. global K=10 

. global L =13

.         
. *****************************************************************************
> *  
. *** ddml: estimation                                                         
>                                               ***
. *****************************************************************************
> *
. 
. if (`estimator'==1) {
. 
.         ddml init partial,  reps($R) kfolds($K)
.         ddml E[Y|X]: pystacked lnearn $X_expanded $pystring_reg
.         ddml E[D|X]: pystacked gender_r $X_expanded $pystring_reg
.         ddml crossfit, shortstack poolstack
.         ddml estimate, robust
.         
.         foreach mat in lnearn_mse gender_r_mse {
  2.                         ddml extract, show(mse)
  3.                         mat `mat' = r(`mat')
  4.                         mat list `mat'
  5.                                 preserve
  6.                                 svmat `mat'
  7.                                 keep `mat'*
  8.                                 keep if _n<=$L
  9.                                 gen stack_type = "conventional" if _n==1
 10.                                 replace stack_type = "pooled" if _n==2
 11.                                 replace stack_type = "short" if _n==3
 12.                                 gen model = "plm"
 13.                                 list if _n<=$L
 14.                                 save `folder'/`mat'_plm_mse, replace
 15.                                 restore 
 16.         }       
. 
.         cap drop mse_*
.         foreach var of varlist Y1_* {
  2.                  cap drop sqerr_`var'
  3.                  gen double sqerr_`var'=(lnearn-`var')^2
  4.                  sum sqerr_`var', meanonly
  5.                  gen double mse_`var'=r(mean) if _n ==1 
  6.         }
.         foreach var of varlist D1_* {
  2.                  cap drop sqerr_`var'
  3.                  gen double sqerr_`var'=(gender_r-`var')^2
  4.                  sum sqerr_`var', meanonly
  5.                  gen double mse_`var'=r(mean) if _n ==1 
  6.         }
.         preserve
.                 keep mse_*
.                 keep if _n==1
.                 save `folder'/plm_mse, replace
.         restore
.         cap drop mse_*
. 
.         ** initialize results file
.         regsave gender_r using `folder'/results.dta, ci addlabel(model,partia
> l,seed,`seed',final,init,learner,-99) replace
. 
.         foreach final in nnls1 singlebest ols avg {
  2. 
.                 ddml estimate, robust finalest(`final')
  3.         
.                         // regular stacking results
.                         ddml estimate, mname(m0) spec(st) replay  
  4.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,partial,seed,`seed',final,`final',learner,-1) append
  5.                         
.                         // shortstacking results
.                         ddml estimate, mname(m0) spec(ss) replay 
  6.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,partial,seed,`seed',final,`final',learner,-2) append
  7.                         
.                         // poolstacking results
.                         ddml estimate, mname(m0) spec(ps) replay  
  8.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,partial,seed,`seed',final,`final',learner,-3) append     
  9.                 
.                         // pystacked weights
.                         ddml extract, show(stweights)   
 10.                         foreach mat in Y1_pystacked_w_mn D1_pystacked_w_mn
>  {
 11.                                         ddml extract, show(stweights)   
 12.                                         mat `mat' = r(`mat')
 13.                                         mat list `mat'
 14.                                                 preserve
 15.                                                 svmat `mat'
 16.                                                 keep `mat'*
 17.                                                 list if _n<=4
 18.                                                 save `folder'/`mat'_`final
> '_regular, replace
 19.                                                 restore
 20.                         }       
 21.                         // shortstacked weights
.                         ddml extract, show(ssweights)
 22.                         foreach mat in Y_lnearn_ss D_gender_r_ss {
 23.                                         qui ddml extract, show(ssweights)
 24.                                         mat `mat' = r(`mat')
 25.                                         mat list `mat'
 26.                                                 preserve
 27.                                                 svmat `mat'
 28.                                                 keep `mat'*
 29.                                                 list if _n<=4
 30.                                                 save `folder'/`mat'_`final
> '_short, replace
 31.                                                 restore
 32.                         }       
 33.                         // poolstacked weights
. 
.                         foreach mat in Y_lnearn_ps D_gender_r_ps {
 34.                                         qui ddml extract, show(psweights)
 35.                                         mat `mat' = r(`mat')
 36.                                         mat list `mat'
 37.                                                 preserve
 38.                                                 svmat `mat'
 39.                                                 keep `mat'*
 40.                                                 list if _n<=4
 41.                                                 save `folder'/`mat'_`final
> '_pooled, replace
 42.                                                 restore
 43.                         }       
 44.         
.         }
. 
.         forvalues i = 1(1)$L {
  2.                         ddml estimate, y(Y1_pystacked_L`i'_1) ///
>                                                         d(D1_pystacked_L`i'_1
> ) robust
  3.                         regsave gender_r using `folder'/results.dta, ci //
> /
>                                                 addlabel(model,partial,seed,`
> seed',final,indiv,learner,`i') ///
>                                                 append
  4.         }
. 
. }

.         
. *****************************************************************************
> *  
. *** interactive: estimation                                                  
>                                       ***
. *****************************************************************************
> *
.         
. if (`estimator'==2) {   
. 
.         ddml init interactive, kfolds($K) reps($R)
.         ddml E[Y|X,D]: pystacked lnearn $X_expanded $pystring_reg
Learner Y1_pystacked added successfully.
.         ddml E[D|X]: pystacked gender_r $X_expanded $pystring_class
Learner D1_pystacked added successfully.
.         ddml crossfit, shortstack poolstack
Cross-fitting E[y|X,D] equation: lnearn
Cross-fitting fold 1 2 3 4 5 6 7 8 9 10 ...completed cross-fitting...completed 
> short-stacking...completed pooled-stacking
Cross-fitting E[D|X] equation: gender_r
Cross-fitting fold 1 2 3 4 5 6 7 8 9 10 ...completed cross-fitting...completed 
> short-stacking...completed pooled-stacking
.         ddml estimate, robust atet


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.065    (0.035)
  ss  1  [shortstack]          [ss]          [ss]    -0.067    (0.038)
  ps  1   [poolstack]          [ps]          [ps]    -0.068    (0.033)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0667166   .0378128    -1.76   0.078    -.1408282    .0073951
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 7 propensity scores trimmed to lower limit .01.

. 
.         cap drop mse_*
.         foreach var of varlist Y1_pystacked0* {
  2.                  cap drop sqerr_`var'
  3.                  gen double sqerr_`var'=(lnearn-`var')^2 if gender_r==0
  4.                  sum sqerr_`var' if gender_r==0, meanonly
  5.                  gen double mse_`var'=r(mean) if _n ==1 
  6.         }
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
.         foreach var of varlist Y1_pystacked1* {
  2.                  cap drop sqerr_`var'
  3.                  gen double sqerr_`var'=(lnearn-`var')^2 if gender_r==1
  4.                  sum sqerr_`var' if gender_r==1, meanonly
  5.                  gen double mse_`var'=r(mean) if _n ==1 
  6.         }
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
.         foreach var of varlist D1_* {
  2.                  cap drop sqerr_`var'
  3.                  gen double sqerr_`var'=(gender_r-`var')^2
  4.                  sum sqerr_`var', meanonly
  5.                  gen double mse_`var'=r(mean) if _n ==1 
  6.         }
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
.         preserve
.                 keep mse_*
.                 keep if _n==1
(4,835 observations deleted)
.                 save `folder'/inter_mse, replace
(note: file out_3702/inter_mse.dta not found)
file out_3702/inter_mse.dta saved
.         restore
.         cap drop mse_*
.         
.         local mat gender_r_mse
.                         ddml extract, show(mse)

MSEs for gender_r:
                 rep   full smp      fold 1      fold 2      fold 3      fold 4
>       fold 5      fold 6      fold 7      fold 8      fold 9     fold 10 
    D1_pystacked   1      0.155       0.131       0.154       0.173       0.147
>        0.165       0.158       0.157       0.153       0.150       0.161  
   D_gender_r_ps   1      0.155       0.132       0.154       0.173       0.146
>        0.164       0.158       0.156       0.153       0.149       0.161  
   D_gender_r_ss   1      0.154       0.131       0.154       0.173       0.146
>        0.164       0.158       0.156       0.152       0.148       0.161  

MSEs for lnearn:
                D=  rep   full smp      fold 1      fold 2      fold 3      fol
> d 4      fold 5      fold 6      fold 7      fold 8      fold 9     fold 10 
    Y1_pystacked 0    1      0.227       0.126       0.201       0.508       0.
> 158       0.235       0.191       0.181       0.173       0.259       0.190  
    Y1_pystacked 1    1      0.174       0.162       0.097       0.131       0.
> 131       0.172       0.306       0.208       0.165       0.231       0.138  
     Y_lnearn_ps 0    1      8.302       8.344       8.341       8.162       8.
> 331       8.418       8.100       8.119       8.533       8.465       8.235  
     Y_lnearn_ps 1    1      7.495       7.440       7.711       7.260       7.
> 404       7.551       7.625       7.565       7.581       7.328       7.450  
     Y_lnearn_ss 0    1      0.225       0.125       0.194       0.506       0.
> 159       0.233       0.190       0.179       0.171       0.254       0.189  
     Y_lnearn_ss 1    1      0.173       0.163       0.096       0.131       0.
> 130       0.171       0.301       0.206       0.164       0.231       0.137  
.                         mat `mat' = r(`mat')
.                         mat list `mat'

gender_r_mse[3,12]
                      rep  full_sample        fold1        fold2        fold3
D1_pystacked            1    .15494308    .13137051    .15443632    .17254321
D_gender_r~s            1    .15459465    .13184356    .15411175    .17282574
D_gender_r~s            1    .15439833    .13146776    .15395377    .17284853

                    fold4        fold5        fold6        fold7        fold8
D1_pystacked    .14729125     .1650698    .15827555    .15678477    .15287338
D_gender_r~s    .14640718    .16445974    .15766932    .15601958    .15255195
D_gender_r~s    .14600049    .16441684    .15785108    .15614906    .15181733

                    fold9       fold10
D1_pystacked    .14977194    .16100436
D_gender_r~s    .14885575    .16119472
D_gender_r~s    .14826299    .16120801
.                                 preserve
.                                 svmat `mat'
.                                 keep `mat'*
.                                 keep if _n<=$L
(4,823 observations deleted)
.                                 gen stack_type = "conventional" if _n==1
(12 missing values generated)
.                                 replace stack_type = "pooled" if _n==2
(1 real change made)
.                                 replace stack_type = "short" if _n==3
(1 real change made)
.                                 gen model = "interactive"
.                                 list if _n<=$L

     +-----------------------------------------------------------------+
  1. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        1 | .1549431 | .1313705 | .1544363 | .1725432 | .1472912 |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     | .1650698 | .1582755 | .1567848 | .1528734 | .1497719 | .1610044 |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |          conventional          |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  2. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        1 | .1545946 | .1318436 | .1541117 | .1728257 | .1464072 |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     | .1644597 | .1576693 | .1560196 | .1525519 | .1488557 | .1611947 |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                pooled          |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  3. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        1 | .1543983 | .1314678 | .1539538 | .1728485 | .1460005 |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     | .1644168 | .1578511 | .1561491 | .1518173 |  .148263 |  .161208 |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                 short          |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  4. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  5. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  6. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  7. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  8. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  9. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 10. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 11. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 12. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 13. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+
.                                 save `folder'/`mat'_inter_gender_mse, replace
(note: file out_3702/gender_r_mse_inter_gender_mse.dta not found)
file out_3702/gender_r_mse_inter_gender_mse.dta saved
.                                 restore 
.                                 
.         local mat lnearn_mse
.                         ddml extract, show(mse)

MSEs for gender_r:
                 rep   full smp      fold 1      fold 2      fold 3      fold 4
>       fold 5      fold 6      fold 7      fold 8      fold 9     fold 10 
    D1_pystacked   1      0.155       0.131       0.154       0.173       0.147
>        0.165       0.158       0.157       0.153       0.150       0.161  
   D_gender_r_ps   1      0.155       0.132       0.154       0.173       0.146
>        0.164       0.158       0.156       0.153       0.149       0.161  
   D_gender_r_ss   1      0.154       0.131       0.154       0.173       0.146
>        0.164       0.158       0.156       0.152       0.148       0.161  

MSEs for lnearn:
                D=  rep   full smp      fold 1      fold 2      fold 3      fol
> d 4      fold 5      fold 6      fold 7      fold 8      fold 9     fold 10 
    Y1_pystacked 0    1      0.227       0.126       0.201       0.508       0.
> 158       0.235       0.191       0.181       0.173       0.259       0.190  
    Y1_pystacked 1    1      0.174       0.162       0.097       0.131       0.
> 131       0.172       0.306       0.208       0.165       0.231       0.138  
     Y_lnearn_ps 0    1      8.302       8.344       8.341       8.162       8.
> 331       8.418       8.100       8.119       8.533       8.465       8.235  
     Y_lnearn_ps 1    1      7.495       7.440       7.711       7.260       7.
> 404       7.551       7.625       7.565       7.581       7.328       7.450  
     Y_lnearn_ss 0    1      0.225       0.125       0.194       0.506       0.
> 159       0.233       0.190       0.179       0.171       0.254       0.189  
     Y_lnearn_ss 1    1      0.173       0.163       0.096       0.131       0.
> 130       0.171       0.301       0.206       0.164       0.231       0.137  
.                         mat `mat' = r(`mat')
.                         mat list `mat'

lnearn_mse[6,13]
                    D=0/1          rep  full_sample        fold1        fold2
Y1_pystacked            0            1    .22694137    .12562197    .20057248
Y1_pystacked            1            1    .17381154    .16167136    .09659605
 Y_lnearn_ps            0            1    8.3020253    8.3436286    8.3408248
 Y_lnearn_ps            1            1    7.4951911    7.4403284    7.7110419
 Y_lnearn_ss            0            1     .2248779    .12481918    .19406689
 Y_lnearn_ss            1            1    .17289746    .16297722    .09574961

                    fold3        fold4        fold5        fold6        fold7
Y1_pystacked    .50757709    .15817784    .23494772    .19096338    .18078613
Y1_pystacked     .1309295     .1309049    .17199222    .30637357    .20757381
 Y_lnearn_ps    8.1623113    8.3311424    8.4178023    8.0998939    8.1193624
 Y_lnearn_ps     7.260107    7.4041043    7.5508686    7.6245804    7.5648886
 Y_lnearn_ss    .50552695    .15894952    .23268397    .19011692    .17911389
 Y_lnearn_ss    .13147117    .13004842    .17107746    .30129317    .20580625

                    fold8        fold9       fold10
Y1_pystacked    .17251298     .2585023    .18969008
Y1_pystacked    .16522081    .23075129    .13792318
 Y_lnearn_ps    8.5328202    8.4645323    8.2353933
 Y_lnearn_ps    7.5814645    7.3279831    7.4497872
 Y_lnearn_ss    .17069906    .25354149    .18855845
 Y_lnearn_ss     .1638104     .2310134      .137404
.                                 preserve
.                                 svmat `mat'
.                                 keep `mat'*
.                                 keep if _n<=(2*$L)
(4,810 observations deleted)
.                                 gen stack_type = "conventional" if _n<=2
(24 missing values generated)
.                                 replace stack_type = "pooled" if _n>=3 & _n<=
> 4
(2 real changes made)
.                                 replace stack_type = "short" if _n>4
(22 real changes made)
.                                 gen model = "interactive"
.                                 list if _n<=(2*$L)

     +-----------------------------------------------------------------+
  1. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        0 |        1 | .2269414 |  .125622 | .2005725 | .5075771 |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     | .1581778 | .2349477 | .1909634 | .1807861 |  .172513 | .2585023 |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |     .1896901     |     conventional      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  2. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        1 |        1 | .1738115 | .1616714 | .0965961 | .1309295 |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     | .1309049 | .1719922 | .3063736 | .2075738 | .1652208 | .2307513 |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |     .1379232     |     conventional      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  3. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        0 |        1 | 8.302026 | 8.343629 | 8.340825 | 8.162312 |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     | 8.331142 | 8.417802 | 8.099894 | 8.119363 |  8.53282 | 8.464532 |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |     8.235394     |           pooled      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  4. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        1 |        1 | 7.495191 | 7.440329 | 7.711042 | 7.260107 |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     | 7.404104 | 7.550869 |  7.62458 | 7.564888 | 7.581464 | 7.327983 |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |     7.449787     |           pooled      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  5. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        0 |        1 | .2248779 | .1248192 | .1940669 |  .505527 |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     | .1589495 |  .232684 | .1901169 | .1791139 | .1706991 | .2535415 |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |     .1885584     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  6. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        1 |        1 | .1728975 | .1629772 | .0957496 | .1314712 |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     | .1300484 | .1710775 | .3012932 | .2058063 | .1638104 | .2310134 |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |      .137404     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  7. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  8. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  9. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 10. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 11. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 12. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 13. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 14. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 15. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 16. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 17. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 18. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 19. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 20. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 21. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 22. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 23. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 24. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 25. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 26. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+
.                                 save `folder'/`mat'_inter_lnearn_mse, replace
(note: file out_3702/lnearn_mse_inter_lnearn_mse.dta not found)
file out_3702/lnearn_mse_inter_lnearn_mse.dta saved
.                                 restore 
.         
.         foreach final in nnls1 singlebest ols avg {
  2. 
.                 ddml estimate, robust finalest(`final') atet
  3.         
.                         // regular stacking results
.                         ddml estimate, mname(m0) spec(st) replay atet
  4.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,interactive,seed,`seed',final,`final',learner,-1) append
  5.                         
.                         // shortstacking results
.                         ddml estimate, mname(m0) spec(ss) replay atet
  6.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,interactive,seed,`seed',final,`final',learner,-2) append
  7.                         
.                         // poolstacking results
.                         ddml estimate, mname(m0) spec(ps) replay atet
  8.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,interactive,seed,`seed',final,`final',learner,-3) append
  9.                 
.                         // pystacked weights
.                         ddml extract, show(stweights)
 10.                         foreach mat in Y1_pystacked_w_mn D1_pystacked_w_mn
>  {
 11.                                         ddml extract, show(stweights)
 12.                                         mat `mat' = r(`mat')
 13.                                         mat list `mat'
 14.                                                 preserve
 15.                                                 svmat `mat'
 16.                                                 keep `mat'*
 17.                                                 list if _n<=8
 18.                                                 save `folder'/`mat'_`final
> '_regular_ia, replace
 19.                                                 restore
 20.                         }       
 21.                         // shortstacked weights
.                         ddml extract, show(ssweights)
 22.                         foreach mat in Y_lnearn_ss D_gender_r_ss {
 23.                                         ddml extract, show(ssweights)
 24.                                         mat `mat' = r(`mat')
 25.                                         mat list `mat'
 26.                                                 preserve
 27.                                                 svmat `mat'
 28.                                                 keep `mat'*
 29.                                                 list if _n<=8
 30.                                                 save `folder'/`mat'_`final
> '_short_ia, replace
 31.                                                 restore
 32.                         }       
 33.                         // poolstacked weights
.                         ddml extract, show(psweights)
 34.                         foreach mat in Y_lnearn_ps D_gender_r_ps {
 35.                                         ddml extract, show(psweights)
 36.                                         mat `mat' = r(`mat')
 37.                                         mat list `mat'
 38.                                                 preserve
 39.                                                 svmat `mat'
 40.                                                 keep `mat'*
 41.                                                 list if _n<=8
 42.                                                 save `folder'/`mat'_`final
> '_pooled_ia, replace
 43.                                                 restore
 44.                         }       
 45.         
.         }


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.065    (0.035)
  ss  1  [shortstack]          [ss]          [ss]    -0.067    (0.038)
  ps  1   [poolstack]          [ps]          [ps]    -0.068    (0.033)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0667166   .0378128    -1.76   0.078    -.1408282    .0073951
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 7 propensity scores trimmed to lower limit .01.



Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.065    (0.035)
  ss  1  [shortstack]          [ss]          [ss]    -0.067    (0.038)
  ps  1   [poolstack]          [ps]          [ps]    -0.068    (0.033)

Stacking DDML model (ATET)
E[y|X,D=0]   = Y1_pystacked0_1                     Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1
E[D|X]       = D1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |   -.065428   .0353228    -1.85   0.064    -.1346595    .0038035
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 6 propensity scores trimmed to lower limit .01.

(note: variable final was str5, now str10 to accommodate using data's values)
file out_3702/results.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  ss  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.067    (0.038)
  ss  1  [shortstack]          [ss]          [ss]    -0.067    (0.038)
  ps  1   [poolstack]          [ps]          [ps]    -0.068    (0.033)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0667166   .0378128    -1.76   0.078    -.1408282    .0073951
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 7 propensity scores trimmed to lower limit .01.

(note: variable final was str5, now str10 to accommodate using data's values)
file out_3702/results.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  ps  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.068    (0.033)
  ss  1  [shortstack]          [ss]          [ss]    -0.067    (0.038)
  ps  1   [poolstack]          [ps]          [ps]    -0.068    (0.033)

Poolstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ps0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ps1
E[D|X]       = D_gender_r_ps_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0680321    .032781    -2.08   0.038    -.1322817   -.0037826
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 5 propensity scores trimmed to lower limit .01.

(note: variable final was str5, now str10 to accommodate using data's values)
file out_3702/results.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .21803932    .21803932
    logit            2    4.247e-17    4.247e-17
  lassocv            3     .0692831     .0692831
  ridgecv            4    .09032006    .09032006
  lassocv            5    .03305321    .03305321
  ridgecv            6    .02028478    .02028478
       rf            7    .24906363    .24906363
       rf            8    2.679e-17    2.679e-17
       rf            9    6.899e-17    6.899e-17
gradboost           10    .07572601    .07572601
gradboost           11    .20248597    .20248597
     nnet           12    .00196324    .00196324
     nnet           13    .03978067    .03978067

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .02613937    .02613937
      ols            2            0    .00707522    .00707522
  lassocv            3            0    .13901224    .13901224
  ridgecv            4            0    .15035935    .15035935
  lassocv            5            0     .0296065     .0296065
  ridgecv            6            0    .00570947    .00570947
       rf            7            0    .44532733    .44532733
       rf            8            0    1.064e-16    1.064e-16
       rf            9            0    1.187e-16    1.187e-16
gradboost           10            0    .01974657    .01974657
gradboost           11            0    .16690694    .16690694
     nnet           12            0    .00318497    .00318497
     nnet           13            0    .00693204    .00693204
      ols            1            1    .00642918    .00642918
      ols            2            1    .00125036    .00125036
  lassocv            3            1    .14617932    .14617932
  ridgecv            4            1    .06456203    .06456203
  lassocv            5            1    .16886308    .16886308
  ridgecv            6            1    .00225277    .00225277
       rf            7            1      .514704      .514704
       rf            8            1    1.676e-13    1.676e-13
       rf            9            1    5.105e-13    5.105e-13
gradboost           10            1    .00704231    .00704231
gradboost           11            1    .05655514    .05655514
     nnet           12            1    .01025749    .01025749
     nnet           13            1    .02190431    .02190431

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .21803932    .21803932
    logit            2    4.247e-17    4.247e-17
  lassocv            3     .0692831     .0692831
  ridgecv            4    .09032006    .09032006
  lassocv            5    .03305321    .03305321
  ridgecv            6    .02028478    .02028478
       rf            7    .24906363    .24906363
       rf            8    2.679e-17    2.679e-17
       rf            9    6.899e-17    6.899e-17
gradboost           10    .07572601    .07572601
gradboost           11    .20248597    .20248597
     nnet           12    .00196324    .00196324
     nnet           13    .03978067    .03978067

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .02613937    .02613937
      ols            2            0    .00707522    .00707522
  lassocv            3            0    .13901224    .13901224
  ridgecv            4            0    .15035935    .15035935
  lassocv            5            0     .0296065     .0296065
  ridgecv            6            0    .00570947    .00570947
       rf            7            0    .44532733    .44532733
       rf            8            0    1.064e-16    1.064e-16
       rf            9            0    1.187e-16    1.187e-16
gradboost           10            0    .01974657    .01974657
gradboost           11            0    .16690694    .16690694
     nnet           12            0    .00318497    .00318497
     nnet           13            0    .00693204    .00693204
      ols            1            1    .00642918    .00642918
      ols            2            1    .00125036    .00125036
  lassocv            3            1    .14617932    .14617932
  ridgecv            4            1    .06456203    .06456203
  lassocv            5            1    .16886308    .16886308
  ridgecv            6            1    .00225277    .00225277
       rf            7            1      .514704      .514704
       rf            8            1    1.676e-13    1.676e-13
       rf            9            1    5.105e-13    5.105e-13
gradboost           10            1    .00704231    .00704231
gradboost           11            1    .05655514    .05655514
     nnet           12            1    .01025749    .01025749
     nnet           13            1    .02190431    .02190431

Y1_pystacked_w_mn[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .02613937    .02613937
      ols            2            0    .00707522    .00707522
  lassocv            3            0    .13901224    .13901224
  ridgecv            4            0    .15035935    .15035935
  lassocv            5            0     .0296065     .0296065
  ridgecv            6            0    .00570947    .00570947
       rf            7            0    .44532733    .44532733
       rf            8            0    1.064e-16    1.064e-16
       rf            9            0    1.187e-16    1.187e-16
gradboost           10            0    .01974657    .01974657
gradboost           11            0    .16690694    .16690694
     nnet           12            0    .00318497    .00318497
     nnet           13            0    .00693204    .00693204
      ols            1            1    .00642918    .00642918
      ols            2            1    .00125036    .00125036
  lassocv            3            1    .14617932    .14617932
  ridgecv            4            1    .06456203    .06456203
  lassocv            5            1    .16886308    .16886308
  ridgecv            6            1    .00225277    .00225277
       rf            7            1      .514704      .514704
       rf            8            1    1.676e-13    1.676e-13
       rf            9            1    5.105e-13    5.105e-13
gradboost           10            1    .00704231    .00704231
gradboost           11            1    .05655514    .05655514
     nnet           12            1    .01025749    .01025749
     nnet           13            1    .02190431    .02190431

      +-------------------------------------------+
      | Y1_pys~1   Y1_pys~2   Y1_pys~3   Y1_pys~4 |
      |-------------------------------------------|
   1. |        1          0   .0261394   .0261394 |
   2. |        2          0   .0070752   .0070752 |
   3. |        3          0   .1390122   .1390122 |
   4. |        4          0   .1503593   .1503593 |
   5. |        5          0   .0296065   .0296065 |
      |-------------------------------------------|
   6. |        6          0   .0057095   .0057095 |
   7. |        7          0   .4453273   .4453273 |
   8. |        8          0   1.06e-16   1.06e-16 |
      +-------------------------------------------+
(note: file out_3702/Y1_pystacked_w_mn_nnls1_regular_ia.dta not found)
file out_3702/Y1_pystacked_w_mn_nnls1_regular_ia.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .21803932    .21803932
    logit            2    4.247e-17    4.247e-17
  lassocv            3     .0692831     .0692831
  ridgecv            4    .09032006    .09032006
  lassocv            5    .03305321    .03305321
  ridgecv            6    .02028478    .02028478
       rf            7    .24906363    .24906363
       rf            8    2.679e-17    2.679e-17
       rf            9    6.899e-17    6.899e-17
gradboost           10    .07572601    .07572601
gradboost           11    .20248597    .20248597
     nnet           12    .00196324    .00196324
     nnet           13    .03978067    .03978067

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .02613937    .02613937
      ols            2            0    .00707522    .00707522
  lassocv            3            0    .13901224    .13901224
  ridgecv            4            0    .15035935    .15035935
  lassocv            5            0     .0296065     .0296065
  ridgecv            6            0    .00570947    .00570947
       rf            7            0    .44532733    .44532733
       rf            8            0    1.064e-16    1.064e-16
       rf            9            0    1.187e-16    1.187e-16
gradboost           10            0    .01974657    .01974657
gradboost           11            0    .16690694    .16690694
     nnet           12            0    .00318497    .00318497
     nnet           13            0    .00693204    .00693204
      ols            1            1    .00642918    .00642918
      ols            2            1    .00125036    .00125036
  lassocv            3            1    .14617932    .14617932
  ridgecv            4            1    .06456203    .06456203
  lassocv            5            1    .16886308    .16886308
  ridgecv            6            1    .00225277    .00225277
       rf            7            1      .514704      .514704
       rf            8            1    1.676e-13    1.676e-13
       rf            9            1    5.105e-13    5.105e-13
gradboost           10            1    .00704231    .00704231
gradboost           11            1    .05655514    .05655514
     nnet           12            1    .01025749    .01025749
     nnet           13            1    .02190431    .02190431

D1_pystacked_w_mn[13,3]
               learner  mean_weight        rep_1
    logit            1    .21803932    .21803932
    logit            2    4.247e-17    4.247e-17
  lassocv            3     .0692831     .0692831
  ridgecv            4    .09032006    .09032006
  lassocv            5    .03305321    .03305321
  ridgecv            6    .02028478    .02028478
       rf            7    .24906363    .24906363
       rf            8    2.679e-17    2.679e-17
       rf            9    6.899e-17    6.899e-17
gradboost           10    .07572601    .07572601
gradboost           11    .20248597    .20248597
     nnet           12    .00196324    .00196324
     nnet           13    .03978067    .03978067

      +--------------------------------+
      | D1_pys~1   D1_pys~2   D1_pys~3 |
      |--------------------------------|
   1. |        1   .2180393   .2180393 |
   2. |        2   4.25e-17   4.25e-17 |
   3. |        3   .0692831   .0692831 |
   4. |        4   .0903201   .0903201 |
   5. |        5   .0330532   .0330532 |
      |--------------------------------|
   6. |        6   .0202848   .0202848 |
   7. |        7   .2490636   .2490636 |
   8. |        8   2.68e-17   2.68e-17 |
      +--------------------------------+
(note: file out_3702/D1_pystacked_w_mn_nnls1_regular_ia.dta not found)
file out_3702/D1_pystacked_w_mn_nnls1_regular_ia.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .20992597    .20992597
    logit            2    1.156e-16    1.156e-16
  lassocv            3    .01908135    .01908135
  ridgecv            4    .20298821    .20298821
  lassocv            5            0            0
  ridgecv            6    4.210e-17    4.210e-17
       rf            7    .29338428    .29338428
       rf            8    1.352e-16    1.352e-16
       rf            9            0            0
gradboost           10            0            0
gradboost           11    .27462019    .27462019
     nnet           12            0            0
     nnet           13            0            0

short-stacked weights across resamples for lnearn
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07104056    .07104056
      ols            2            0    1.626e-16    1.626e-16
  lassocv            3            0    .06256651    .06256651
  ridgecv            4            0    .21310026    .21310026
  lassocv            5            0            0            0
  ridgecv            6            0    2.094e-16    2.094e-16
       rf            7            0     .4811649     .4811649
       rf            8            0    1.237e-16    1.237e-16
       rf            9            0    1.614e-16    1.614e-16
gradboost           10            0    2.252e-17    2.252e-17
gradboost           11            0    .17212777    .17212777
     nnet           12            0    1.240e-16    1.240e-16
     nnet           13            0            0            0
      ols            1            1    1.236e-17    1.236e-17
      ols            2            1    3.369e-17    3.369e-17
  lassocv            3            1    1.558e-18    1.558e-18
  ridgecv            4            1    .09267824    .09267824
  lassocv            5            1     .2738445     .2738445
  ridgecv            6            1            0            0
       rf            7            1    .52022851    .52022851
       rf            8            1            0            0
       rf            9            1    3.408e-17    3.408e-17
gradboost           10            1    6.847e-17    6.847e-17
gradboost           11            1    .06845877    .06845877
     nnet           12            1    2.096e-17    2.096e-17
     nnet           13            1    .04478998    .04478998

short-stacked weights across resamples for gender_r
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .20992597    .20992597
    logit            2    1.156e-16    1.156e-16
  lassocv            3    .01908135    .01908135
  ridgecv            4    .20298821    .20298821
  lassocv            5            0            0
  ridgecv            6    4.210e-17    4.210e-17
       rf            7    .29338428    .29338428
       rf            8    1.352e-16    1.352e-16
       rf            9            0            0
gradboost           10            0            0
gradboost           11    .27462019    .27462019
     nnet           12            0            0
     nnet           13            0            0

short-stacked weights across resamples for lnearn
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07104056    .07104056
      ols            2            0    1.626e-16    1.626e-16
  lassocv            3            0    .06256651    .06256651
  ridgecv            4            0    .21310026    .21310026
  lassocv            5            0            0            0
  ridgecv            6            0    2.094e-16    2.094e-16
       rf            7            0     .4811649     .4811649
       rf            8            0    1.237e-16    1.237e-16
       rf            9            0    1.614e-16    1.614e-16
gradboost           10            0    2.252e-17    2.252e-17
gradboost           11            0    .17212777    .17212777
     nnet           12            0    1.240e-16    1.240e-16
     nnet           13            0            0            0
      ols            1            1    1.236e-17    1.236e-17
      ols            2            1    3.369e-17    3.369e-17
  lassocv            3            1    1.558e-18    1.558e-18
  ridgecv            4            1    .09267824    .09267824
  lassocv            5            1     .2738445     .2738445
  ridgecv            6            1            0            0
       rf            7            1    .52022851    .52022851
       rf            8            1            0            0
       rf            9            1    3.408e-17    3.408e-17
gradboost           10            1    6.847e-17    6.847e-17
gradboost           11            1    .06845877    .06845877
     nnet           12            1    2.096e-17    2.096e-17
     nnet           13            1    .04478998    .04478998

Y_lnearn_ss[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07104056    .07104056
      ols            2            0    1.626e-16    1.626e-16
  lassocv            3            0    .06256651    .06256651
  ridgecv            4            0    .21310026    .21310026
  lassocv            5            0            0            0
  ridgecv            6            0    2.094e-16    2.094e-16
       rf            7            0     .4811649     .4811649
       rf            8            0    1.237e-16    1.237e-16
       rf            9            0    1.614e-16    1.614e-16
gradboost           10            0    2.252e-17    2.252e-17
gradboost           11            0    .17212777    .17212777
     nnet           12            0    1.240e-16    1.240e-16
     nnet           13            0            0            0
      ols            1            1    1.236e-17    1.236e-17
      ols            2            1    3.369e-17    3.369e-17
  lassocv            3            1    1.558e-18    1.558e-18
  ridgecv            4            1    .09267824    .09267824
  lassocv            5            1     .2738445     .2738445
  ridgecv            6            1            0            0
       rf            7            1    .52022851    .52022851
       rf            8            1            0            0
       rf            9            1    3.408e-17    3.408e-17
gradboost           10            1    6.847e-17    6.847e-17
gradboost           11            1    .06845877    .06845877
     nnet           12            1    2.096e-17    2.096e-17
     nnet           13            1    .04478998    .04478998

      +-------------------------------------------------------------------+
      | Y_lne~1_1   Y_lne~0_1   Y_lne~s1   Y_lnea~2   Y_lnea~3   Y_lnea~4 |
      |-------------------------------------------------------------------|
   1. | 2.5212209    2.778666          1          0   .0710406   .0710406 |
   2. | 2.9973879   3.2417266          2          0   1.63e-16   1.63e-16 |
   3. | 2.8484257   2.8970482          3          0   .0625665   .0625665 |
   4. | 2.4367182   2.6640305          4          0   .2131003   .2131003 |
   5. | 3.1240495   3.1287672          5          0          0          0 |
      |-------------------------------------------------------------------|
   6. | 2.5516778   2.6561586          6          0   2.09e-16   2.09e-16 |
   7. | 2.3799683   2.5865971          7          0   .4811649   .4811649 |
   8. | 2.6158938   2.6780484          8          0   1.24e-16   1.24e-16 |
      +-------------------------------------------------------------------+
(note: file out_3702/Y_lnearn_ss_nnls1_short_ia.dta not found)
file out_3702/Y_lnearn_ss_nnls1_short_ia.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .20992597    .20992597
    logit            2    1.156e-16    1.156e-16
  lassocv            3    .01908135    .01908135
  ridgecv            4    .20298821    .20298821
  lassocv            5            0            0
  ridgecv            6    4.210e-17    4.210e-17
       rf            7    .29338428    .29338428
       rf            8    1.352e-16    1.352e-16
       rf            9            0            0
gradboost           10            0            0
gradboost           11    .27462019    .27462019
     nnet           12            0            0
     nnet           13            0            0

short-stacked weights across resamples for lnearn
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07104056    .07104056
      ols            2            0    1.626e-16    1.626e-16
  lassocv            3            0    .06256651    .06256651
  ridgecv            4            0    .21310026    .21310026
  lassocv            5            0            0            0
  ridgecv            6            0    2.094e-16    2.094e-16
       rf            7            0     .4811649     .4811649
       rf            8            0    1.237e-16    1.237e-16
       rf            9            0    1.614e-16    1.614e-16
gradboost           10            0    2.252e-17    2.252e-17
gradboost           11            0    .17212777    .17212777
     nnet           12            0    1.240e-16    1.240e-16
     nnet           13            0            0            0
      ols            1            1    1.236e-17    1.236e-17
      ols            2            1    3.369e-17    3.369e-17
  lassocv            3            1    1.558e-18    1.558e-18
  ridgecv            4            1    .09267824    .09267824
  lassocv            5            1     .2738445     .2738445
  ridgecv            6            1            0            0
       rf            7            1    .52022851    .52022851
       rf            8            1            0            0
       rf            9            1    3.408e-17    3.408e-17
gradboost           10            1    6.847e-17    6.847e-17
gradboost           11            1    .06845877    .06845877
     nnet           12            1    2.096e-17    2.096e-17
     nnet           13            1    .04478998    .04478998

D_gender_r_ss[13,3]
               learner  mean_weight        rep_1
    logit            1    .20992597    .20992597
    logit            2    1.156e-16    1.156e-16
  lassocv            3    .01908135    .01908135
  ridgecv            4    .20298821    .20298821
  lassocv            5            0            0
  ridgecv            6    4.210e-17    4.210e-17
       rf            7    .29338428    .29338428
       rf            8    1.352e-16    1.352e-16
       rf            9            0            0
gradboost           10            0            0
gradboost           11    .27462019    .27462019
     nnet           12            0            0
     nnet           13            0            0

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .79504684          1    .209926    .209926 |
   2. |  .4260129          2   1.16e-16   1.16e-16 |
   3. | .09656252          3   .0190814   .0190814 |
   4. | .21602893          4   .2029882   .2029882 |
   5. | .54907769          5          0          0 |
      |--------------------------------------------|
   6. | .84454278          6   4.21e-17   4.21e-17 |
   7. | .82917989          7   .2933843   .2933843 |
   8. |  .8470852          8   1.35e-16   1.35e-16 |
      +--------------------------------------------+
(note: file out_3702/D_gender_r_ss_nnls1_short_ia.dta not found)
file out_3702/D_gender_r_ss_nnls1_short_ia.dta saved

pool-stacked weights across resamples for gender_r
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .24654293    .24654293
    logit            2    1.567e-16    1.567e-16
  lassocv            3    .09549751    .09549751
  ridgecv            4    .10143585    .10143585
  lassocv            5    3.422e-17    3.422e-17
  ridgecv            6    5.986e-18    5.986e-18
       rf            7    .26115413    .26115413
       rf            8    7.484e-17    7.484e-17
       rf            9            0            0
gradboost           10    .05018782    .05018782
gradboost           11    .21851691    .21851691
     nnet           12    1.195e-16    1.195e-16
     nnet           13    .02666485    .02666485

pool-stacked weights across resamples for lnearn
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .01546885    .01546885
      ols            2            0            0            0
  lassocv            3            0    .20129102    .20129102
  ridgecv            4            0    .13390728    .13390728
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0    .47195577    .47195577
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0    .17737707    .17737707
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1    .29657526    .29657526
  ridgecv            4            1    .07601452    .07601452
  lassocv            5            1    .01771979    .01771979
  ridgecv            6            1            0            0
       rf            7            1    .52630137    .52630137
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1    .06942269    .06942269
     nnet           12            1            0            0
     nnet           13            1    .01396637    .01396637

pool-stacked weights across resamples for gender_r
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .24654293    .24654293
    logit            2    1.567e-16    1.567e-16
  lassocv            3    .09549751    .09549751
  ridgecv            4    .10143585    .10143585
  lassocv            5    3.422e-17    3.422e-17
  ridgecv            6    5.986e-18    5.986e-18
       rf            7    .26115413    .26115413
       rf            8    7.484e-17    7.484e-17
       rf            9            0            0
gradboost           10    .05018782    .05018782
gradboost           11    .21851691    .21851691
     nnet           12    1.195e-16    1.195e-16
     nnet           13    .02666485    .02666485

pool-stacked weights across resamples for lnearn
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .01546885    .01546885
      ols            2            0            0            0
  lassocv            3            0    .20129102    .20129102
  ridgecv            4            0    .13390728    .13390728
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0    .47195577    .47195577
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0    .17737707    .17737707
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1    .29657526    .29657526
  ridgecv            4            1    .07601452    .07601452
  lassocv            5            1    .01771979    .01771979
  ridgecv            6            1            0            0
       rf            7            1    .52630137    .52630137
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1    .06942269    .06942269
     nnet           12            1            0            0
     nnet           13            1    .01396637    .01396637

Y_lnearn_ps[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .01546885    .01546885
      ols            2            0            0            0
  lassocv            3            0    .20129102    .20129102
  ridgecv            4            0    .13390728    .13390728
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0    .47195577    .47195577
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0    .17737707    .17737707
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1    .29657526    .29657526
  ridgecv            4            1    .07601452    .07601452
  lassocv            5            1    .01771979    .01771979
  ridgecv            6            1            0            0
       rf            7            1    .52630137    .52630137
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1    .06942269    .06942269
     nnet           12            1            0            0
     nnet           13            1    .01396637    .01396637

      +-------------------------------------------------------------------+
      | Y_lne~1_1   Y_lne~0_1   Y_lne~s1   Y_lnea~2   Y_lnea~3   Y_lnea~4 |
      |-------------------------------------------------------------------|
   1. | 2.5127415   2.7552214          1          0   .0154689   .0154689 |
   2. | 2.9819618   3.2421707          2          0          0          0 |
   3. | 2.8229791   2.8815416          3          0    .201291    .201291 |
   4. | 2.4296911   2.6622159          4          0   .1339073   .1339073 |
   5. | 3.1238253   3.1327442          5          0          0          0 |
      |-------------------------------------------------------------------|
   6. | 2.5334332   2.6501851          6          0          0          0 |
   7. | 2.3635335     2.60299          7          0   .4719558   .4719558 |
   8. |  2.600892   2.6858492          8          0          0          0 |
      +-------------------------------------------------------------------+
(note: file out_3702/Y_lnearn_ps_nnls1_pooled_ia.dta not found)
file out_3702/Y_lnearn_ps_nnls1_pooled_ia.dta saved

pool-stacked weights across resamples for gender_r
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .24654293    .24654293
    logit            2    1.567e-16    1.567e-16
  lassocv            3    .09549751    .09549751
  ridgecv            4    .10143585    .10143585
  lassocv            5    3.422e-17    3.422e-17
  ridgecv            6    5.986e-18    5.986e-18
       rf            7    .26115413    .26115413
       rf            8    7.484e-17    7.484e-17
       rf            9            0            0
gradboost           10    .05018782    .05018782
gradboost           11    .21851691    .21851691
     nnet           12    1.195e-16    1.195e-16
     nnet           13    .02666485    .02666485

pool-stacked weights across resamples for lnearn
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .01546885    .01546885
      ols            2            0            0            0
  lassocv            3            0    .20129102    .20129102
  ridgecv            4            0    .13390728    .13390728
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0    .47195577    .47195577
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0    .17737707    .17737707
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1    .29657526    .29657526
  ridgecv            4            1    .07601452    .07601452
  lassocv            5            1    .01771979    .01771979
  ridgecv            6            1            0            0
       rf            7            1    .52630137    .52630137
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1    .06942269    .06942269
     nnet           12            1            0            0
     nnet           13            1    .01396637    .01396637

D_gender_r_ps[13,3]
               learner  mean_weight        rep_1
    logit            1    .24654293    .24654293
    logit            2    1.567e-16    1.567e-16
  lassocv            3    .09549751    .09549751
  ridgecv            4    .10143585    .10143585
  lassocv            5    3.422e-17    3.422e-17
  ridgecv            6    5.986e-18    5.986e-18
       rf            7    .26115413    .26115413
       rf            8    7.484e-17    7.484e-17
       rf            9            0            0
gradboost           10    .05018782    .05018782
gradboost           11    .21851691    .21851691
     nnet           12    1.195e-16    1.195e-16
     nnet           13    .02666485    .02666485

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .78606039          1   .2465429   .2465429 |
   2. | .41676598          2   1.57e-16   1.57e-16 |
   3. | .09180517          3   .0954975   .0954975 |
   4. | .21028848          4   .1014359   .1014359 |
   5. | .55934517          5   3.42e-17   3.42e-17 |
      |--------------------------------------------|
   6. | .84533066          6   5.99e-18   5.99e-18 |
   7. | .82823951          7   .2611541   .2611541 |
   8. | .84729096          8   7.48e-17   7.48e-17 |
      +--------------------------------------------+
(note: file out_3702/D_gender_r_ps_nnls1_pooled_ia.dta not found)
file out_3702/D_gender_r_ps_nnls1_pooled_ia.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.032    (0.094)
  ss  1  [shortstack]          [ss]          [ss]    -0.024    (0.099)
  ps  1   [poolstack]          [ps]          [ps]    -0.078    (0.035)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |   -.024299   .0985593    -0.25   0.805    -.2174716    .1688736
------------------------------------------------------------------------------
Stacking final estimator: singlebest
Warning: 101 propensity scores trimmed to lower limit .01.
Warning: 35 propensity scores trimmed to upper limit .99.
Warning: . resamples had propensity scores trimmed to upper limit .99.



Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.032    (0.094)
  ss  1  [shortstack]          [ss]          [ss]    -0.024    (0.099)
  ps  1   [poolstack]          [ps]          [ps]    -0.078    (0.035)

Stacking DDML model (ATET)
E[y|X,D=0]   = Y1_pystacked0_1                     Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1
E[D|X]       = D1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0316602    .094128    -0.34   0.737    -.2161477    .1528272
------------------------------------------------------------------------------
Stacking final estimator: singlebest
Warning: 75 propensity scores trimmed to lower limit .01.
Warning: 23 propensity scores trimmed to upper limit .99.
Warning: . resamples had propensity scores trimmed to upper limit .99.

file out_3702/results.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  ss  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.024    (0.099)
  ss  1  [shortstack]          [ss]          [ss]    -0.024    (0.099)
  ps  1   [poolstack]          [ps]          [ps]    -0.078    (0.035)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |   -.024299   .0985593    -0.25   0.805    -.2174716    .1688736
------------------------------------------------------------------------------
Stacking final estimator: singlebest
Warning: 101 propensity scores trimmed to lower limit .01.
Warning: 35 propensity scores trimmed to upper limit .99.
Warning: . resamples had propensity scores trimmed to upper limit .99.

file out_3702/results.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  ps  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.078    (0.035)
  ss  1  [shortstack]          [ss]          [ss]    -0.024    (0.099)
  ps  1   [poolstack]          [ps]          [ps]    -0.078    (0.035)

Poolstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ps0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ps1
E[D|X]       = D_gender_r_ps_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0781737   .0348957    -2.24   0.025    -.1465679   -.0097794
------------------------------------------------------------------------------
Stacking final estimator: singlebest
Warning: 87 propensity scores trimmed to lower limit .01.
Warning: 29 propensity scores trimmed to upper limit .99.
Warning: . resamples had propensity scores trimmed to upper limit .99.

file out_3702/results.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3           .7           .7
  ridgecv            4           .1           .1
  lassocv            5            0            0
  ridgecv            6           .1           .1
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10           .1           .1
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0           .1           .1
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0           .9           .9
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1           .1           .1
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1           .9           .9
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3           .7           .7
  ridgecv            4           .1           .1
  lassocv            5            0            0
  ridgecv            6           .1           .1
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10           .1           .1
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0           .1           .1
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0           .9           .9
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1           .1           .1
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1           .9           .9
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

Y1_pystacked_w_mn[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0           .1           .1
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0           .9           .9
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1           .1           .1
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1           .9           .9
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

      +-------------------------------------------+
      | Y1_pys~1   Y1_pys~2   Y1_pys~3   Y1_pys~4 |
      |-------------------------------------------|
   1. |        1          0          0          0 |
   2. |        2          0          0          0 |
   3. |        3          0         .1         .1 |
   4. |        4          0          0          0 |
   5. |        5          0          0          0 |
      |-------------------------------------------|
   6. |        6          0          0          0 |
   7. |        7          0         .9         .9 |
   8. |        8          0          0          0 |
      +-------------------------------------------+
(note: file out_3702/Y1_pystacked_w_mn_singlebest_regular_ia.dta not found)
file out_3702/Y1_pystacked_w_mn_singlebest_regular_ia.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3           .7           .7
  ridgecv            4           .1           .1
  lassocv            5            0            0
  ridgecv            6           .1           .1
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10           .1           .1
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0           .1           .1
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0           .9           .9
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1           .1           .1
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1           .9           .9
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

D1_pystacked_w_mn[13,3]
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3           .7           .7
  ridgecv            4           .1           .1
  lassocv            5            0            0
  ridgecv            6           .1           .1
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10           .1           .1
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

      +--------------------------------+
      | D1_pys~1   D1_pys~2   D1_pys~3 |
      |--------------------------------|
   1. |        1          0          0 |
   2. |        2          0          0 |
   3. |        3         .7         .7 |
   4. |        4         .1         .1 |
   5. |        5          0          0 |
      |--------------------------------|
   6. |        6         .1         .1 |
   7. |        7          0          0 |
   8. |        8          0          0 |
      +--------------------------------+
(note: file out_3702/D1_pystacked_w_mn_singlebest_regular_ia.dta not found)
file out_3702/D1_pystacked_w_mn_singlebest_regular_ia.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3            0            0
  ridgecv            4            1            1
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

short-stacked weights across resamples for lnearn
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

short-stacked weights across resamples for gender_r
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3            0            0
  ridgecv            4            1            1
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

short-stacked weights across resamples for lnearn
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

Y_lnearn_ss[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

      +-------------------------------------------------------------------+
      | Y_lne~1_1   Y_lne~0_1   Y_lne~s1   Y_lnea~2   Y_lnea~3   Y_lnea~4 |
      |-------------------------------------------------------------------|
   1. | 2.4822781    2.775543          1          0          0          0 |
   2. | 2.8969553   3.2071464          2          0          0          0 |
   3. | 2.9273171    2.879256          3          0          0          0 |
   4. | 2.4669778   2.6041734          4          0          0          0 |
   5. |  3.087177   3.1268489          5          0          0          0 |
      |-------------------------------------------------------------------|
   6. | 2.5082827   2.6759763          6          0          0          0 |
   7. | 2.5100493   2.7480071          7          0          1          1 |
   8. | 2.5949435   2.7987211          8          0          0          0 |
      +-------------------------------------------------------------------+
(note: file out_3702/Y_lnearn_ss_singlebest_short_ia.dta not found)
file out_3702/Y_lnearn_ss_singlebest_short_ia.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3            0            0
  ridgecv            4            1            1
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

short-stacked weights across resamples for lnearn
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

D_gender_r_ss[13,3]
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3            0            0
  ridgecv            4            1            1
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .68413782          1          0          0 |
   2. |  .3436799          2          0          0 |
   3. | .08236393          3          0          0 |
   4. | .27832365          4          1          1 |
   5. |   .652466          5          0          0 |
      |--------------------------------------------|
   6. | .84021044          6          0          0 |
   7. | .88972795          7          0          0 |
   8. | .71217293          8          0          0 |
      +--------------------------------------------+
(note: file out_3702/D_gender_r_ss_singlebest_short_ia.dta not found)
file out_3702/D_gender_r_ss_singlebest_short_ia.dta saved

pool-stacked weights across resamples for gender_r
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3            1            1
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

pool-stacked weights across resamples for lnearn
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

pool-stacked weights across resamples for gender_r
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3            1            1
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

pool-stacked weights across resamples for lnearn
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

Y_lnearn_ps[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

      +-------------------------------------------------------------------+
      | Y_lne~1_1   Y_lne~0_1   Y_lne~s1   Y_lnea~2   Y_lnea~3   Y_lnea~4 |
      |-------------------------------------------------------------------|
   1. | 2.4822781    2.775543          1          0          0          0 |
   2. | 2.8969553   3.2071464          2          0          0          0 |
   3. | 2.9273171    2.879256          3          0          0          0 |
   4. | 2.4669778   2.6041734          4          0          0          0 |
   5. |  3.087177   3.1268489          5          0          0          0 |
      |-------------------------------------------------------------------|
   6. | 2.5082827   2.6759763          6          0          0          0 |
   7. | 2.5100493   2.7480071          7          0          1          1 |
   8. | 2.5949435   2.7987211          8          0          0          0 |
      +-------------------------------------------------------------------+
(note: file out_3702/Y_lnearn_ps_singlebest_pooled_ia.dta not found)
file out_3702/Y_lnearn_ps_singlebest_pooled_ia.dta saved

pool-stacked weights across resamples for gender_r
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3            1            1
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

pool-stacked weights across resamples for lnearn
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

D_gender_r_ps[13,3]
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3            1            1
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .69930279          1          0          0 |
   2. | .35792041          2          0          0 |
   3. | .02530917          3          1          1 |
   4. | .24787381          4          0          0 |
   5. | .64404875          5          0          0 |
      |--------------------------------------------|
   6. | .83177507          6          0          0 |
   7. | .91547465          7          0          0 |
   8. | .75907969          8          0          0 |
      +--------------------------------------------+
(note: file out_3702/D_gender_r_ps_singlebest_pooled_ia.dta not found)
file out_3702/D_gender_r_ps_singlebest_pooled_ia.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.580    (0.304)
  ss  1  [shortstack]          [ss]          [ss]     0.022    (0.113)
  ps  1   [poolstack]          [ps]          [ps]     0.091    (0.103)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |   .0215657   .1127872     0.19   0.848    -.1994932    .2426245
------------------------------------------------------------------------------
Stacking final estimator: ols
Warning: 172 propensity scores trimmed to lower limit .01.
Warning: 34 propensity scores trimmed to upper limit .99.
Warning: . resamples had propensity scores trimmed to upper limit .99.



Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.580    (0.304)
  ss  1  [shortstack]          [ss]          [ss]     0.022    (0.113)
  ps  1   [poolstack]          [ps]          [ps]     0.091    (0.103)

Stacking DDML model (ATET)
E[y|X,D=0]   = Y1_pystacked0_1                     Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1
E[D|X]       = D1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.5800291   .3037706    -1.91   0.056    -1.175409    .0153503
------------------------------------------------------------------------------
Stacking final estimator: ols
Warning: 1739 propensity scores trimmed to lower limit .01.
Warning: 430 propensity scores trimmed to upper limit .99.
Warning: . resamples had propensity scores trimmed to upper limit .99.

(note: variable final was str3, now str10 to accommodate using data's values)
file out_3702/results.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  ss  1  Y1_pystacked  Y1_pystacked  D1_pystacked     0.022    (0.113)
  ss  1  [shortstack]          [ss]          [ss]     0.022    (0.113)
  ps  1   [poolstack]          [ps]          [ps]     0.091    (0.103)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |   .0215657   .1127872     0.19   0.848    -.1994932    .2426245
------------------------------------------------------------------------------
Stacking final estimator: ols
Warning: 172 propensity scores trimmed to lower limit .01.
Warning: 34 propensity scores trimmed to upper limit .99.
Warning: . resamples had propensity scores trimmed to upper limit .99.

(note: variable final was str3, now str10 to accommodate using data's values)
file out_3702/results.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  ps  1  Y1_pystacked  Y1_pystacked  D1_pystacked     0.091    (0.103)
  ss  1  [shortstack]          [ss]          [ss]     0.022    (0.113)
  ps  1   [poolstack]          [ps]          [ps]     0.091    (0.103)

Poolstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ps0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ps1
E[D|X]       = D_gender_r_ps_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |   .0913947   .1033086     0.88   0.376    -.1110863    .2938758
------------------------------------------------------------------------------
Stacking final estimator: ols
Warning: 15 propensity scores trimmed to lower limit .01.
Warning: 213 propensity scores trimmed to upper limit .99.
Warning: . resamples had propensity scores trimmed to upper limit .99.

(note: variable final was str3, now str10 to accommodate using data's values)
file out_3702/results.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .17862032    .17862032
    logit            2    .08223696    .08223696
  lassocv            3     .2030347     .2030347
  ridgecv            4    .14827741    .14827741
  lassocv            5   -.06972332   -.06972332
  ridgecv            6   -.02285551   -.02285551
       rf            7    .38907731    .38907731
       rf            8    .06558125    .06558125
       rf            9   -.23255305   -.23255305
gradboost           10    .15862389    .15862389
gradboost           11    .12483053    .12483053
     nnet           12   -2.2897575   -2.2897575
     nnet           13    .03958382    .03958382

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .02775658    .02775658
      ols            2            0   -.02024105   -.02024105
  lassocv            3            0    .10490337    .10490337
  ridgecv            4            0     .4774148     .4774148
  lassocv            5            0   -.09276439   -.09276439
  ridgecv            6            0   -.08246446   -.08246446
       rf            7            0    .65101346    .65101346
       rf            8            0    .01318639    .01318639
       rf            9            0   -.15642004   -.15642004
gradboost           10            0     .0588134     .0588134
gradboost           11            0    .09235511    .09235511
     nnet           12            0   -.37666536   -.37666536
     nnet           13            0   -.00735725   -.00735725
      ols            1            1   -.02715902   -.02715902
      ols            2            1   -.01613524   -.01613524
  lassocv            3            1    .01758951    .01758951
  ridgecv            4            1    .29941356    .29941356
  lassocv            5            1    .22077911    .22077911
  ridgecv            6            1   -.05582641   -.05582641
       rf            7            1    .53754156    .53754156
       rf            8            1    .36282929    .36282929
       rf            9            1   -.25401552   -.25401552
gradboost           10            1   -.04872077   -.04872077
gradboost           11            1    .04514734    .04514734
     nnet           12            1   -.74586339   -.74586339
     nnet           13            1     .0093571     .0093571

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .17862032    .17862032
    logit            2    .08223696    .08223696
  lassocv            3     .2030347     .2030347
  ridgecv            4    .14827741    .14827741
  lassocv            5   -.06972332   -.06972332
  ridgecv            6   -.02285551   -.02285551
       rf            7    .38907731    .38907731
       rf            8    .06558125    .06558125
       rf            9   -.23255305   -.23255305
gradboost           10    .15862389    .15862389
gradboost           11    .12483053    .12483053
     nnet           12   -2.2897575   -2.2897575
     nnet           13    .03958382    .03958382

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .02775658    .02775658
      ols            2            0   -.02024105   -.02024105
  lassocv            3            0    .10490337    .10490337
  ridgecv            4            0     .4774148     .4774148
  lassocv            5            0   -.09276439   -.09276439
  ridgecv            6            0   -.08246446   -.08246446
       rf            7            0    .65101346    .65101346
       rf            8            0    .01318639    .01318639
       rf            9            0   -.15642004   -.15642004
gradboost           10            0     .0588134     .0588134
gradboost           11            0    .09235511    .09235511
     nnet           12            0   -.37666536   -.37666536
     nnet           13            0   -.00735725   -.00735725
      ols            1            1   -.02715902   -.02715902
      ols            2            1   -.01613524   -.01613524
  lassocv            3            1    .01758951    .01758951
  ridgecv            4            1    .29941356    .29941356
  lassocv            5            1    .22077911    .22077911
  ridgecv            6            1   -.05582641   -.05582641
       rf            7            1    .53754156    .53754156
       rf            8            1    .36282929    .36282929
       rf            9            1   -.25401552   -.25401552
gradboost           10            1   -.04872077   -.04872077
gradboost           11            1    .04514734    .04514734
     nnet           12            1   -.74586339   -.74586339
     nnet           13            1     .0093571     .0093571

Y1_pystacked_w_mn[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .02775658    .02775658
      ols            2            0   -.02024105   -.02024105
  lassocv            3            0    .10490337    .10490337
  ridgecv            4            0     .4774148     .4774148
  lassocv            5            0   -.09276439   -.09276439
  ridgecv            6            0   -.08246446   -.08246446
       rf            7            0    .65101346    .65101346
       rf            8            0    .01318639    .01318639
       rf            9            0   -.15642004   -.15642004
gradboost           10            0     .0588134     .0588134
gradboost           11            0    .09235511    .09235511
     nnet           12            0   -.37666536   -.37666536
     nnet           13            0   -.00735725   -.00735725
      ols            1            1   -.02715902   -.02715902
      ols            2            1   -.01613524   -.01613524
  lassocv            3            1    .01758951    .01758951
  ridgecv            4            1    .29941356    .29941356
  lassocv            5            1    .22077911    .22077911
  ridgecv            6            1   -.05582641   -.05582641
       rf            7            1    .53754156    .53754156
       rf            8            1    .36282929    .36282929
       rf            9            1   -.25401552   -.25401552
gradboost           10            1   -.04872077   -.04872077
gradboost           11            1    .04514734    .04514734
     nnet           12            1   -.74586339   -.74586339
     nnet           13            1     .0093571     .0093571

      +---------------------------------------------+
      | Y1_pys~1   Y1_pys~2   Y1_pyst~3   Y1_pyst~4 |
      |---------------------------------------------|
   1. |        1          0    .0277566    .0277566 |
   2. |        2          0    -.020241    -.020241 |
   3. |        3          0    .1049034    .1049034 |
   4. |        4          0    .4774148    .4774148 |
   5. |        5          0   -.0927644   -.0927644 |
      |---------------------------------------------|
   6. |        6          0   -.0824645   -.0824645 |
   7. |        7          0    .6510134    .6510134 |
   8. |        8          0    .0131864    .0131864 |
      +---------------------------------------------+
(note: file out_3702/Y1_pystacked_w_mn_ols_regular_ia.dta not found)
file out_3702/Y1_pystacked_w_mn_ols_regular_ia.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .17862032    .17862032
    logit            2    .08223696    .08223696
  lassocv            3     .2030347     .2030347
  ridgecv            4    .14827741    .14827741
  lassocv            5   -.06972332   -.06972332
  ridgecv            6   -.02285551   -.02285551
       rf            7    .38907731    .38907731
       rf            8    .06558125    .06558125
       rf            9   -.23255305   -.23255305
gradboost           10    .15862389    .15862389
gradboost           11    .12483053    .12483053
     nnet           12   -2.2897575   -2.2897575
     nnet           13    .03958382    .03958382

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .02775658    .02775658
      ols            2            0   -.02024105   -.02024105
  lassocv            3            0    .10490337    .10490337
  ridgecv            4            0     .4774148     .4774148
  lassocv            5            0   -.09276439   -.09276439
  ridgecv            6            0   -.08246446   -.08246446
       rf            7            0    .65101346    .65101346
       rf            8            0    .01318639    .01318639
       rf            9            0   -.15642004   -.15642004
gradboost           10            0     .0588134     .0588134
gradboost           11            0    .09235511    .09235511
     nnet           12            0   -.37666536   -.37666536
     nnet           13            0   -.00735725   -.00735725
      ols            1            1   -.02715902   -.02715902
      ols            2            1   -.01613524   -.01613524
  lassocv            3            1    .01758951    .01758951
  ridgecv            4            1    .29941356    .29941356
  lassocv            5            1    .22077911    .22077911
  ridgecv            6            1   -.05582641   -.05582641
       rf            7            1    .53754156    .53754156
       rf            8            1    .36282929    .36282929
       rf            9            1   -.25401552   -.25401552
gradboost           10            1   -.04872077   -.04872077
gradboost           11            1    .04514734    .04514734
     nnet           12            1   -.74586339   -.74586339
     nnet           13            1     .0093571     .0093571

D1_pystacked_w_mn[13,3]
               learner  mean_weight        rep_1
    logit            1    .17862032    .17862032
    logit            2    .08223696    .08223696
  lassocv            3     .2030347     .2030347
  ridgecv            4    .14827741    .14827741
  lassocv            5   -.06972332   -.06972332
  ridgecv            6   -.02285551   -.02285551
       rf            7    .38907731    .38907731
       rf            8    .06558125    .06558125
       rf            9   -.23255305   -.23255305
gradboost           10    .15862389    .15862389
gradboost           11    .12483053    .12483053
     nnet           12   -2.2897575   -2.2897575
     nnet           13    .03958382    .03958382

      +----------------------------------+
      | D1_pys~1   D1_pyst~2   D1_pyst~3 |
      |----------------------------------|
   1. |        1    .1786203    .1786203 |
   2. |        2     .082237     .082237 |
   3. |        3    .2030347    .2030347 |
   4. |        4    .1482774    .1482774 |
   5. |        5   -.0697233   -.0697233 |
      |----------------------------------|
   6. |        6   -.0228555   -.0228555 |
   7. |        7    .3890773    .3890773 |
   8. |        8    .0655812    .0655812 |
      +----------------------------------+
(note: file out_3702/D1_pystacked_w_mn_ols_regular_ia.dta not found)
file out_3702/D1_pystacked_w_mn_ols_regular_ia.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .23245788    .23245788
    logit            2    .08295268    .08295268
  lassocv            3    .16261774    .16261774
  ridgecv            4    .40337159    .40337159
  lassocv            5   -.21633869   -.21633869
  ridgecv            6   -.12276901   -.12276901
       rf            7    .46540021    .46540021
       rf            8    .14578597    .14578597
       rf            9   -.28437481   -.28437481
gradboost           10    .00107335    .00107335
gradboost           11    .23992612    .23992612
     nnet           12   -.08751248   -.08751248
     nnet           13   -.03704884   -.03704884

short-stacked weights across resamples for lnearn
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .11329295    .11329295
      ols            2            0   -.10217007   -.10217007
  lassocv            3            0   -.23022997   -.23022997
  ridgecv            4            0    .72752554    .72752554
  lassocv            5            0    .08744126    .08744126
  ridgecv            6            0   -.23297708   -.23297708
       rf            7            0    .65744975    .65744975
       rf            8            0   -.13508197   -.13508197
       rf            9            0    .06726719    .06726719
gradboost           10            0    .04721282    .04721282
gradboost           11            0    .10277368    .10277368
     nnet           12            0    .05308978    .05308978
     nnet           13            0   -.01143592   -.01143592
      ols            1            1   -.08758611   -.08758611
      ols            2            1   -.03354715   -.03354715
  lassocv            3            1   -.42361079   -.42361079
  ridgecv            4            1     .5105908     .5105908
  lassocv            5            1    .48775553    .48775553
  ridgecv            6            1   -.07037559   -.07037559
       rf            7            1    .52372591    .52372591
       rf            8            1    .64524581    .64524581
       rf            9            1   -.58892176   -.58892176
gradboost           10            1    .00870029    .00870029
gradboost           11            1     .0408063     .0408063
     nnet           12            1     .0066236     .0066236
     nnet           13            1    .04461908    .04461908

short-stacked weights across resamples for gender_r
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .23245788    .23245788
    logit            2    .08295268    .08295268
  lassocv            3    .16261774    .16261774
  ridgecv            4    .40337159    .40337159
  lassocv            5   -.21633869   -.21633869
  ridgecv            6   -.12276901   -.12276901
       rf            7    .46540021    .46540021
       rf            8    .14578597    .14578597
       rf            9   -.28437481   -.28437481
gradboost           10    .00107335    .00107335
gradboost           11    .23992612    .23992612
     nnet           12   -.08751248   -.08751248
     nnet           13   -.03704884   -.03704884

short-stacked weights across resamples for lnearn
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .11329295    .11329295
      ols            2            0   -.10217007   -.10217007
  lassocv            3            0   -.23022997   -.23022997
  ridgecv            4            0    .72752554    .72752554
  lassocv            5            0    .08744126    .08744126
  ridgecv            6            0   -.23297708   -.23297708
       rf            7            0    .65744975    .65744975
       rf            8            0   -.13508197   -.13508197
       rf            9            0    .06726719    .06726719
gradboost           10            0    .04721282    .04721282
gradboost           11            0    .10277368    .10277368
     nnet           12            0    .05308978    .05308978
     nnet           13            0   -.01143592   -.01143592
      ols            1            1   -.08758611   -.08758611
      ols            2            1   -.03354715   -.03354715
  lassocv            3            1   -.42361079   -.42361079
  ridgecv            4            1     .5105908     .5105908
  lassocv            5            1    .48775553    .48775553
  ridgecv            6            1   -.07037559   -.07037559
       rf            7            1    .52372591    .52372591
       rf            8            1    .64524581    .64524581
       rf            9            1   -.58892176   -.58892176
gradboost           10            1    .00870029    .00870029
gradboost           11            1     .0408063     .0408063
     nnet           12            1     .0066236     .0066236
     nnet           13            1    .04461908    .04461908

Y_lnearn_ss[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .11329295    .11329295
      ols            2            0   -.10217007   -.10217007
  lassocv            3            0   -.23022997   -.23022997
  ridgecv            4            0    .72752554    .72752554
  lassocv            5            0    .08744126    .08744126
  ridgecv            6            0   -.23297708   -.23297708
       rf            7            0    .65744975    .65744975
       rf            8            0   -.13508197   -.13508197
       rf            9            0    .06726719    .06726719
gradboost           10            0    .04721282    .04721282
gradboost           11            0    .10277368    .10277368
     nnet           12            0    .05308978    .05308978
     nnet           13            0   -.01143592   -.01143592
      ols            1            1   -.08758611   -.08758611
      ols            2            1   -.03354715   -.03354715
  lassocv            3            1   -.42361079   -.42361079
  ridgecv            4            1     .5105908     .5105908
  lassocv            5            1    .48775553    .48775553
  ridgecv            6            1   -.07037559   -.07037559
       rf            7            1    .52372591    .52372591
       rf            8            1    .64524581    .64524581
       rf            9            1   -.58892176   -.58892176
gradboost           10            1    .00870029    .00870029
gradboost           11            1     .0408063     .0408063
     nnet           12            1     .0066236     .0066236
     nnet           13            1    .04461908    .04461908

      +---------------------------------------------------------------------+
      | Y_lne~1_1   Y_lne~0_1   Y_lne~s1   Y_lnea~2   Y_lnear~3   Y_lnear~4 |
      |---------------------------------------------------------------------|
   1. | 2.6699774   3.1740124          1          0     .113293     .113293 |
   2. | 3.1622394    3.658721          2          0   -.1021701   -.1021701 |
   3. | 3.0193394   3.3040409          3          0     -.23023     -.23023 |
   4. | 2.5925618    3.017348          4          0    .7275255    .7275255 |
   5. | 3.3480398   3.5549029          5          0    .0874413    .0874413 |
      |---------------------------------------------------------------------|
   6. | 2.7196785   3.0733179          6          0   -.2329771   -.2329771 |
   7. | 2.4275473   2.9657736          7          0    .6574497    .6574497 |
   8. | 2.7845651   3.0546556          8          0    -.135082    -.135082 |
      +---------------------------------------------------------------------+
(note: file out_3702/Y_lnearn_ss_ols_short_ia.dta not found)
file out_3702/Y_lnearn_ss_ols_short_ia.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .23245788    .23245788
    logit            2    .08295268    .08295268
  lassocv            3    .16261774    .16261774
  ridgecv            4    .40337159    .40337159
  lassocv            5   -.21633869   -.21633869
  ridgecv            6   -.12276901   -.12276901
       rf            7    .46540021    .46540021
       rf            8    .14578597    .14578597
       rf            9   -.28437481   -.28437481
gradboost           10    .00107335    .00107335
gradboost           11    .23992612    .23992612
     nnet           12   -.08751248   -.08751248
     nnet           13   -.03704884   -.03704884

short-stacked weights across resamples for lnearn
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .11329295    .11329295
      ols            2            0   -.10217007   -.10217007
  lassocv            3            0   -.23022997   -.23022997
  ridgecv            4            0    .72752554    .72752554
  lassocv            5            0    .08744126    .08744126
  ridgecv            6            0   -.23297708   -.23297708
       rf            7            0    .65744975    .65744975
       rf            8            0   -.13508197   -.13508197
       rf            9            0    .06726719    .06726719
gradboost           10            0    .04721282    .04721282
gradboost           11            0    .10277368    .10277368
     nnet           12            0    .05308978    .05308978
     nnet           13            0   -.01143592   -.01143592
      ols            1            1   -.08758611   -.08758611
      ols            2            1   -.03354715   -.03354715
  lassocv            3            1   -.42361079   -.42361079
  ridgecv            4            1     .5105908     .5105908
  lassocv            5            1    .48775553    .48775553
  ridgecv            6            1   -.07037559   -.07037559
       rf            7            1    .52372591    .52372591
       rf            8            1    .64524581    .64524581
       rf            9            1   -.58892176   -.58892176
gradboost           10            1    .00870029    .00870029
gradboost           11            1     .0408063     .0408063
     nnet           12            1     .0066236     .0066236
     nnet           13            1    .04461908    .04461908

D_gender_r_ss[13,3]
               learner  mean_weight        rep_1
    logit            1    .23245788    .23245788
    logit            2    .08295268    .08295268
  lassocv            3    .16261774    .16261774
  ridgecv            4    .40337159    .40337159
  lassocv            5   -.21633869   -.21633869
  ridgecv            6   -.12276901   -.12276901
       rf            7    .46540021    .46540021
       rf            8    .14578597    .14578597
       rf            9   -.28437481   -.28437481
gradboost           10    .00107335    .00107335
gradboost           11    .23992612    .23992612
     nnet           12   -.08751248   -.08751248
     nnet           13   -.03704884   -.03704884

      +----------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gende~2   D_gende~3 |
      |----------------------------------------------|
   1. | .76837734          1    .2324579    .2324579 |
   2. | .43361665          2    .0829527    .0829527 |
   3. | .05948312          3    .1626177    .1626177 |
   4. |  .1524469          4    .4033716    .4033716 |
   5. | .53358938          5   -.2163387   -.2163387 |
      |----------------------------------------------|
   6. | .84810857          6    -.122769    -.122769 |
   7. | .86496845          7    .4654002    .4654002 |
   8. | .84386413          8     .145786     .145786 |
      +----------------------------------------------+
(note: file out_3702/D_gender_r_ss_ols_short_ia.dta not found)
file out_3702/D_gender_r_ss_ols_short_ia.dta saved

pool-stacked weights across resamples for gender_r
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .19813132    .19813132
    logit            2    .08516658    .08516658
  lassocv            3    .11798885    .11798885
  ridgecv            4     .1449779     .1449779
  lassocv            5   -.01334717   -.01334717
  ridgecv            6   -.00584883   -.00584883
       rf            7    .39407827    .39407827
       rf            8    .07742634    .07742634
       rf            9   -.24980609   -.24980609
gradboost           10    .15912355    .15912355
gradboost           11    .12999685    .12999685
     nnet           12   -.00431072   -.00431072
     nnet           13    .02856364    .02856364

pool-stacked weights across resamples for lnearn
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .00581588    .00581588
      ols            2            0   -.03234915   -.03234915
  lassocv            3            0    .13558416    .13558416
  ridgecv            4            0     .4029804     .4029804
  lassocv            5            0   -.11842018   -.11842018
  ridgecv            6            0   -.02024514   -.02024514
       rf            7            0    .67942082    .67942082
       rf            8            0    .05398657    .05398657
       rf            9            0   -.21315746   -.21315746
gradboost           10            0    .06746897    .06746897
gradboost           11            0    .09082383    .09082383
     nnet           12            0    .00224819    .00224819
     nnet           13            0   -.01090312   -.01090312
      ols            1            1   -.01123754   -.01123754
      ols            2            1   -9.033e-12   -9.033e-12
  lassocv            3            1    .13463028    .13463028
  ridgecv            4            1    .32347316    .32347316
  lassocv            5            1    .07230337    .07230337
  ridgecv            6            1   -.07545368   -.07545368
       rf            7            1    .53345573    .53345573
       rf            8            1    .39238465    .39238465
       rf            9            1   -.28924635   -.28924635
gradboost           10            1   -.04201735   -.04201735
gradboost           11            1    .04756409    .04756409
     nnet           12            1   -.00746116   -.00746116
     nnet           13            1    .00958127    .00958127

pool-stacked weights across resamples for gender_r
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .19813132    .19813132
    logit            2    .08516658    .08516658
  lassocv            3    .11798885    .11798885
  ridgecv            4     .1449779     .1449779
  lassocv            5   -.01334717   -.01334717
  ridgecv            6   -.00584883   -.00584883
       rf            7    .39407827    .39407827
       rf            8    .07742634    .07742634
       rf            9   -.24980609   -.24980609
gradboost           10    .15912355    .15912355
gradboost           11    .12999685    .12999685
     nnet           12   -.00431072   -.00431072
     nnet           13    .02856364    .02856364

pool-stacked weights across resamples for lnearn
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .00581588    .00581588
      ols            2            0   -.03234915   -.03234915
  lassocv            3            0    .13558416    .13558416
  ridgecv            4            0     .4029804     .4029804
  lassocv            5            0   -.11842018   -.11842018
  ridgecv            6            0   -.02024514   -.02024514
       rf            7            0    .67942082    .67942082
       rf            8            0    .05398657    .05398657
       rf            9            0   -.21315746   -.21315746
gradboost           10            0    .06746897    .06746897
gradboost           11            0    .09082383    .09082383
     nnet           12            0    .00224819    .00224819
     nnet           13            0   -.01090312   -.01090312
      ols            1            1   -.01123754   -.01123754
      ols            2            1   -9.033e-12   -9.033e-12
  lassocv            3            1    .13463028    .13463028
  ridgecv            4            1    .32347316    .32347316
  lassocv            5            1    .07230337    .07230337
  ridgecv            6            1   -.07545368   -.07545368
       rf            7            1    .53345573    .53345573
       rf            8            1    .39238465    .39238465
       rf            9            1   -.28924635   -.28924635
gradboost           10            1   -.04201735   -.04201735
gradboost           11            1    .04756409    .04756409
     nnet           12            1   -.00746116   -.00746116
     nnet           13            1    .00958127    .00958127

Y_lnearn_ps[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .00581588    .00581588
      ols            2            0   -.03234915   -.03234915
  lassocv            3            0    .13558416    .13558416
  ridgecv            4            0     .4029804     .4029804
  lassocv            5            0   -.11842018   -.11842018
  ridgecv            6            0   -.02024514   -.02024514
       rf            7            0    .67942082    .67942082
       rf            8            0    .05398657    .05398657
       rf            9            0   -.21315746   -.21315746
gradboost           10            0    .06746897    .06746897
gradboost           11            0    .09082383    .09082383
     nnet           12            0    .00224819    .00224819
     nnet           13            0   -.01090312   -.01090312
      ols            1            1   -.01123754   -.01123754
      ols            2            1   -9.033e-12   -9.033e-12
  lassocv            3            1    .13463028    .13463028
  ridgecv            4            1    .32347316    .32347316
  lassocv            5            1    .07230337    .07230337
  ridgecv            6            1   -.07545368   -.07545368
       rf            7            1    .53345573    .53345573
       rf            8            1    .39238465    .39238465
       rf            9            1   -.28924635   -.28924635
gradboost           10            1   -.04201735   -.04201735
gradboost           11            1    .04756409    .04756409
     nnet           12            1   -.00746116   -.00746116
     nnet           13            1    .00958127    .00958127

      +---------------------------------------------------------------------+
      | Y_lne~1_1   Y_lne~0_1   Y_lne~s1   Y_lnea~2   Y_lnear~3   Y_lnear~4 |
      |---------------------------------------------------------------------|
   1. | 2.7386023   2.8727798          1          0    .0058159    .0058159 |
   2. | 3.2125427   3.3726056          2          0   -.0323492   -.0323492 |
   3. | 3.0588073   2.9978433          3          0    .1355842    .1355842 |
   4. | 2.6473281   2.7288247          4          0    .4029804    .4029804 |
   5. | 3.4086297   3.2788889          5          0   -.1184202   -.1184202 |
      |---------------------------------------------------------------------|
   6. | 2.7687647   2.7581618          6          0   -.0202451   -.0202451 |
   7. | 2.5575427   2.7405048          7          0    .6794208    .6794208 |
   8. | 2.8489263   2.8033725          8          0    .0539866    .0539866 |
      +---------------------------------------------------------------------+
(note: file out_3702/Y_lnearn_ps_ols_pooled_ia.dta not found)
file out_3702/Y_lnearn_ps_ols_pooled_ia.dta saved

pool-stacked weights across resamples for gender_r
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .19813132    .19813132
    logit            2    .08516658    .08516658
  lassocv            3    .11798885    .11798885
  ridgecv            4     .1449779     .1449779
  lassocv            5   -.01334717   -.01334717
  ridgecv            6   -.00584883   -.00584883
       rf            7    .39407827    .39407827
       rf            8    .07742634    .07742634
       rf            9   -.24980609   -.24980609
gradboost           10    .15912355    .15912355
gradboost           11    .12999685    .12999685
     nnet           12   -.00431072   -.00431072
     nnet           13    .02856364    .02856364

pool-stacked weights across resamples for lnearn
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .00581588    .00581588
      ols            2            0   -.03234915   -.03234915
  lassocv            3            0    .13558416    .13558416
  ridgecv            4            0     .4029804     .4029804
  lassocv            5            0   -.11842018   -.11842018
  ridgecv            6            0   -.02024514   -.02024514
       rf            7            0    .67942082    .67942082
       rf            8            0    .05398657    .05398657
       rf            9            0   -.21315746   -.21315746
gradboost           10            0    .06746897    .06746897
gradboost           11            0    .09082383    .09082383
     nnet           12            0    .00224819    .00224819
     nnet           13            0   -.01090312   -.01090312
      ols            1            1   -.01123754   -.01123754
      ols            2            1   -9.033e-12   -9.033e-12
  lassocv            3            1    .13463028    .13463028
  ridgecv            4            1    .32347316    .32347316
  lassocv            5            1    .07230337    .07230337
  ridgecv            6            1   -.07545368   -.07545368
       rf            7            1    .53345573    .53345573
       rf            8            1    .39238465    .39238465
       rf            9            1   -.28924635   -.28924635
gradboost           10            1   -.04201735   -.04201735
gradboost           11            1    .04756409    .04756409
     nnet           12            1   -.00746116   -.00746116
     nnet           13            1    .00958127    .00958127

D_gender_r_ps[13,3]
               learner  mean_weight        rep_1
    logit            1    .19813132    .19813132
    logit            2    .08516658    .08516658
  lassocv            3    .11798885    .11798885
  ridgecv            4     .1449779     .1449779
  lassocv            5   -.01334717   -.01334717
  ridgecv            6   -.00584883   -.00584883
       rf            7    .39407827    .39407827
       rf            8    .07742634    .07742634
       rf            9   -.24980609   -.24980609
gradboost           10    .15912355    .15912355
gradboost           11    .12999685    .12999685
     nnet           12   -.00431072   -.00431072
     nnet           13    .02856364    .02856364

      +----------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gende~2   D_gende~3 |
      |----------------------------------------------|
   1. | .80196878          1    .1981313    .1981313 |
   2. | .44019613          2    .0851666    .0851666 |
   3. |  .0892015          3    .1179889    .1179889 |
   4. |  .2023221          4    .1449779    .1449779 |
   5. | .59600539          5   -.0133472   -.0133472 |
      |----------------------------------------------|
   6. |  .9135647          6   -.0058488   -.0058488 |
   7. | .87538852          7    .3940783    .3940783 |
   8. |  .8797134          8    .0774263    .0774263 |
      +----------------------------------------------+
(note: file out_3702/D_gender_r_ps_ols_pooled_ia.dta not found)
file out_3702/D_gender_r_ps_ols_pooled_ia.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.102    (0.017)
  ss  1  [shortstack]          [ss]          [ss]    -0.102    (0.017)
  ps  1   [poolstack]          [ps]          [ps]    -0.102    (0.017)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |   -.101936   .0169174    -6.03   0.000    -.1350935   -.0687785
------------------------------------------------------------------------------
Stacking final estimator: avg



Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.102    (0.017)
  ss  1  [shortstack]          [ss]          [ss]    -0.102    (0.017)
  ps  1   [poolstack]          [ps]          [ps]    -0.102    (0.017)

Stacking DDML model (ATET)
E[y|X,D=0]   = Y1_pystacked0_1                     Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1
E[D|X]       = D1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |   -.101936   .0169174    -6.03   0.000    -.1350935   -.0687785
------------------------------------------------------------------------------
Stacking final estimator: avg

(note: variable final was str3, now str10 to accommodate using data's values)
file out_3702/results.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  ss  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.102    (0.017)
  ss  1  [shortstack]          [ss]          [ss]    -0.102    (0.017)
  ps  1   [poolstack]          [ps]          [ps]    -0.102    (0.017)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |   -.101936   .0169174    -6.03   0.000    -.1350935   -.0687785
------------------------------------------------------------------------------
Stacking final estimator: avg

(note: variable final was str3, now str10 to accommodate using data's values)
file out_3702/results.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  ps  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.102    (0.017)
  ss  1  [shortstack]          [ss]          [ss]    -0.102    (0.017)
  ps  1   [poolstack]          [ps]          [ps]    -0.102    (0.017)

Poolstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ps0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ps1
E[D|X]       = D_gender_r_ps_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |   -.101936   .0169174    -6.03   0.000    -.1350935   -.0687785
------------------------------------------------------------------------------
Stacking final estimator: avg

(note: variable final was str3, now str10 to accommodate using data's values)
file out_3702/results.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

Y1_pystacked_w_mn[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

      +-------------------------------------------+
      | Y1_pys~1   Y1_pys~2   Y1_pys~3   Y1_pys~4 |
      |-------------------------------------------|
   1. |        1          0   .0769231   .0769231 |
   2. |        2          0   .0769231   .0769231 |
   3. |        3          0   .0769231   .0769231 |
   4. |        4          0   .0769231   .0769231 |
   5. |        5          0   .0769231   .0769231 |
      |-------------------------------------------|
   6. |        6          0   .0769231   .0769231 |
   7. |        7          0   .0769231   .0769231 |
   8. |        8          0   .0769231   .0769231 |
      +-------------------------------------------+
(note: file out_3702/Y1_pystacked_w_mn_avg_regular_ia.dta not found)
file out_3702/Y1_pystacked_w_mn_avg_regular_ia.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

D1_pystacked_w_mn[13,3]
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

      +--------------------------------+
      | D1_pys~1   D1_pys~2   D1_pys~3 |
      |--------------------------------|
   1. |        1   .0769231   .0769231 |
   2. |        2   .0769231   .0769231 |
   3. |        3   .0769231   .0769231 |
   4. |        4   .0769231   .0769231 |
   5. |        5   .0769231   .0769231 |
      |--------------------------------|
   6. |        6   .0769231   .0769231 |
   7. |        7   .0769231   .0769231 |
   8. |        8   .0769231   .0769231 |
      +--------------------------------+
(note: file out_3702/D1_pystacked_w_mn_avg_regular_ia.dta not found)
file out_3702/D1_pystacked_w_mn_avg_regular_ia.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

short-stacked weights across resamples for lnearn
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

short-stacked weights across resamples for gender_r
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

short-stacked weights across resamples for lnearn
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

Y_lnearn_ss[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

      +-------------------------------------------------------------------+
      | Y_lne~1_1   Y_lne~0_1   Y_lne~s1   Y_lnea~2   Y_lnea~3   Y_lnea~4 |
      |-------------------------------------------------------------------|
   1. | 2.6054049   2.7434617          1          0   .0769231   .0769231 |
   2. | 3.1091263    3.228063          2          0   .0769231   .0769231 |
   3. | 2.7826881   2.8314023          3          0   .0769231   .0769231 |
   4. | 2.4529564   2.5958499          4          0   .0769231   .0769231 |
   5. | 3.0985298   3.0796798          5          0   .0769231   .0769231 |
      |-------------------------------------------------------------------|
   6. | 2.6185817   2.6760917          6          0   .0769231   .0769231 |
   7. | 2.4276833   2.6157313          7          0   .0769231   .0769231 |
   8. | 2.7022414   2.7837486          8          0   .0769231   .0769231 |
      +-------------------------------------------------------------------+
(note: file out_3702/Y_lnearn_ss_avg_short_ia.dta not found)
file out_3702/Y_lnearn_ss_avg_short_ia.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

short-stacked weights across resamples for lnearn
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

D_gender_r_ss[13,3]
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .70746432          1   .0769231   .0769231 |
   2. | .41974944          2   .0769231   .0769231 |
   3. | .16068646          3   .0769231   .0769231 |
   4. | .30738034          4   .0769231   .0769231 |
   5. | .55485982          5   .0769231   .0769231 |
      |--------------------------------------------|
   6. | .81817156          6   .0769231   .0769231 |
   7. | .78532276          7   .0769231   .0769231 |
   8. | .75880445          8   .0769231   .0769231 |
      +--------------------------------------------+
(note: file out_3702/D_gender_r_ss_avg_short_ia.dta not found)
file out_3702/D_gender_r_ss_avg_short_ia.dta saved

pool-stacked weights across resamples for gender_r
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

pool-stacked weights across resamples for lnearn
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

pool-stacked weights across resamples for gender_r
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

pool-stacked weights across resamples for lnearn
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

Y_lnearn_ps[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

      +-------------------------------------------------------------------+
      | Y_lne~1_1   Y_lne~0_1   Y_lne~s1   Y_lnea~2   Y_lnea~3   Y_lnea~4 |
      |-------------------------------------------------------------------|
   1. | 2.6054049   2.7434617          1          0   .0769231   .0769231 |
   2. | 3.1091263    3.228063          2          0   .0769231   .0769231 |
   3. | 2.7826881   2.8314023          3          0   .0769231   .0769231 |
   4. | 2.4529564   2.5958499          4          0   .0769231   .0769231 |
   5. | 3.0985298   3.0796798          5          0   .0769231   .0769231 |
      |-------------------------------------------------------------------|
   6. | 2.6185817   2.6760917          6          0   .0769231   .0769231 |
   7. | 2.4276833   2.6157313          7          0   .0769231   .0769231 |
   8. | 2.7022414   2.7837486          8          0   .0769231   .0769231 |
      +-------------------------------------------------------------------+
(note: file out_3702/Y_lnearn_ps_avg_pooled_ia.dta not found)
file out_3702/Y_lnearn_ps_avg_pooled_ia.dta saved

pool-stacked weights across resamples for gender_r
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

pool-stacked weights across resamples for lnearn
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

D_gender_r_ps[13,3]
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .70746432          1   .0769231   .0769231 |
   2. | .41974944          2   .0769231   .0769231 |
   3. | .16068646          3   .0769231   .0769231 |
   4. | .30738034          4   .0769231   .0769231 |
   5. | .55485982          5   .0769231   .0769231 |
      |--------------------------------------------|
   6. | .81817156          6   .0769231   .0769231 |
   7. | .78532276          7   .0769231   .0769231 |
   8. | .75880445          8   .0769231   .0769231 |
      +--------------------------------------------+
(note: file out_3702/D_gender_r_ps_avg_pooled_ia.dta not found)
file out_3702/D_gender_r_ps_avg_pooled_ia.dta saved
. 
.         forvalues i = 1(1)$L {
  2.                         ddml estimate, y1(Y1_pystacked1_L`i'_1) y0(Y1_pyst
> acked0_L`i'_1) ///
>                                                         d(D1_pystacked_L`i'_1
> ) robust atet foldvar(m0_sample_1  )
  3.                         regsave gender_r using `folder'/results.dta, ci //
> /
>                                                 addlabel(model,interactive,se
> ed,`seed',final,indiv,learner,`i') ///
>                                                 append
  4.         }

E[y|X,D=0]   = Y1_pystacked0_L1_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L1_1
E[D|X]       = D1_pystacked_L1_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.2279346    .109318    -2.09   0.037    -.4421939   -.0136753
------------------------------------------------------------------------------
Warning: 133 propensity scores trimmed to lower limit ..
Warning: 36 propensity scores trimmed to upper limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_3702/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L2_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L2_1
E[D|X]       = D1_pystacked_L2_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1214096   .0157055    -7.73   0.000    -.1521919   -.0906274
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_3702/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L3_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L3_1
E[D|X]       = D1_pystacked_L3_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0782649   .0346118    -2.26   0.024    -.1461027   -.0104271
------------------------------------------------------------------------------
Warning: 87 propensity scores trimmed to lower limit ..
Warning: 29 propensity scores trimmed to upper limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_3702/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L4_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L4_1
E[D|X]       = D1_pystacked_L4_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0382036   .0993783    -0.38   0.701    -.2329815    .1565744
------------------------------------------------------------------------------
Warning: 101 propensity scores trimmed to lower limit ..
Warning: 35 propensity scores trimmed to upper limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_3702/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L5_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L5_1
E[D|X]       = D1_pystacked_L5_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0709906   .0468469    -1.52   0.130    -.1628087    .0208276
------------------------------------------------------------------------------
Warning: 100 propensity scores trimmed to lower limit ..
Warning: 20 propensity scores trimmed to upper limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_3702/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L6_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L6_1
E[D|X]       = D1_pystacked_L6_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |   -.233605   .1869847    -1.25   0.212    -.6000883    .1328783
------------------------------------------------------------------------------
Warning: 90 propensity scores trimmed to lower limit ..
Warning: 22 propensity scores trimmed to upper limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_3702/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L7_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L7_1
E[D|X]       = D1_pystacked_L7_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0695322   .0252618    -2.75   0.006    -.1190445     -.02002
------------------------------------------------------------------------------
Warning: 5 propensity scores trimmed to lower limit ..
Warning: 1 propensity scores trimmed to upper limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_3702/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L8_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L8_1
E[D|X]       = D1_pystacked_L8_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1028701   .0163588    -6.29   0.000    -.1349327   -.0708075
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_3702/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L9_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L9_1
E[D|X]       = D1_pystacked_L9_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1077046    .015096    -7.13   0.000    -.1372922   -.0781171
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_3702/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L10_1                 Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L10_1
E[D|X]       = D1_pystacked_L10_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0714535   .0289586    -2.47   0.014    -.1282112   -.0146958
------------------------------------------------------------------------------
Warning: 1 propensity scores trimmed to lower limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_3702/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L11_1                 Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L11_1
E[D|X]       = D1_pystacked_L11_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0449222   .0515116    -0.87   0.383    -.1458832    .0560387
------------------------------------------------------------------------------
Warning: 88 propensity scores trimmed to lower limit ..
Warning: 25 propensity scores trimmed to upper limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_3702/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L12_1                 Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L12_1
E[D|X]       = D1_pystacked_L12_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1213669   .0167089    -7.26   0.000    -.1541158    -.088618
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_3702/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L13_1                 Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L13_1
E[D|X]       = D1_pystacked_L13_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.2706404   .2278099    -1.19   0.235    -.7171396    .1758587
------------------------------------------------------------------------------
Warning: 171 propensity scores trimmed to lower limit ..
Warning: 124 propensity scores trimmed to upper limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_3702/results.dta saved
. 
. }       

.         
. *****************************************************************************
> *  
. *** interactive NX: short-stacking                                           
>                                       ***
. *****************************************************************************
> *
. 
. if (`estimator'==3) {
. 
. gen one = 1     
. 
.         cap drop y0base*
.         cap drop dbase*
.         cap drop y1base*
. 
.         *** no cross-fitting
.         pystacked lnearn $X_expanded   $pystring_reg0  if gender_r == 0, type
> (reg) njobs($cores)  
.                 mat nxw_ia_y0 = e(weights)
.                 mat list nxw_ia_y0
.                                 preserve
.                                 svmat nxw_ia_y0
.                                 keep nxw_ia_y0*
.                                 save `folder'/nxw_ia_y0, replace
.                                 restore
.         predict y0base0, xb
.         predict y0base, base
. 
.         pystacked lnearn $X_expanded  $pystring_reg0 if gender_r == 1  , type
> (reg) njobs($cores)  
.                 mat nxw_ia_y1 = e(weights)
.                 mat list nxw_ia_y1
.                                 preserve
.                                 svmat nxw_ia_y1
.                                 keep nxw_ia_y1*
.                                 save `folder'/nxw_ia_y1, replace
.                                 restore
.         predict y1base0, xb
.         predict y1base, base
. 
.         pystacked gender_r $X_expanded $pystring_class  
.                 mat nxw_ia_d = e(weights)
.                 mat list nxw_ia_d
.                                 preserve
.                                 svmat nxw_ia_d
.                                 keep nxw_ia_d*
.                                 save `folder'/nxw_ia_d, replace
.                                 restore         
.         predict dbase0, pr
.         predict dbase, base pr
.         
.         forvalues i = 0(1)$L {
  2.                         _estimate_ate interactive, yname(lnearn) dname(gen
> der_r) ///
>                                                 y0(y0base`i') y1(y1base`i') d
> (dbase`i') ///
>                                                 atet foldid(one) robust model
> (interactive)
  3.                         regsave gender_r using `folder'/results.dta, ///
>                                                 ci addlabel(model,nxinter,see
> d,`seed',final,nx,learner,`i') append
  4.         }
.                 
. }

.         
. *****************************************************************************
> *  
. *** partial NX: short-stacking                                               
>                                       ***
. *****************************************************************************
> *
. 
. if (`estimator'==4) {
.         
. cap gen one = 1 
. 
.         cap drop Ybase* 
.         cap drop Dbase*
. 
.         *** no cross-fitting
.         pystacked lnearn $X_expanded $pystring_reg 
.                 mat nxw_y = e(weights)
.                 mat list nxw_y
.                                 preserve
.                                 svmat nxw_y
.                                 keep nxw_y*
.                                 save `folder'/nxw_y, replace
.                                 restore
.         predict Ybase0
.         predict Ybase, basexb
. 
.         pystacked gender_r $X_expanded $pystring_reg 
.                 mat nxw_d = e(weights)
.                 mat list nxw_d
.                                 preserve
.                                 svmat nxw_d
.                                 keep nxw_d*
.                                 save `folder'/nxw_d, replace
.                                 restore         
.         predict Dbase0
.         predict Dbase, basexb
. 
.         forvalues i = 0(1)$L {
  2.                 cap drop Ytil
  3.                 cap drop Dtil
  4.                 gen Ytil = lnearn - Ybase`i'
  5.                 gen Dtil = gender_r - Dbase`i'
  6.                 reg Ytil Dtil, robust
  7.                 regsave Dtil using `folder'/results.dta, ///
>                         ci addlabel(model,nxpartial,seed,`seed',final,nx,lear
> ner,`i') append
  8.         }
. 
. }

.         
. cap log close
