-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /cluster/home/kahrens/ddml_applied/GWG/Output/GWG_84685_2.txt
  log type:  text
 opened on:  10 Dec 2023, 19:14:51

. 
. which ddml
/cluster/home/kahrens/ado/plus/d/ddml.ado
*! ddml v1.4.3
*! last edited: 17aug2023
*! authors: aa/ms

. which pystacked
/cluster/home/kahrens/ado/plus/p/pystacked.ado
*! pystacked v0.7.5
*! last edited: 7aug2023
*! authors: aa/ms

. 
. set seed `seed'

. local folder out_`seed'

. 
. use "../Data/gender_gap_ML_processed", clear

. 
. cap mkdir `folder'

. 
. *****************************************************************************
> ***
. ***  controls
. *****************************************************************************
> ***
. 
. // create squared age and tenure here
. gen age_r2 = age_r^2

. gen tenure2 = tenure^2
(2 missing values generated)

. 
. // no base categories
. global continuous                                                            
>                                                            ///
>         age_r                                                                
>                                                                    /// no mis
> sing
>         yrsqual         /* years of education (derived) */                   
>                                    /// 355 missing
>         /// leavedu             /* age when left education (derived) */      
>                            /// 1,081 missing
>         pvlit1          /* literacy score: plausible value 1 (also 2-10 avail
> ) */       /// no missing
>         pvnum1          /* numeracy score: plausible value 1 (also 2-10 avail
> ) */       /// no missing
>         tenure          /* tenure = years in work for current employer */    
>                    /// 2 missing
>                                                                              
>                                                                            //

. // add second order terms here
. global continuous $continuous age_r2 tenure2

. 
. global discrete0                                                             
>                                                            ///             
>         b_q01a          /* education, highest level attained */              
>                            /// no missing
>         b_q01b          /* area of study */                                  
>                                                    /// 434 missing
>         d_q06c          /* part of a larger organization */                  
>                                    /// 13 missing
>         d_q08a          /* management position */                            
>                                            /// no missing
>         d_q09           /* type of contract */                               
>                                            /// 12 missing
>         d_q10_t1        /* hours per week at this job or business */         
>                    /// 1 missing
>         d_q14           /* job satisfaction */                               
>                                            /// 1 missing
>         i_q08           /* health status */                                  
>                                                    /// 2 missing
>         j_q02a          /* living with a partner */                          
>                                            /// 899 missing
>         j_q03d1_c       /* age of youngest child */                          
>                                            /// 2,718 missing
>         j_q04c1_c       /* immigration: age */                               
>                                            /// 4,375 missing
>         j_q06b          /* mother's highest level of educ */                 
>                            /// 445 missing
>         j_q07b          /* father's highest level of educ */                 
>                            /// 515 missing
>         j_q03b          /* number of children*/                              
>                                            /// 1,856 missing
>         impar           /* immigration: parents */                           
>                                            /// 21 missing
>         imgen           /* immigration: generation */                        
>                                    /// 344 missing
>         nfe12jr         /* informal job-related educ in prev 12 months */    
>                    /// 116 missing
>         nfe12njr        /* informal non-job-related educ in prev 12 months */
>            /// 116 missing
>                                                                              
>                                                                            //
>                                                                              
>                                                          

. global personality                                                           
>                                                            ///
>         i_q04b          /* Learning strategies, Relate new ideas into real li
> fe */      /// 16 missing
>         i_q04d          /* Learning strategies, Like learning new things */  
>                    /// no missing
>         i_q04h          /* Learning strategies, Attribute something new */   
>                    /// 10 missing
>         i_q04j          /* Learning strategies, Deal with difficult things */
>            /// no missing
>         i_q04l          /* Learning strategies, Fit different ideas together 
> */         /// 5 missing
>         i_q04m          /* Learning strategies, Looking for additional info *
> /          /// 1 missing
>         i_q05f          /* Cultural engagement, Voluntary non-profit work */ 
>            /// no missing
>         i_q06a          /* Political efficacy, No influence on the government
>  */        /// 14 missing
>         i_q07a          /* Social trust, Trust only few people */            
>                            /// 4 missing
>         i_q07b          /* Social trust, Other people take advantage of you *
> /          /// 6 missing
>                                                                              
>                                                                            //

. global discrete $discrete0                                                   
>                                                    ///
>         new_reg_tl2     /* geographical region */                            
>                                            /// 2 missing
>         new_isco1c      /* occupation */                                     
>                                                    /// no missing
>         new_isic1c      /* industry */                                       
>                                                    // no missing

. 
. global X_simple                                                         ///
>         i.(b_q01a d_q10_t1 j_q03b)                              ///
>         c.($continuous)

. 
. global X_fullinteracted                                         ///
>         i.($discrete0 )                                                 ///
>         i.new_isco1c#i.new_isic1c#i.new_reg_tl2 ///
>         c.($continuous)                  

.         
. global X_cont                                                           ///
>         c.($continuous)##i.($discrete)

. 
. global X_expanded                                                       ///
>         i.($discrete)                                                   ///
>         c.($continuous)                                                 ///
>         c.age_r#i.($discrete)                                   ///
>         c.tenure#i.($discrete)

. 
.         
. 
. *****************************************************************************
> ***
. ***  estimation sample
. *****************************************************************************
> ***
. 
. gen byte touse=1

. markout touse lnearn $X_expanded

. keep if touse
(53 observations deleted)

. 
. 
. *****************************************************************************
> ***
. ***  learners
. *****************************************************************************
> ***
. 
. global cores = 5

. 
. global rf1 min_samples_leaf(1)  max_features(sqrt) n_estimators(500)

. global rf2 min_samples_leaf(50)  max_features(sqrt) n_estimators(500)

. global rf3 min_samples_leaf(100)  max_features(sqrt) n_estimators(500)

. global grad1 n_estimators(500) n_iter_no_change(10)  

. global grad2 n_estimators(500)  

. global nnet1 hidden_layer_sizes(40 20 1 20 50) early_stopping 

. global nnet2 hidden_layer_sizes(30 30 30) early_stopping  

. 
. global pystring_reg0                                                         
>    || ///
>                                         m(ols)                               
>                            || ///
>                                         m(ols) xvars($X_simple)              
>            || ///
>                                         m(lassocv)                           
>                            || ///
>                                         m(ridgecv)                           
>                            || ///
>                                         m(lassocv)      xvars($X_cont)       
>            || ///
>                                         m(ridgecv)      xvars($X_cont)       
>            || ///
>                                         m(rf) opt($rf1)                      
>                    || ///
>                                         m(rf) opt($rf2)                      
>                    || ///
>                                         m(rf) opt($rf3)                      
>                    || ///
>                                         m(gradboost) opt($grad1)             
>            || ///
>                                         m(gradboost) opt($grad2)             
>            || ///
>                                         m(nnet) opt($nnet1)                  
>            || ///
>                                         m(nnet) opt($nnet2)                  
>            || //

. 
. global pystring_reg  $pystring_reg0 , type(reg) njobs($cores) 

.  
. global pystring_class0                                                       
>            || ///
>                                         m(logit)                             
>                            || ///
>                                         m(logit) xvars($X_simple)            
>            || ///
>                                         m(lassocv)                           
>                            || ///
>                                         m(ridgecv)                           
>                            || ///
>                                         m(lassocv)      xvars($X_cont)       
>            || ///
>                                         m(ridgecv)      xvars($X_cont)       
>            || ///
>                                         m(rf) opt($rf1)                      
>                    || ///
>                                         m(rf) opt($rf2)                      
>                    || ///
>                                         m(rf) opt($rf3)                      
>                    || ///
>                                         m(gradboost) opt($grad1)             
>            || ///
>                                         m(gradboost) opt($grad2)             
>            || ///
>                                         m(nnet) opt($nnet1)                  
>            || ///
>                                         m(nnet) opt($nnet2)                  
>            || //                   

.                                 
. global pystring_class $pystring_class0 , type(class) njobs($cores)

.                                         
. global R =1  

. global K=10 

. global L =13

.         
. *****************************************************************************
> *  
. *** ddml: estimation                                                         
>                                               ***
. *****************************************************************************
> *
. 
. if (`estimator'==1) {
. 
.         ddml init partial,  reps($R) kfolds($K)
.         ddml E[Y|X]: pystacked lnearn $X_expanded $pystring_reg
.         ddml E[D|X]: pystacked gender_r $X_expanded $pystring_reg
.         ddml crossfit, shortstack poolstack
.         ddml estimate, robust
.         
.         foreach mat in lnearn_mse gender_r_mse {
  2.                         ddml extract, show(mse)
  3.                         mat `mat' = r(`mat')
  4.                         mat list `mat'
  5.                                 preserve
  6.                                 svmat `mat'
  7.                                 keep `mat'*
  8.                                 keep if _n<=$L
  9.                                 gen stack_type = "conventional" if _n==1
 10.                                 replace stack_type = "pooled" if _n==2
 11.                                 replace stack_type = "short" if _n==3
 12.                                 gen model = "plm"
 13.                                 list if _n<=$L
 14.                                 save `folder'/`mat'_plm_mse, replace
 15.                                 restore 
 16.         }       
. 
.         cap drop mse_*
.         foreach var of varlist Y1_* {
  2.                  cap drop sqerr_`var'
  3.                  gen double sqerr_`var'=(lnearn-`var')^2
  4.                  sum sqerr_`var', meanonly
  5.                  gen double mse_`var'=r(mean) if _n ==1 
  6.         }
.         foreach var of varlist D1_* {
  2.                  cap drop sqerr_`var'
  3.                  gen double sqerr_`var'=(gender_r-`var')^2
  4.                  sum sqerr_`var', meanonly
  5.                  gen double mse_`var'=r(mean) if _n ==1 
  6.         }
.         preserve
.                 keep mse_*
.                 keep if _n==1
.                 save `folder'/plm_mse, replace
.         restore
.         cap drop mse_*
. 
.         ** initialize results file
.         regsave gender_r using `folder'/results.dta, ci addlabel(model,partia
> l,seed,`seed',final,init,learner,-99) replace
. 
.         foreach final in nnls1 singlebest ols avg {
  2. 
.                 ddml estimate, robust finalest(`final')
  3.         
.                         // regular stacking results
.                         ddml estimate, mname(m0) spec(st) replay  
  4.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,partial,seed,`seed',final,`final',learner,-1) append
  5.                         
.                         // shortstacking results
.                         ddml estimate, mname(m0) spec(ss) replay 
  6.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,partial,seed,`seed',final,`final',learner,-2) append
  7.                         
.                         // poolstacking results
.                         ddml estimate, mname(m0) spec(ps) replay  
  8.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,partial,seed,`seed',final,`final',learner,-3) append     
  9.                 
.                         // pystacked weights
.                         ddml extract, show(stweights)   
 10.                         foreach mat in Y1_pystacked_w_mn D1_pystacked_w_mn
>  {
 11.                                         ddml extract, show(stweights)   
 12.                                         mat `mat' = r(`mat')
 13.                                         mat list `mat'
 14.                                                 preserve
 15.                                                 svmat `mat'
 16.                                                 keep `mat'*
 17.                                                 list if _n<=4
 18.                                                 save `folder'/`mat'_`final
> '_regular, replace
 19.                                                 restore
 20.                         }       
 21.                         // shortstacked weights
.                         ddml extract, show(ssweights)
 22.                         foreach mat in Y_lnearn_ss D_gender_r_ss {
 23.                                         qui ddml extract, show(ssweights)
 24.                                         mat `mat' = r(`mat')
 25.                                         mat list `mat'
 26.                                                 preserve
 27.                                                 svmat `mat'
 28.                                                 keep `mat'*
 29.                                                 list if _n<=4
 30.                                                 save `folder'/`mat'_`final
> '_short, replace
 31.                                                 restore
 32.                         }       
 33.                         // poolstacked weights
. 
.                         foreach mat in Y_lnearn_ps D_gender_r_ps {
 34.                                         qui ddml extract, show(psweights)
 35.                                         mat `mat' = r(`mat')
 36.                                         mat list `mat'
 37.                                                 preserve
 38.                                                 svmat `mat'
 39.                                                 keep `mat'*
 40.                                                 list if _n<=4
 41.                                                 save `folder'/`mat'_`final
> '_pooled, replace
 42.                                                 restore
 43.                         }       
 44.         
.         }
. 
.         forvalues i = 1(1)$L {
  2.                         ddml estimate, y(Y1_pystacked_L`i'_1) ///
>                                                         d(D1_pystacked_L`i'_1
> ) robust
  3.                         regsave gender_r using `folder'/results.dta, ci //
> /
>                                                 addlabel(model,partial,seed,`
> seed',final,indiv,learner,`i') ///
>                                                 append
  4.         }
. 
. }

.         
. *****************************************************************************
> *  
. *** interactive: estimation                                                  
>                                       ***
. *****************************************************************************
> *
.         
. if (`estimator'==2) {   
. 
.         ddml init interactive, kfolds($K) reps($R)
.         ddml E[Y|X,D]: pystacked lnearn $X_expanded $pystring_reg
Learner Y1_pystacked added successfully.
.         ddml E[D|X]: pystacked gender_r $X_expanded $pystring_class
Learner D1_pystacked added successfully.
.         ddml crossfit, shortstack poolstack
Cross-fitting E[y|X,D] equation: lnearn
Cross-fitting fold 1 2 3 4 5 6 7 8 9 10 ...completed cross-fitting...completed 
> short-stacking...completed pooled-stacking
Cross-fitting E[D|X] equation: gender_r
Cross-fitting fold 1 2 3 4 5 6 7 8 9 10 ...completed cross-fitting...completed 
> short-stacking...completed pooled-stacking
.         ddml estimate, robust atet


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.071    (0.030)
  ss  1  [shortstack]          [ss]          [ss]    -0.074    (0.026)
  ps  1   [poolstack]          [ps]          [ps]    -0.071    (0.028)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0738639   .0262234    -2.82   0.005    -.1252608   -.0224671
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 3 propensity scores trimmed to lower limit .01.

. 
.         cap drop mse_*
.         foreach var of varlist Y1_pystacked0* {
  2.                  cap drop sqerr_`var'
  3.                  gen double sqerr_`var'=(lnearn-`var')^2 if gender_r==0
  4.                  sum sqerr_`var' if gender_r==0, meanonly
  5.                  gen double mse_`var'=r(mean) if _n ==1 
  6.         }
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
.         foreach var of varlist Y1_pystacked1* {
  2.                  cap drop sqerr_`var'
  3.                  gen double sqerr_`var'=(lnearn-`var')^2 if gender_r==1
  4.                  sum sqerr_`var' if gender_r==1, meanonly
  5.                  gen double mse_`var'=r(mean) if _n ==1 
  6.         }
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
.         foreach var of varlist D1_* {
  2.                  cap drop sqerr_`var'
  3.                  gen double sqerr_`var'=(gender_r-`var')^2
  4.                  sum sqerr_`var', meanonly
  5.                  gen double mse_`var'=r(mean) if _n ==1 
  6.         }
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
.         preserve
.                 keep mse_*
.                 keep if _n==1
(4,835 observations deleted)
.                 save `folder'/inter_mse, replace
(note: file out_84685/inter_mse.dta not found)
file out_84685/inter_mse.dta saved
.         restore
.         cap drop mse_*
.         
.         local mat gender_r_mse
.                         ddml extract, show(mse)

MSEs for gender_r:
                 rep   full smp      fold 1      fold 2      fold 3      fold 4
>       fold 5      fold 6      fold 7      fold 8      fold 9     fold 10 
    D1_pystacked   1      0.156       0.173       0.146       0.150       0.166
>        0.159       0.152       0.154       0.156       0.151       0.154  
   D_gender_r_ps   1      0.156       0.171       0.145       0.150       0.165
>        0.159       0.151       0.153       0.156       0.151       0.154  
   D_gender_r_ss   1      0.155       0.170       0.145       0.150       0.165
>        0.159       0.151       0.154       0.156       0.151       0.154  

MSEs for lnearn:
                D=  rep   full smp      fold 1      fold 2      fold 3      fol
> d 4      fold 5      fold 6      fold 7      fold 8      fold 9     fold 10 
    Y1_pystacked 0    1      0.226       0.239       0.501       0.165       0.
> 207       0.183       0.173       0.153       0.216       0.239       0.183  
    Y1_pystacked 1    1      0.174       0.205       0.224       0.162       0.
> 122       0.141       0.131       0.147       0.207       0.164       0.244  
     Y_lnearn_ps 0    1      8.298       8.317       8.241       8.480       8.
> 429       8.185       8.116       8.409       8.299       8.289       8.225  
     Y_lnearn_ps 1    1      7.489       7.544       7.523       7.481       7.
> 335       7.330       7.434       7.628       7.639       7.547       7.429  
     Y_lnearn_ss 0    1      0.224       0.238       0.498       0.161       0.
> 203       0.184       0.171       0.151       0.209       0.239       0.180  
     Y_lnearn_ss 1    1      0.173       0.204       0.223       0.161       0.
> 117       0.141       0.131       0.146       0.207       0.162       0.239  
.                         mat `mat' = r(`mat')
.                         mat list `mat'

gender_r_mse[3,12]
                      rep  full_sample        fold1        fold2        fold3
D1_pystacked            1    .15611099    .17324428    .14559822    .15046616
D_gender_r~s            1    .15552005    .17090426    .14487204    .14975285
D_gender_r~s            1    .15544897    .17029037    .14508463    .14950361

                    fold4        fold5        fold6        fold7        fold8
D1_pystacked    .16588883    .15894702    .15200169     .1536643    .15633857
D_gender_r~s    .16548089    .15897299     .1507532    .15349972    .15609227
D_gender_r~s     .1654547    .15897185    .15088182    .15375054    .15618565

                    fold9       fold10
D1_pystacked    .15090051    .15407606
D_gender_r~s    .15072051    .15416294
D_gender_r~s    .15082681    .15355014
.                                 preserve
.                                 svmat `mat'
.                                 keep `mat'*
.                                 keep if _n<=$L
(4,823 observations deleted)
.                                 gen stack_type = "conventional" if _n==1
(12 missing values generated)
.                                 replace stack_type = "pooled" if _n==2
(1 real change made)
.                                 replace stack_type = "short" if _n==3
(1 real change made)
.                                 gen model = "interactive"
.                                 list if _n<=$L

     +-----------------------------------------------------------------+
  1. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        1 |  .156111 | .1732443 | .1455982 | .1504662 | .1658888 |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |  .158947 | .1520017 | .1536643 | .1563386 | .1509005 | .1540761 |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |          conventional          |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  2. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        1 | .1555201 | .1709043 |  .144872 | .1497529 | .1654809 |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |  .158973 | .1507532 | .1534997 | .1560923 | .1507205 | .1541629 |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                pooled          |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  3. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        1 |  .155449 | .1702904 | .1450846 | .1495036 | .1654547 |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     | .1589718 | .1508818 | .1537505 | .1561857 | .1508268 | .1535501 |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                 short          |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  4. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  5. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  6. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  7. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  8. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  9. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 10. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 11. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 12. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 13. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+
.                                 save `folder'/`mat'_inter_gender_mse, replace
(note: file out_84685/gender_r_mse_inter_gender_mse.dta not found)
file out_84685/gender_r_mse_inter_gender_mse.dta saved
.                                 restore 
.                                 
.         local mat lnearn_mse
.                         ddml extract, show(mse)

MSEs for gender_r:
                 rep   full smp      fold 1      fold 2      fold 3      fold 4
>       fold 5      fold 6      fold 7      fold 8      fold 9     fold 10 
    D1_pystacked   1      0.156       0.173       0.146       0.150       0.166
>        0.159       0.152       0.154       0.156       0.151       0.154  
   D_gender_r_ps   1      0.156       0.171       0.145       0.150       0.165
>        0.159       0.151       0.153       0.156       0.151       0.154  
   D_gender_r_ss   1      0.155       0.170       0.145       0.150       0.165
>        0.159       0.151       0.154       0.156       0.151       0.154  

MSEs for lnearn:
                D=  rep   full smp      fold 1      fold 2      fold 3      fol
> d 4      fold 5      fold 6      fold 7      fold 8      fold 9     fold 10 
    Y1_pystacked 0    1      0.226       0.239       0.501       0.165       0.
> 207       0.183       0.173       0.153       0.216       0.239       0.183  
    Y1_pystacked 1    1      0.174       0.205       0.224       0.162       0.
> 122       0.141       0.131       0.147       0.207       0.164       0.244  
     Y_lnearn_ps 0    1      8.298       8.317       8.241       8.480       8.
> 429       8.185       8.116       8.409       8.299       8.289       8.225  
     Y_lnearn_ps 1    1      7.489       7.544       7.523       7.481       7.
> 335       7.330       7.434       7.628       7.639       7.547       7.429  
     Y_lnearn_ss 0    1      0.224       0.238       0.498       0.161       0.
> 203       0.184       0.171       0.151       0.209       0.239       0.180  
     Y_lnearn_ss 1    1      0.173       0.204       0.223       0.161       0.
> 117       0.141       0.131       0.146       0.207       0.162       0.239  
.                         mat `mat' = r(`mat')
.                         mat list `mat'

lnearn_mse[6,13]
                    D=0/1          rep  full_sample        fold1        fold2
Y1_pystacked            0            1     .2264986    .23927078    .50093234
Y1_pystacked            1            1     .1743766    .20459512    .22359552
 Y_lnearn_ps            0            1    8.2978079    8.3168283    8.2407177
 Y_lnearn_ps            1            1    7.4891276    7.5438679    7.5230218
 Y_lnearn_ss            0            1    .22399199     .2384261    .49817397
 Y_lnearn_ss            1            1    .17280425    .20383813    .22338806

                    fold3        fold4        fold5        fold6        fold7
Y1_pystacked    .16465897    .20711354    .18341124    .17255749    .15251654
Y1_pystacked    .16231661     .1217816    .14088592    .13075796    .14674818
 Y_lnearn_ps    8.4796081    8.4293596    8.1846556    8.1157085     8.408855
 Y_lnearn_ps    7.4813396    7.3351125    7.3298814    7.4340427    7.6275601
 Y_lnearn_ss    .16082316    .20347099    .18357801    .17073797    .15072504
 Y_lnearn_ss    .16056566    .11693646    .14081194    .13102369    .14565184

                    fold8        fold9       fold10
Y1_pystacked    .21588126    .23927908    .18271315
Y1_pystacked    .20728893    .16366498    .24432792
 Y_lnearn_ps    8.2990812    8.2888103    8.2251325
 Y_lnearn_ps    7.6385242    7.5474293    7.4290956
 Y_lnearn_ss    .20871729    .23913103    .17985517
 Y_lnearn_ss    .20660187    .16223672    .23897053
.                                 preserve
.                                 svmat `mat'
.                                 keep `mat'*
.                                 keep if _n<=(2*$L)
(4,810 observations deleted)
.                                 gen stack_type = "conventional" if _n<=2
(24 missing values generated)
.                                 replace stack_type = "pooled" if _n>=3 & _n<=
> 4
(2 real changes made)
.                                 replace stack_type = "short" if _n>4
(22 real changes made)
.                                 gen model = "interactive"
.                                 list if _n<=(2*$L)

     +-----------------------------------------------------------------+
  1. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        0 |        1 | .2264986 | .2392708 | .5009323 |  .164659 |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     | .2071135 | .1834112 | .1725575 | .1525165 | .2158813 | .2392791 |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |     .1827132     |     conventional      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  2. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        1 |        1 | .1743766 | .2045951 | .2235955 | .1623166 |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     | .1217816 | .1408859 |  .130758 | .1467482 | .2072889 |  .163665 |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |     .2443279     |     conventional      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  3. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        0 |        1 | 8.297808 | 8.316829 | 8.240718 | 8.479609 |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     | 8.429359 | 8.184655 | 8.115708 | 8.408855 | 8.299081 | 8.288811 |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |     8.225133     |           pooled      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  4. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        1 |        1 | 7.489128 | 7.543868 | 7.523022 | 7.481339 |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     | 7.335113 | 7.329881 | 7.434043 |  7.62756 | 7.638524 | 7.547429 |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |     7.429096     |           pooled      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  5. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        0 |        1 |  .223992 | .2384261 |  .498174 | .1608232 |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |  .203471 |  .183578 |  .170738 |  .150725 | .2087173 |  .239131 |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |     .1798552     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  6. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        1 |        1 | .1728043 | .2038381 | .2233881 | .1605657 |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     | .1169365 | .1408119 | .1310237 | .1456518 | .2066019 | .1622367 |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |     .2389705     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  7. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  8. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  9. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 10. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 11. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 12. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 13. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 14. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 15. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 16. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 17. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 18. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 19. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 20. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 21. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 22. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 23. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 24. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 25. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 26. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+
.                                 save `folder'/`mat'_inter_lnearn_mse, replace
(note: file out_84685/lnearn_mse_inter_lnearn_mse.dta not found)
file out_84685/lnearn_mse_inter_lnearn_mse.dta saved
.                                 restore 
.         
.         foreach final in nnls1 singlebest ols avg {
  2. 
.                 ddml estimate, robust finalest(`final') atet
  3.         
.                         // regular stacking results
.                         ddml estimate, mname(m0) spec(st) replay atet
  4.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,interactive,seed,`seed',final,`final',learner,-1) append
  5.                         
.                         // shortstacking results
.                         ddml estimate, mname(m0) spec(ss) replay atet
  6.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,interactive,seed,`seed',final,`final',learner,-2) append
  7.                         
.                         // poolstacking results
.                         ddml estimate, mname(m0) spec(ps) replay atet
  8.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,interactive,seed,`seed',final,`final',learner,-3) append
  9.                 
.                         // pystacked weights
.                         ddml extract, show(stweights)
 10.                         foreach mat in Y1_pystacked_w_mn D1_pystacked_w_mn
>  {
 11.                                         ddml extract, show(stweights)
 12.                                         mat `mat' = r(`mat')
 13.                                         mat list `mat'
 14.                                                 preserve
 15.                                                 svmat `mat'
 16.                                                 keep `mat'*
 17.                                                 list if _n<=8
 18.                                                 save `folder'/`mat'_`final
> '_regular_ia, replace
 19.                                                 restore
 20.                         }       
 21.                         // shortstacked weights
.                         ddml extract, show(ssweights)
 22.                         foreach mat in Y_lnearn_ss D_gender_r_ss {
 23.                                         ddml extract, show(ssweights)
 24.                                         mat `mat' = r(`mat')
 25.                                         mat list `mat'
 26.                                                 preserve
 27.                                                 svmat `mat'
 28.                                                 keep `mat'*
 29.                                                 list if _n<=8
 30.                                                 save `folder'/`mat'_`final
> '_short_ia, replace
 31.                                                 restore
 32.                         }       
 33.                         // poolstacked weights
.                         ddml extract, show(psweights)
 34.                         foreach mat in Y_lnearn_ps D_gender_r_ps {
 35.                                         ddml extract, show(psweights)
 36.                                         mat `mat' = r(`mat')
 37.                                         mat list `mat'
 38.                                                 preserve
 39.                                                 svmat `mat'
 40.                                                 keep `mat'*
 41.                                                 list if _n<=8
 42.                                                 save `folder'/`mat'_`final
> '_pooled_ia, replace
 43.                                                 restore
 44.                         }       
 45.         
.         }


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.071    (0.030)
  ss  1  [shortstack]          [ss]          [ss]    -0.074    (0.026)
  ps  1   [poolstack]          [ps]          [ps]    -0.071    (0.028)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0738639   .0262234    -2.82   0.005    -.1252608   -.0224671
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 3 propensity scores trimmed to lower limit .01.



Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.071    (0.030)
  ss  1  [shortstack]          [ss]          [ss]    -0.074    (0.026)
  ps  1   [poolstack]          [ps]          [ps]    -0.071    (0.028)

Stacking DDML model (ATET)
E[y|X,D=0]   = Y1_pystacked0_1                     Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1
E[D|X]       = D1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0707356    .029617    -2.39   0.017     -.128784   -.0126873
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 7 propensity scores trimmed to lower limit .01.

(note: variable final was str5, now str10 to accommodate using data's values)
file out_84685/results.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  ss  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.074    (0.026)
  ss  1  [shortstack]          [ss]          [ss]    -0.074    (0.026)
  ps  1   [poolstack]          [ps]          [ps]    -0.071    (0.028)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0738639   .0262234    -2.82   0.005    -.1252608   -.0224671
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 3 propensity scores trimmed to lower limit .01.

(note: variable final was str5, now str10 to accommodate using data's values)
file out_84685/results.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  ps  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.071    (0.028)
  ss  1  [shortstack]          [ss]          [ss]    -0.074    (0.026)
  ps  1   [poolstack]          [ps]          [ps]    -0.071    (0.028)

Poolstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ps0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ps1
E[D|X]       = D_gender_r_ps_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0705839   .0283729    -2.49   0.013    -.1261938    -.014974
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 7 propensity scores trimmed to lower limit .01.

(note: variable final was str5, now str10 to accommodate using data's values)
file out_84685/results.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .25173749    .25173749
    logit            2    7.363e-17    7.363e-17
  lassocv            3    .05320295    .05320295
  ridgecv            4    .07549623    .07549623
  lassocv            5    5.040e-17    5.040e-17
  ridgecv            6    .01359629    .01359629
       rf            7    .29658827    .29658827
       rf            8    5.114e-17    5.114e-17
       rf            9    5.601e-17    5.601e-17
gradboost           10    .04921249    .04921249
gradboost           11    .22576843    .22576843
     nnet           12    4.188e-17    4.188e-17
     nnet           13    .03439785    .03439785

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .02598823    .02598823
      ols            2            0     .0029768     .0029768
  lassocv            3            0    .08520868    .08520868
  ridgecv            4            0    .19416428    .19416428
  lassocv            5            0    .04766193    .04766193
  ridgecv            6            0     .0074659     .0074659
       rf            7            0    .44797773    .44797773
       rf            8            0    8.909e-17    8.909e-17
       rf            9            0    8.718e-17    8.718e-17
gradboost           10            0    .02704436    .02704436
gradboost           11            0    .12869972    .12869972
     nnet           12            0    .02675322    .02675322
     nnet           13            0    .00605915    .00605915
      ols            1            1    .00611719    .00611719
      ols            2            1    7.800e-17    7.800e-17
  lassocv            3            1    .12025153    .12025153
  ridgecv            4            1    .02666754    .02666754
  lassocv            5            1     .2027498     .2027498
  ridgecv            6            1    .03535007    .03535007
       rf            7            1    .49664272    .49664272
       rf            8            1    3.929e-17    3.929e-17
       rf            9            1    4.052e-17    4.052e-17
gradboost           10            1    .02019434    .02019434
gradboost           11            1    .03529164    .03529164
     nnet           12            1     .0350682     .0350682
     nnet           13            1    .02166696    .02166696

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .25173749    .25173749
    logit            2    7.363e-17    7.363e-17
  lassocv            3    .05320295    .05320295
  ridgecv            4    .07549623    .07549623
  lassocv            5    5.040e-17    5.040e-17
  ridgecv            6    .01359629    .01359629
       rf            7    .29658827    .29658827
       rf            8    5.114e-17    5.114e-17
       rf            9    5.601e-17    5.601e-17
gradboost           10    .04921249    .04921249
gradboost           11    .22576843    .22576843
     nnet           12    4.188e-17    4.188e-17
     nnet           13    .03439785    .03439785

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .02598823    .02598823
      ols            2            0     .0029768     .0029768
  lassocv            3            0    .08520868    .08520868
  ridgecv            4            0    .19416428    .19416428
  lassocv            5            0    .04766193    .04766193
  ridgecv            6            0     .0074659     .0074659
       rf            7            0    .44797773    .44797773
       rf            8            0    8.909e-17    8.909e-17
       rf            9            0    8.718e-17    8.718e-17
gradboost           10            0    .02704436    .02704436
gradboost           11            0    .12869972    .12869972
     nnet           12            0    .02675322    .02675322
     nnet           13            0    .00605915    .00605915
      ols            1            1    .00611719    .00611719
      ols            2            1    7.800e-17    7.800e-17
  lassocv            3            1    .12025153    .12025153
  ridgecv            4            1    .02666754    .02666754
  lassocv            5            1     .2027498     .2027498
  ridgecv            6            1    .03535007    .03535007
       rf            7            1    .49664272    .49664272
       rf            8            1    3.929e-17    3.929e-17
       rf            9            1    4.052e-17    4.052e-17
gradboost           10            1    .02019434    .02019434
gradboost           11            1    .03529164    .03529164
     nnet           12            1     .0350682     .0350682
     nnet           13            1    .02166696    .02166696

Y1_pystacked_w_mn[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .02598823    .02598823
      ols            2            0     .0029768     .0029768
  lassocv            3            0    .08520868    .08520868
  ridgecv            4            0    .19416428    .19416428
  lassocv            5            0    .04766193    .04766193
  ridgecv            6            0     .0074659     .0074659
       rf            7            0    .44797773    .44797773
       rf            8            0    8.909e-17    8.909e-17
       rf            9            0    8.718e-17    8.718e-17
gradboost           10            0    .02704436    .02704436
gradboost           11            0    .12869972    .12869972
     nnet           12            0    .02675322    .02675322
     nnet           13            0    .00605915    .00605915
      ols            1            1    .00611719    .00611719
      ols            2            1    7.800e-17    7.800e-17
  lassocv            3            1    .12025153    .12025153
  ridgecv            4            1    .02666754    .02666754
  lassocv            5            1     .2027498     .2027498
  ridgecv            6            1    .03535007    .03535007
       rf            7            1    .49664272    .49664272
       rf            8            1    3.929e-17    3.929e-17
       rf            9            1    4.052e-17    4.052e-17
gradboost           10            1    .02019434    .02019434
gradboost           11            1    .03529164    .03529164
     nnet           12            1     .0350682     .0350682
     nnet           13            1    .02166696    .02166696

      +-------------------------------------------+
      | Y1_pys~1   Y1_pys~2   Y1_pys~3   Y1_pys~4 |
      |-------------------------------------------|
   1. |        1          0   .0259882   .0259882 |
   2. |        2          0   .0029768   .0029768 |
   3. |        3          0   .0852087   .0852087 |
   4. |        4          0   .1941643   .1941643 |
   5. |        5          0   .0476619   .0476619 |
      |-------------------------------------------|
   6. |        6          0   .0074659   .0074659 |
   7. |        7          0   .4479777   .4479777 |
   8. |        8          0   8.91e-17   8.91e-17 |
      +-------------------------------------------+
(note: file out_84685/Y1_pystacked_w_mn_nnls1_regular_ia.dta not found)
file out_84685/Y1_pystacked_w_mn_nnls1_regular_ia.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .25173749    .25173749
    logit            2    7.363e-17    7.363e-17
  lassocv            3    .05320295    .05320295
  ridgecv            4    .07549623    .07549623
  lassocv            5    5.040e-17    5.040e-17
  ridgecv            6    .01359629    .01359629
       rf            7    .29658827    .29658827
       rf            8    5.114e-17    5.114e-17
       rf            9    5.601e-17    5.601e-17
gradboost           10    .04921249    .04921249
gradboost           11    .22576843    .22576843
     nnet           12    4.188e-17    4.188e-17
     nnet           13    .03439785    .03439785

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .02598823    .02598823
      ols            2            0     .0029768     .0029768
  lassocv            3            0    .08520868    .08520868
  ridgecv            4            0    .19416428    .19416428
  lassocv            5            0    .04766193    .04766193
  ridgecv            6            0     .0074659     .0074659
       rf            7            0    .44797773    .44797773
       rf            8            0    8.909e-17    8.909e-17
       rf            9            0    8.718e-17    8.718e-17
gradboost           10            0    .02704436    .02704436
gradboost           11            0    .12869972    .12869972
     nnet           12            0    .02675322    .02675322
     nnet           13            0    .00605915    .00605915
      ols            1            1    .00611719    .00611719
      ols            2            1    7.800e-17    7.800e-17
  lassocv            3            1    .12025153    .12025153
  ridgecv            4            1    .02666754    .02666754
  lassocv            5            1     .2027498     .2027498
  ridgecv            6            1    .03535007    .03535007
       rf            7            1    .49664272    .49664272
       rf            8            1    3.929e-17    3.929e-17
       rf            9            1    4.052e-17    4.052e-17
gradboost           10            1    .02019434    .02019434
gradboost           11            1    .03529164    .03529164
     nnet           12            1     .0350682     .0350682
     nnet           13            1    .02166696    .02166696

D1_pystacked_w_mn[13,3]
               learner  mean_weight        rep_1
    logit            1    .25173749    .25173749
    logit            2    7.363e-17    7.363e-17
  lassocv            3    .05320295    .05320295
  ridgecv            4    .07549623    .07549623
  lassocv            5    5.040e-17    5.040e-17
  ridgecv            6    .01359629    .01359629
       rf            7    .29658827    .29658827
       rf            8    5.114e-17    5.114e-17
       rf            9    5.601e-17    5.601e-17
gradboost           10    .04921249    .04921249
gradboost           11    .22576843    .22576843
     nnet           12    4.188e-17    4.188e-17
     nnet           13    .03439785    .03439785

      +--------------------------------+
      | D1_pys~1   D1_pys~2   D1_pys~3 |
      |--------------------------------|
   1. |        1   .2517375   .2517375 |
   2. |        2   7.36e-17   7.36e-17 |
   3. |        3   .0532029   .0532029 |
   4. |        4   .0754962   .0754962 |
   5. |        5   5.04e-17   5.04e-17 |
      |--------------------------------|
   6. |        6   .0135963   .0135963 |
   7. |        7   .2965883   .2965883 |
   8. |        8   5.11e-17   5.11e-17 |
      +--------------------------------+
(note: file out_84685/D1_pystacked_w_mn_nnls1_regular_ia.dta not found)
file out_84685/D1_pystacked_w_mn_nnls1_regular_ia.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .19712217    .19712217
    logit            2            0            0
  lassocv            3     .0337873     .0337873
  ridgecv            4    .09656469    .09656469
  lassocv            5            0            0
  ridgecv            6    .02585657    .02585657
       rf            7    .24786726    .24786726
       rf            8    1.223e-16    1.223e-16
       rf            9    2.508e-16    2.508e-16
gradboost           10    .12323819    .12323819
gradboost           11    .23293056    .23293056
     nnet           12    3.981e-16    3.981e-16
     nnet           13    .04263326    .04263326

short-stacked weights across resamples for lnearn
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0     .0218346     .0218346
      ols            2            0    2.523e-16    2.523e-16
  lassocv            3            0    .03730084    .03730084
  ridgecv            4            0    .24272638    .24272638
  lassocv            5            0    3.328e-17    3.328e-17
  ridgecv            6            0    9.681e-17    9.681e-17
       rf            7            0    .50473803    .50473803
       rf            8            0    1.724e-16    1.724e-16
       rf            9            0    8.462e-17    8.462e-17
gradboost           10            0    3.542e-17    3.542e-17
gradboost           11            0    .19340015    .19340015
     nnet           12            0    1.668e-17    1.668e-17
     nnet           13            0    8.544e-17    8.544e-17
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1    1.108e-16    1.108e-16
  lassocv            5            1    .34395465    .34395465
  ridgecv            6            1    .05384068    .05384068
       rf            7            1    .55291924    .55291924
       rf            8            1    1.452e-16    1.452e-16
       rf            9            1            0            0
gradboost           10            1    9.864e-18    9.864e-18
gradboost           11            1     .0009319     .0009319
     nnet           12            1    1.311e-16    1.311e-16
     nnet           13            1    .04835353    .04835353

short-stacked weights across resamples for gender_r
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .19712217    .19712217
    logit            2            0            0
  lassocv            3     .0337873     .0337873
  ridgecv            4    .09656469    .09656469
  lassocv            5            0            0
  ridgecv            6    .02585657    .02585657
       rf            7    .24786726    .24786726
       rf            8    1.223e-16    1.223e-16
       rf            9    2.508e-16    2.508e-16
gradboost           10    .12323819    .12323819
gradboost           11    .23293056    .23293056
     nnet           12    3.981e-16    3.981e-16
     nnet           13    .04263326    .04263326

short-stacked weights across resamples for lnearn
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0     .0218346     .0218346
      ols            2            0    2.523e-16    2.523e-16
  lassocv            3            0    .03730084    .03730084
  ridgecv            4            0    .24272638    .24272638
  lassocv            5            0    3.328e-17    3.328e-17
  ridgecv            6            0    9.681e-17    9.681e-17
       rf            7            0    .50473803    .50473803
       rf            8            0    1.724e-16    1.724e-16
       rf            9            0    8.462e-17    8.462e-17
gradboost           10            0    3.542e-17    3.542e-17
gradboost           11            0    .19340015    .19340015
     nnet           12            0    1.668e-17    1.668e-17
     nnet           13            0    8.544e-17    8.544e-17
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1    1.108e-16    1.108e-16
  lassocv            5            1    .34395465    .34395465
  ridgecv            6            1    .05384068    .05384068
       rf            7            1    .55291924    .55291924
       rf            8            1    1.452e-16    1.452e-16
       rf            9            1            0            0
gradboost           10            1    9.864e-18    9.864e-18
gradboost           11            1     .0009319     .0009319
     nnet           12            1    1.311e-16    1.311e-16
     nnet           13            1    .04835353    .04835353

Y_lnearn_ss[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0     .0218346     .0218346
      ols            2            0    2.523e-16    2.523e-16
  lassocv            3            0    .03730084    .03730084
  ridgecv            4            0    .24272638    .24272638
  lassocv            5            0    3.328e-17    3.328e-17
  ridgecv            6            0    9.681e-17    9.681e-17
       rf            7            0    .50473803    .50473803
       rf            8            0    1.724e-16    1.724e-16
       rf            9            0    8.462e-17    8.462e-17
gradboost           10            0    3.542e-17    3.542e-17
gradboost           11            0    .19340015    .19340015
     nnet           12            0    1.668e-17    1.668e-17
     nnet           13            0    8.544e-17    8.544e-17
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1    1.108e-16    1.108e-16
  lassocv            5            1    .34395465    .34395465
  ridgecv            6            1    .05384068    .05384068
       rf            7            1    .55291924    .55291924
       rf            8            1    1.452e-16    1.452e-16
       rf            9            1            0            0
gradboost           10            1    9.864e-18    9.864e-18
gradboost           11            1     .0009319     .0009319
     nnet           12            1    1.311e-16    1.311e-16
     nnet           13            1    .04835353    .04835353

      +-------------------------------------------------------------------+
      | Y_lne~1_1   Y_lne~0_1   Y_lne~s1   Y_lnea~2   Y_lnea~3   Y_lnea~4 |
      |-------------------------------------------------------------------|
   1. | 2.4947822   2.7603267          1          0   .0218346   .0218346 |
   2. | 3.0125694   3.2588447          2          0   2.52e-16   2.52e-16 |
   3. | 2.8546714   2.8208769          3          0   .0373008   .0373008 |
   4. | 2.4728594   2.6798282          4          0   .2427264   .2427264 |
   5. | 3.0931275    3.152693          5          0   3.33e-17   3.33e-17 |
      |-------------------------------------------------------------------|
   6. | 2.5534921   2.7236397          6          0   9.68e-17   9.68e-17 |
   7. | 2.4335959    2.607654          7          0    .504738    .504738 |
   8. | 2.6728076   2.6509254          8          0   1.72e-16   1.72e-16 |
      +-------------------------------------------------------------------+
(note: file out_84685/Y_lnearn_ss_nnls1_short_ia.dta not found)
file out_84685/Y_lnearn_ss_nnls1_short_ia.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .19712217    .19712217
    logit            2            0            0
  lassocv            3     .0337873     .0337873
  ridgecv            4    .09656469    .09656469
  lassocv            5            0            0
  ridgecv            6    .02585657    .02585657
       rf            7    .24786726    .24786726
       rf            8    1.223e-16    1.223e-16
       rf            9    2.508e-16    2.508e-16
gradboost           10    .12323819    .12323819
gradboost           11    .23293056    .23293056
     nnet           12    3.981e-16    3.981e-16
     nnet           13    .04263326    .04263326

short-stacked weights across resamples for lnearn
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0     .0218346     .0218346
      ols            2            0    2.523e-16    2.523e-16
  lassocv            3            0    .03730084    .03730084
  ridgecv            4            0    .24272638    .24272638
  lassocv            5            0    3.328e-17    3.328e-17
  ridgecv            6            0    9.681e-17    9.681e-17
       rf            7            0    .50473803    .50473803
       rf            8            0    1.724e-16    1.724e-16
       rf            9            0    8.462e-17    8.462e-17
gradboost           10            0    3.542e-17    3.542e-17
gradboost           11            0    .19340015    .19340015
     nnet           12            0    1.668e-17    1.668e-17
     nnet           13            0    8.544e-17    8.544e-17
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1    1.108e-16    1.108e-16
  lassocv            5            1    .34395465    .34395465
  ridgecv            6            1    .05384068    .05384068
       rf            7            1    .55291924    .55291924
       rf            8            1    1.452e-16    1.452e-16
       rf            9            1            0            0
gradboost           10            1    9.864e-18    9.864e-18
gradboost           11            1     .0009319     .0009319
     nnet           12            1    1.311e-16    1.311e-16
     nnet           13            1    .04835353    .04835353

D_gender_r_ss[13,3]
               learner  mean_weight        rep_1
    logit            1    .19712217    .19712217
    logit            2            0            0
  lassocv            3     .0337873     .0337873
  ridgecv            4    .09656469    .09656469
  lassocv            5            0            0
  ridgecv            6    .02585657    .02585657
       rf            7    .24786726    .24786726
       rf            8    1.223e-16    1.223e-16
       rf            9    2.508e-16    2.508e-16
gradboost           10    .12323819    .12323819
gradboost           11    .23293056    .23293056
     nnet           12    3.981e-16    3.981e-16
     nnet           13    .04263326    .04263326

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .76174812          1   .1971222   .1971222 |
   2. | .42635511          2          0          0 |
   3. | .09616557          3   .0337873   .0337873 |
   4. | .22763227          4   .0965647   .0965647 |
   5. | .58716539          5          0          0 |
      |--------------------------------------------|
   6. | .83752563          6   .0258566   .0258566 |
   7. | .82286363          7   .2478673   .2478673 |
   8. |  .8223642          8   1.22e-16   1.22e-16 |
      +--------------------------------------------+
(note: file out_84685/D_gender_r_ss_nnls1_short_ia.dta not found)
file out_84685/D_gender_r_ss_nnls1_short_ia.dta saved

pool-stacked weights across resamples for gender_r
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .25982313    .25982313
    logit            2    2.172e-16    2.172e-16
  lassocv            3    .06689232    .06689232
  ridgecv            4    .07868465    .07868465
  lassocv            5    1.820e-17    1.820e-17
  ridgecv            6            0            0
       rf            7    .30580144    .30580144
       rf            8            0            0
       rf            9    4.355e-16    4.355e-16
gradboost           10    .01630143    .01630143
gradboost           11    .23911403    .23911403
     nnet           12            0            0
     nnet           13      .033383      .033383

pool-stacked weights across resamples for lnearn
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0     .0228567     .0228567
      ols            2            0    4.478e-16    4.478e-16
  lassocv            3            0    .17723106    .17723106
  ridgecv            4            0    .16973742    .16973742
  lassocv            5            0            0            0
  ridgecv            6            0    5.627e-16    5.627e-16
       rf            7            0    .48664848    .48664848
       rf            8            0    1.925e-15    1.925e-15
       rf            9            0    1.850e-15    1.850e-15
gradboost           10            0    2.860e-17    2.860e-17
gradboost           11            0    .13975864    .13975864
     nnet           12            0    1.309e-15    1.309e-15
     nnet           13            0     .0037677     .0037677
      ols            1            1    3.195e-16    3.195e-16
      ols            2            1    1.252e-16    1.252e-16
  lassocv            3            1    .27245035    .27245035
  ridgecv            4            1    .04516521    .04516521
  lassocv            5            1    .06202214    .06202214
  ridgecv            6            1    .02040771    .02040771
       rf            7            1    .52994258    .52994258
       rf            8            1            0            0
       rf            9            1    2.827e-16    2.827e-16
gradboost           10            1    8.813e-17    8.813e-17
gradboost           11            1    .04605649    .04605649
     nnet           12            1            0            0
     nnet           13            1     .0239555     .0239555

pool-stacked weights across resamples for gender_r
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .25982313    .25982313
    logit            2    2.172e-16    2.172e-16
  lassocv            3    .06689232    .06689232
  ridgecv            4    .07868465    .07868465
  lassocv            5    1.820e-17    1.820e-17
  ridgecv            6            0            0
       rf            7    .30580144    .30580144
       rf            8            0            0
       rf            9    4.355e-16    4.355e-16
gradboost           10    .01630143    .01630143
gradboost           11    .23911403    .23911403
     nnet           12            0            0
     nnet           13      .033383      .033383

pool-stacked weights across resamples for lnearn
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0     .0228567     .0228567
      ols            2            0    4.478e-16    4.478e-16
  lassocv            3            0    .17723106    .17723106
  ridgecv            4            0    .16973742    .16973742
  lassocv            5            0            0            0
  ridgecv            6            0    5.627e-16    5.627e-16
       rf            7            0    .48664848    .48664848
       rf            8            0    1.925e-15    1.925e-15
       rf            9            0    1.850e-15    1.850e-15
gradboost           10            0    2.860e-17    2.860e-17
gradboost           11            0    .13975864    .13975864
     nnet           12            0    1.309e-15    1.309e-15
     nnet           13            0     .0037677     .0037677
      ols            1            1    3.195e-16    3.195e-16
      ols            2            1    1.252e-16    1.252e-16
  lassocv            3            1    .27245035    .27245035
  ridgecv            4            1    .04516521    .04516521
  lassocv            5            1    .06202214    .06202214
  ridgecv            6            1    .02040771    .02040771
       rf            7            1    .52994258    .52994258
       rf            8            1            0            0
       rf            9            1    2.827e-16    2.827e-16
gradboost           10            1    8.813e-17    8.813e-17
gradboost           11            1    .04605649    .04605649
     nnet           12            1            0            0
     nnet           13            1     .0239555     .0239555

Y_lnearn_ps[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0     .0228567     .0228567
      ols            2            0    4.478e-16    4.478e-16
  lassocv            3            0    .17723106    .17723106
  ridgecv            4            0    .16973742    .16973742
  lassocv            5            0            0            0
  ridgecv            6            0    5.627e-16    5.627e-16
       rf            7            0    .48664848    .48664848
       rf            8            0    1.925e-15    1.925e-15
       rf            9            0    1.850e-15    1.850e-15
gradboost           10            0    2.860e-17    2.860e-17
gradboost           11            0    .13975864    .13975864
     nnet           12            0    1.309e-15    1.309e-15
     nnet           13            0     .0037677     .0037677
      ols            1            1    3.195e-16    3.195e-16
      ols            2            1    1.252e-16    1.252e-16
  lassocv            3            1    .27245035    .27245035
  ridgecv            4            1    .04516521    .04516521
  lassocv            5            1    .06202214    .06202214
  ridgecv            6            1    .02040771    .02040771
       rf            7            1    .52994258    .52994258
       rf            8            1            0            0
       rf            9            1    2.827e-16    2.827e-16
gradboost           10            1    8.813e-17    8.813e-17
gradboost           11            1    .04605649    .04605649
     nnet           12            1            0            0
     nnet           13            1     .0239555     .0239555

      +-------------------------------------------------------------------+
      | Y_lne~1_1   Y_lne~0_1   Y_lne~s1   Y_lnea~2   Y_lnea~3   Y_lnea~4 |
      |-------------------------------------------------------------------|
   1. | 2.5005883   2.7457687          1          0   .0228567   .0228567 |
   2. | 3.0095102   3.2559882          2          0   4.48e-16   4.48e-16 |
   3. | 2.8431339   2.8090579          3          0   .1772311   .1772311 |
   4. | 2.4706849   2.6394141          4          0   .1697374   .1697374 |
   5. | 3.0982694    3.148286          5          0          0          0 |
      |-------------------------------------------------------------------|
   6. | 2.5495999   2.7198766          6          0   5.63e-16   5.63e-16 |
   7. | 2.4004293   2.5925018          7          0   .4866485   .4866485 |
   8. | 2.6523581   2.6615579          8          0   1.93e-15   1.93e-15 |
      +-------------------------------------------------------------------+
(note: file out_84685/Y_lnearn_ps_nnls1_pooled_ia.dta not found)
file out_84685/Y_lnearn_ps_nnls1_pooled_ia.dta saved

pool-stacked weights across resamples for gender_r
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .25982313    .25982313
    logit            2    2.172e-16    2.172e-16
  lassocv            3    .06689232    .06689232
  ridgecv            4    .07868465    .07868465
  lassocv            5    1.820e-17    1.820e-17
  ridgecv            6            0            0
       rf            7    .30580144    .30580144
       rf            8            0            0
       rf            9    4.355e-16    4.355e-16
gradboost           10    .01630143    .01630143
gradboost           11    .23911403    .23911403
     nnet           12            0            0
     nnet           13      .033383      .033383

pool-stacked weights across resamples for lnearn
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0     .0228567     .0228567
      ols            2            0    4.478e-16    4.478e-16
  lassocv            3            0    .17723106    .17723106
  ridgecv            4            0    .16973742    .16973742
  lassocv            5            0            0            0
  ridgecv            6            0    5.627e-16    5.627e-16
       rf            7            0    .48664848    .48664848
       rf            8            0    1.925e-15    1.925e-15
       rf            9            0    1.850e-15    1.850e-15
gradboost           10            0    2.860e-17    2.860e-17
gradboost           11            0    .13975864    .13975864
     nnet           12            0    1.309e-15    1.309e-15
     nnet           13            0     .0037677     .0037677
      ols            1            1    3.195e-16    3.195e-16
      ols            2            1    1.252e-16    1.252e-16
  lassocv            3            1    .27245035    .27245035
  ridgecv            4            1    .04516521    .04516521
  lassocv            5            1    .06202214    .06202214
  ridgecv            6            1    .02040771    .02040771
       rf            7            1    .52994258    .52994258
       rf            8            1            0            0
       rf            9            1    2.827e-16    2.827e-16
gradboost           10            1    8.813e-17    8.813e-17
gradboost           11            1    .04605649    .04605649
     nnet           12            1            0            0
     nnet           13            1     .0239555     .0239555

D_gender_r_ps[13,3]
               learner  mean_weight        rep_1
    logit            1    .25982313    .25982313
    logit            2    2.172e-16    2.172e-16
  lassocv            3    .06689232    .06689232
  ridgecv            4    .07868465    .07868465
  lassocv            5    1.820e-17    1.820e-17
  ridgecv            6            0            0
       rf            7    .30580144    .30580144
       rf            8            0            0
       rf            9    4.355e-16    4.355e-16
gradboost           10    .01630143    .01630143
gradboost           11    .23911403    .23911403
     nnet           12            0            0
     nnet           13      .033383      .033383

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .76007186          1   .2598231   .2598231 |
   2. | .41172715          2   2.17e-16   2.17e-16 |
   3. | .09527613          3   .0668923   .0668923 |
   4. |  .2132706          4   .0786846   .0786846 |
   5. | .58144008          5   1.82e-17   1.82e-17 |
      |--------------------------------------------|
   6. | .84363129          6          0          0 |
   7. | .81182857          7   .3058015   .3058015 |
   8. | .84063142          8          0          0 |
      +--------------------------------------------+
(note: file out_84685/D_gender_r_ps_nnls1_pooled_ia.dta not found)
file out_84685/D_gender_r_ps_nnls1_pooled_ia.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.069    (0.061)
  ss  1  [shortstack]          [ss]          [ss]    -0.086    (0.018)
  ps  1   [poolstack]          [ps]          [ps]    -0.092    (0.026)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0859172   .0175117    -4.91   0.000    -.1202396   -.0515949
------------------------------------------------------------------------------
Stacking final estimator: singlebest



Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.069    (0.061)
  ss  1  [shortstack]          [ss]          [ss]    -0.086    (0.018)
  ps  1   [poolstack]          [ps]          [ps]    -0.092    (0.026)

Stacking DDML model (ATET)
E[y|X,D=0]   = Y1_pystacked0_1                     Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1
E[D|X]       = D1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0687241   .0605691    -1.13   0.257    -.1874374    .0499892
------------------------------------------------------------------------------
Stacking final estimator: singlebest
Warning: 57 propensity scores trimmed to lower limit .01.
Warning: 11 propensity scores trimmed to upper limit .99.
Warning: . resamples had propensity scores trimmed to upper limit .99.

file out_84685/results.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  ss  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.086    (0.018)
  ss  1  [shortstack]          [ss]          [ss]    -0.086    (0.018)
  ps  1   [poolstack]          [ps]          [ps]    -0.092    (0.026)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0859172   .0175117    -4.91   0.000    -.1202396   -.0515949
------------------------------------------------------------------------------
Stacking final estimator: singlebest

file out_84685/results.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  ps  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.092    (0.026)
  ss  1  [shortstack]          [ss]          [ss]    -0.086    (0.018)
  ps  1   [poolstack]          [ps]          [ps]    -0.092    (0.026)

Poolstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ps0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ps1
E[D|X]       = D_gender_r_ps_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0924165   .0256252    -3.61   0.000     -.142641    -.042192
------------------------------------------------------------------------------
Stacking final estimator: singlebest
Warning: 80 propensity scores trimmed to lower limit .01.
Warning: 20 propensity scores trimmed to upper limit .99.
Warning: . resamples had propensity scores trimmed to upper limit .99.

file out_84685/results.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3           .5           .5
  ridgecv            4           .1           .1
  lassocv            5           .1           .1
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10           .3           .3
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0           .1           .1
  ridgecv            4            0           .2           .2
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0           .7           .7
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1           .3           .3
  ridgecv            6            1            0            0
       rf            7            1           .7           .7
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3           .5           .5
  ridgecv            4           .1           .1
  lassocv            5           .1           .1
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10           .3           .3
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0           .1           .1
  ridgecv            4            0           .2           .2
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0           .7           .7
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1           .3           .3
  ridgecv            6            1            0            0
       rf            7            1           .7           .7
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

Y1_pystacked_w_mn[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0           .1           .1
  ridgecv            4            0           .2           .2
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0           .7           .7
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1           .3           .3
  ridgecv            6            1            0            0
       rf            7            1           .7           .7
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

      +-------------------------------------------+
      | Y1_pys~1   Y1_pys~2   Y1_pys~3   Y1_pys~4 |
      |-------------------------------------------|
   1. |        1          0          0          0 |
   2. |        2          0          0          0 |
   3. |        3          0         .1         .1 |
   4. |        4          0         .2         .2 |
   5. |        5          0          0          0 |
      |-------------------------------------------|
   6. |        6          0          0          0 |
   7. |        7          0         .7         .7 |
   8. |        8          0          0          0 |
      +-------------------------------------------+
(note: file out_84685/Y1_pystacked_w_mn_singlebest_regular_ia.dta not found)
file out_84685/Y1_pystacked_w_mn_singlebest_regular_ia.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3           .5           .5
  ridgecv            4           .1           .1
  lassocv            5           .1           .1
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10           .3           .3
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0           .1           .1
  ridgecv            4            0           .2           .2
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0           .7           .7
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1           .3           .3
  ridgecv            6            1            0            0
       rf            7            1           .7           .7
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

D1_pystacked_w_mn[13,3]
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3           .5           .5
  ridgecv            4           .1           .1
  lassocv            5           .1           .1
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10           .3           .3
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

      +--------------------------------+
      | D1_pys~1   D1_pys~2   D1_pys~3 |
      |--------------------------------|
   1. |        1          0          0 |
   2. |        2          0          0 |
   3. |        3         .5         .5 |
   4. |        4         .1         .1 |
   5. |        5         .1         .1 |
      |--------------------------------|
   6. |        6          0          0 |
   7. |        7          0          0 |
   8. |        8          0          0 |
      +--------------------------------+
(note: file out_84685/D1_pystacked_w_mn_singlebest_regular_ia.dta not found)
file out_84685/D1_pystacked_w_mn_singlebest_regular_ia.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3            0            0
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            1            1
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

short-stacked weights across resamples for lnearn
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

short-stacked weights across resamples for gender_r
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3            0            0
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            1            1
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

short-stacked weights across resamples for lnearn
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

Y_lnearn_ss[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

      +-------------------------------------------------------------------+
      | Y_lne~1_1   Y_lne~0_1   Y_lne~s1   Y_lnea~2   Y_lnea~3   Y_lnea~4 |
      |-------------------------------------------------------------------|
   1. | 2.4832113   2.7921453          1          0          0          0 |
   2. | 2.9430187   3.2336388          2          0          0          0 |
   3. | 2.9242094    2.855828          3          0          0          0 |
   4. |  2.514786   2.6204472          4          0          0          0 |
   5. | 3.0666716   3.1460819          5          0          0          0 |
      |-------------------------------------------------------------------|
   6. | 2.5116916   2.7579265          6          0          0          0 |
   7. | 2.5066142   2.7911053          7          0          1          1 |
   8. | 2.6432626   2.7938592          8          0          0          0 |
      +-------------------------------------------------------------------+
(note: file out_84685/Y_lnearn_ss_singlebest_short_ia.dta not found)
file out_84685/Y_lnearn_ss_singlebest_short_ia.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3            0            0
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            1            1
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

short-stacked weights across resamples for lnearn
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

D_gender_r_ss[13,3]
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3            0            0
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            1            1
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .77363735          1          0          0 |
   2. | .54510969          2          0          0 |
   3. | .12236434          3          0          0 |
   4. | .28872752          4          0          0 |
   5. | .61645812          5          0          0 |
      |--------------------------------------------|
   6. | .79830301          6          0          0 |
   7. | .86310893          7          0          0 |
   8. | .69956088          8          0          0 |
      +--------------------------------------------+
(note: file out_84685/D_gender_r_ss_singlebest_short_ia.dta not found)
file out_84685/D_gender_r_ss_singlebest_short_ia.dta saved

pool-stacked weights across resamples for gender_r
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3            1            1
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

pool-stacked weights across resamples for lnearn
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

pool-stacked weights across resamples for gender_r
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3            1            1
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

pool-stacked weights across resamples for lnearn
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

Y_lnearn_ps[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

      +-------------------------------------------------------------------+
      | Y_lne~1_1   Y_lne~0_1   Y_lne~s1   Y_lnea~2   Y_lnea~3   Y_lnea~4 |
      |-------------------------------------------------------------------|
   1. | 2.4832113   2.7921453          1          0          0          0 |
   2. | 2.9430187   3.2336388          2          0          0          0 |
   3. | 2.9242094    2.855828          3          0          0          0 |
   4. |  2.514786   2.6204472          4          0          0          0 |
   5. | 3.0666716   3.1460819          5          0          0          0 |
      |-------------------------------------------------------------------|
   6. | 2.5116916   2.7579265          6          0          0          0 |
   7. | 2.5066142   2.7911053          7          0          1          1 |
   8. | 2.6432626   2.7938592          8          0          0          0 |
      +-------------------------------------------------------------------+
(note: file out_84685/Y_lnearn_ps_singlebest_pooled_ia.dta not found)
file out_84685/Y_lnearn_ps_singlebest_pooled_ia.dta saved

pool-stacked weights across resamples for gender_r
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3            1            1
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

pool-stacked weights across resamples for lnearn
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

D_gender_r_ps[13,3]
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3            1            1
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .76432198          1          0          0 |
   2. | .30862832          2          0          0 |
   3. | .04098487          3          1          1 |
   4. | .24740548          4          0          0 |
   5. | .55354011          5          0          0 |
      |--------------------------------------------|
   6. | .84338301          6          0          0 |
   7. | .84046406          7          0          0 |
   8. | .79019874          8          0          0 |
      +--------------------------------------------+
(note: file out_84685/D_gender_r_ps_singlebest_pooled_ia.dta not found)
file out_84685/D_gender_r_ps_singlebest_pooled_ia.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked   -10.198    (0.887)
  ss  1  [shortstack]          [ss]          [ss]     0.315    (0.115)
  ps  1   [poolstack]          [ps]          [ps]     0.138    (0.094)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |   .3149174   .1146635     2.75   0.006     .0901811    .5396538
------------------------------------------------------------------------------
Stacking final estimator: ols
Warning: 12 propensity scores trimmed to lower limit .01.
Warning: 267 propensity scores trimmed to upper limit .99.
Warning: . resamples had propensity scores trimmed to upper limit .99.



Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked   -10.198    (0.887)
  ss  1  [shortstack]          [ss]          [ss]     0.315    (0.115)
  ps  1   [poolstack]          [ps]          [ps]     0.138    (0.094)

Stacking DDML model (ATET)
E[y|X,D=0]   = Y1_pystacked0_1                     Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1
E[D|X]       = D1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -10.19816   .8868892   -11.50   0.000    -11.93643   -8.459893
------------------------------------------------------------------------------
Stacking final estimator: ols
Warning: 2417 propensity scores trimmed to lower limit .01.
Warning: 1524 propensity scores trimmed to upper limit .99.
Warning: . resamples had propensity scores trimmed to upper limit .99.

(note: variable final was str3, now str10 to accommodate using data's values)
file out_84685/results.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  ss  1  Y1_pystacked  Y1_pystacked  D1_pystacked     0.315    (0.115)
  ss  1  [shortstack]          [ss]          [ss]     0.315    (0.115)
  ps  1   [poolstack]          [ps]          [ps]     0.138    (0.094)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |   .3149174   .1146635     2.75   0.006     .0901811    .5396538
------------------------------------------------------------------------------
Stacking final estimator: ols
Warning: 12 propensity scores trimmed to lower limit .01.
Warning: 267 propensity scores trimmed to upper limit .99.
Warning: . resamples had propensity scores trimmed to upper limit .99.

(note: variable final was str3, now str10 to accommodate using data's values)
file out_84685/results.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  ps  1  Y1_pystacked  Y1_pystacked  D1_pystacked     0.138    (0.094)
  ss  1  [shortstack]          [ss]          [ss]     0.315    (0.115)
  ps  1   [poolstack]          [ps]          [ps]     0.138    (0.094)

Poolstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ps0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ps1
E[D|X]       = D_gender_r_ps_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |   .1380045   .0936454     1.47   0.141    -.0455371    .3215461
------------------------------------------------------------------------------
Stacking final estimator: ols
Warning: 12 propensity scores trimmed to lower limit .01.
Warning: 217 propensity scores trimmed to upper limit .99.
Warning: . resamples had propensity scores trimmed to upper limit .99.

(note: variable final was str3, now str10 to accommodate using data's values)
file out_84685/results.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .22498403    .22498403
    logit            2    .07461745    .07461745
  lassocv            3    .41652275    .41652275
  ridgecv            4     .0066539     .0066539
  lassocv            5    -.4145898    -.4145898
  ridgecv            6    .13674663    .13674663
       rf            7    .41579361    .41579361
       rf            8    .12657665    .12657665
       rf            9   -.21604215   -.21604215
gradboost           10    .11900286    .11900286
gradboost           11    .15785169    .15785169
     nnet           12   -1.0521755   -1.0521755
     nnet           13    .03863826    .03863826

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .02816024    .02816024
      ols            2            0   -.04756997   -.04756997
  lassocv            3            0   -.09637041   -.09637041
  ridgecv            4            0    .55728155    .55728155
  lassocv            5            0    .04985403    .04985403
  ridgecv            6            0   -.09183139   -.09183139
       rf            7            0    .66373413    .66373413
       rf            8            0    .06964943    .06964943
       rf            9            0   -.18233569   -.18233569
gradboost           10            0    .03904281    .03904281
gradboost           11            0     .0658953     .0658953
     nnet           12            0   -.16929111   -.16929111
     nnet           13            0   -.00589229   -.00589229
      ols            1            1   -.02301149   -.02301149
      ols            2            1   -.01851227   -.01851227
  lassocv            3            1   -.02927758   -.02927758
  ridgecv            4            1    .24248472    .24248472
  lassocv            5            1    .27991708    .27991708
  ridgecv            6            1   -.02218031   -.02218031
       rf            7            1    .54138227    .54138227
       rf            8            1    .19433488    .19433488
       rf            9            1    -.1125271    -.1125271
gradboost           10            1    .00729878    .00729878
gradboost           11            1    .00536448    .00536448
     nnet           12            1    .23597077    .23597077
     nnet           13            1    .00340074    .00340074

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .22498403    .22498403
    logit            2    .07461745    .07461745
  lassocv            3    .41652275    .41652275
  ridgecv            4     .0066539     .0066539
  lassocv            5    -.4145898    -.4145898
  ridgecv            6    .13674663    .13674663
       rf            7    .41579361    .41579361
       rf            8    .12657665    .12657665
       rf            9   -.21604215   -.21604215
gradboost           10    .11900286    .11900286
gradboost           11    .15785169    .15785169
     nnet           12   -1.0521755   -1.0521755
     nnet           13    .03863826    .03863826

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .02816024    .02816024
      ols            2            0   -.04756997   -.04756997
  lassocv            3            0   -.09637041   -.09637041
  ridgecv            4            0    .55728155    .55728155
  lassocv            5            0    .04985403    .04985403
  ridgecv            6            0   -.09183139   -.09183139
       rf            7            0    .66373413    .66373413
       rf            8            0    .06964943    .06964943
       rf            9            0   -.18233569   -.18233569
gradboost           10            0    .03904281    .03904281
gradboost           11            0     .0658953     .0658953
     nnet           12            0   -.16929111   -.16929111
     nnet           13            0   -.00589229   -.00589229
      ols            1            1   -.02301149   -.02301149
      ols            2            1   -.01851227   -.01851227
  lassocv            3            1   -.02927758   -.02927758
  ridgecv            4            1    .24248472    .24248472
  lassocv            5            1    .27991708    .27991708
  ridgecv            6            1   -.02218031   -.02218031
       rf            7            1    .54138227    .54138227
       rf            8            1    .19433488    .19433488
       rf            9            1    -.1125271    -.1125271
gradboost           10            1    .00729878    .00729878
gradboost           11            1    .00536448    .00536448
     nnet           12            1    .23597077    .23597077
     nnet           13            1    .00340074    .00340074

Y1_pystacked_w_mn[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .02816024    .02816024
      ols            2            0   -.04756997   -.04756997
  lassocv            3            0   -.09637041   -.09637041
  ridgecv            4            0    .55728155    .55728155
  lassocv            5            0    .04985403    .04985403
  ridgecv            6            0   -.09183139   -.09183139
       rf            7            0    .66373413    .66373413
       rf            8            0    .06964943    .06964943
       rf            9            0   -.18233569   -.18233569
gradboost           10            0    .03904281    .03904281
gradboost           11            0     .0658953     .0658953
     nnet           12            0   -.16929111   -.16929111
     nnet           13            0   -.00589229   -.00589229
      ols            1            1   -.02301149   -.02301149
      ols            2            1   -.01851227   -.01851227
  lassocv            3            1   -.02927758   -.02927758
  ridgecv            4            1    .24248472    .24248472
  lassocv            5            1    .27991708    .27991708
  ridgecv            6            1   -.02218031   -.02218031
       rf            7            1    .54138227    .54138227
       rf            8            1    .19433488    .19433488
       rf            9            1    -.1125271    -.1125271
gradboost           10            1    .00729878    .00729878
gradboost           11            1    .00536448    .00536448
     nnet           12            1    .23597077    .23597077
     nnet           13            1    .00340074    .00340074

      +---------------------------------------------+
      | Y1_pys~1   Y1_pys~2   Y1_pyst~3   Y1_pyst~4 |
      |---------------------------------------------|
   1. |        1          0    .0281602    .0281602 |
   2. |        2          0     -.04757     -.04757 |
   3. |        3          0   -.0963704   -.0963704 |
   4. |        4          0    .5572816    .5572816 |
   5. |        5          0     .049854     .049854 |
      |---------------------------------------------|
   6. |        6          0   -.0918314   -.0918314 |
   7. |        7          0    .6637341    .6637341 |
   8. |        8          0    .0696494    .0696494 |
      +---------------------------------------------+
(note: file out_84685/Y1_pystacked_w_mn_ols_regular_ia.dta not found)
file out_84685/Y1_pystacked_w_mn_ols_regular_ia.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .22498403    .22498403
    logit            2    .07461745    .07461745
  lassocv            3    .41652275    .41652275
  ridgecv            4     .0066539     .0066539
  lassocv            5    -.4145898    -.4145898
  ridgecv            6    .13674663    .13674663
       rf            7    .41579361    .41579361
       rf            8    .12657665    .12657665
       rf            9   -.21604215   -.21604215
gradboost           10    .11900286    .11900286
gradboost           11    .15785169    .15785169
     nnet           12   -1.0521755   -1.0521755
     nnet           13    .03863826    .03863826

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .02816024    .02816024
      ols            2            0   -.04756997   -.04756997
  lassocv            3            0   -.09637041   -.09637041
  ridgecv            4            0    .55728155    .55728155
  lassocv            5            0    .04985403    .04985403
  ridgecv            6            0   -.09183139   -.09183139
       rf            7            0    .66373413    .66373413
       rf            8            0    .06964943    .06964943
       rf            9            0   -.18233569   -.18233569
gradboost           10            0    .03904281    .03904281
gradboost           11            0     .0658953     .0658953
     nnet           12            0   -.16929111   -.16929111
     nnet           13            0   -.00589229   -.00589229
      ols            1            1   -.02301149   -.02301149
      ols            2            1   -.01851227   -.01851227
  lassocv            3            1   -.02927758   -.02927758
  ridgecv            4            1    .24248472    .24248472
  lassocv            5            1    .27991708    .27991708
  ridgecv            6            1   -.02218031   -.02218031
       rf            7            1    .54138227    .54138227
       rf            8            1    .19433488    .19433488
       rf            9            1    -.1125271    -.1125271
gradboost           10            1    .00729878    .00729878
gradboost           11            1    .00536448    .00536448
     nnet           12            1    .23597077    .23597077
     nnet           13            1    .00340074    .00340074

D1_pystacked_w_mn[13,3]
               learner  mean_weight        rep_1
    logit            1    .22498403    .22498403
    logit            2    .07461745    .07461745
  lassocv            3    .41652275    .41652275
  ridgecv            4     .0066539     .0066539
  lassocv            5    -.4145898    -.4145898
  ridgecv            6    .13674663    .13674663
       rf            7    .41579361    .41579361
       rf            8    .12657665    .12657665
       rf            9   -.21604215   -.21604215
gradboost           10    .11900286    .11900286
gradboost           11    .15785169    .15785169
     nnet           12   -1.0521755   -1.0521755
     nnet           13    .03863826    .03863826

      +----------------------------------+
      | D1_pys~1   D1_pyst~2   D1_pyst~3 |
      |----------------------------------|
   1. |        1     .224984     .224984 |
   2. |        2    .0746175    .0746175 |
   3. |        3    .4165227    .4165227 |
   4. |        4    .0066539    .0066539 |
   5. |        5   -.4145898   -.4145898 |
      |----------------------------------|
   6. |        6    .1367466    .1367466 |
   7. |        7    .4157936    .4157936 |
   8. |        8    .1265766    .1265766 |
      +----------------------------------+
(note: file out_84685/D1_pystacked_w_mn_ols_regular_ia.dta not found)
file out_84685/D1_pystacked_w_mn_ols_regular_ia.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .18252289    .18252289
    logit            2    .09274302    .09274302
  lassocv            3    .12659987    .12659987
  ridgecv            4    .00177327    .00177327
  lassocv            5   -.24825387   -.24825387
  ridgecv            6    .29106779    .29106779
       rf            7    .41183786    .41183786
       rf            8    .04907352    .04907352
       rf            9   -.31709882   -.31709882
gradboost           10    .32208437    .32208437
gradboost           11    .11564885    .11564885
     nnet           12    .01561003    .01561003
     nnet           13    .03311785    .03311785

short-stacked weights across resamples for lnearn
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .01252126    .01252126
      ols            2            0    -.0810522    -.0810522
  lassocv            3            0   -.16003707   -.16003707
  ridgecv            4            0     .7060225     .7060225
  lassocv            5            0   -.02352159   -.02352159
  ridgecv            6            0   -.13725063   -.13725063
       rf            7            0    .95743119    .95743119
       rf            8            0   -.73122297   -.73122297
       rf            9            0    .39648104    .39648104
gradboost           10            0     .0905354     .0905354
gradboost           11            0    .07991536    .07991536
     nnet           12            0    .02373355    .02373355
     nnet           13            0   -.01972062   -.01972062
      ols            1            1    -.0120396    -.0120396
      ols            2            1   -.05136087   -.05136087
  lassocv            3            1   -.32836306   -.32836306
  ridgecv            4            1    .38436434    .38436434
  lassocv            5            1    .49704171    .49704171
  ridgecv            6            1   -.07301901   -.07301901
       rf            7            1    .65720853    .65720853
       rf            8            1    .04538264    .04538264
       rf            9            1   -.06601647   -.06601647
gradboost           10            1    .03840929    .03840929
gradboost           11            1   -.04982224   -.04982224
     nnet           12            1    .01931914    .01931914
     nnet           13            1    .04133947    .04133947

short-stacked weights across resamples for gender_r
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .18252289    .18252289
    logit            2    .09274302    .09274302
  lassocv            3    .12659987    .12659987
  ridgecv            4    .00177327    .00177327
  lassocv            5   -.24825387   -.24825387
  ridgecv            6    .29106779    .29106779
       rf            7    .41183786    .41183786
       rf            8    .04907352    .04907352
       rf            9   -.31709882   -.31709882
gradboost           10    .32208437    .32208437
gradboost           11    .11564885    .11564885
     nnet           12    .01561003    .01561003
     nnet           13    .03311785    .03311785

short-stacked weights across resamples for lnearn
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .01252126    .01252126
      ols            2            0    -.0810522    -.0810522
  lassocv            3            0   -.16003707   -.16003707
  ridgecv            4            0     .7060225     .7060225
  lassocv            5            0   -.02352159   -.02352159
  ridgecv            6            0   -.13725063   -.13725063
       rf            7            0    .95743119    .95743119
       rf            8            0   -.73122297   -.73122297
       rf            9            0    .39648104    .39648104
gradboost           10            0     .0905354     .0905354
gradboost           11            0    .07991536    .07991536
     nnet           12            0    .02373355    .02373355
     nnet           13            0   -.01972062   -.01972062
      ols            1            1    -.0120396    -.0120396
      ols            2            1   -.05136087   -.05136087
  lassocv            3            1   -.32836306   -.32836306
  ridgecv            4            1    .38436434    .38436434
  lassocv            5            1    .49704171    .49704171
  ridgecv            6            1   -.07301901   -.07301901
       rf            7            1    .65720853    .65720853
       rf            8            1    .04538264    .04538264
       rf            9            1   -.06601647   -.06601647
gradboost           10            1    .03840929    .03840929
gradboost           11            1   -.04982224   -.04982224
     nnet           12            1    .01931914    .01931914
     nnet           13            1    .04133947    .04133947

Y_lnearn_ss[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .01252126    .01252126
      ols            2            0    -.0810522    -.0810522
  lassocv            3            0   -.16003707   -.16003707
  ridgecv            4            0     .7060225     .7060225
  lassocv            5            0   -.02352159   -.02352159
  ridgecv            6            0   -.13725063   -.13725063
       rf            7            0    .95743119    .95743119
       rf            8            0   -.73122297   -.73122297
       rf            9            0    .39648104    .39648104
gradboost           10            0     .0905354     .0905354
gradboost           11            0    .07991536    .07991536
     nnet           12            0    .02373355    .02373355
     nnet           13            0   -.01972062   -.01972062
      ols            1            1    -.0120396    -.0120396
      ols            2            1   -.05136087   -.05136087
  lassocv            3            1   -.32836306   -.32836306
  ridgecv            4            1    .38436434    .38436434
  lassocv            5            1    .49704171    .49704171
  ridgecv            6            1   -.07301901   -.07301901
       rf            7            1    .65720853    .65720853
       rf            8            1    .04538264    .04538264
       rf            9            1   -.06601647   -.06601647
gradboost           10            1    .03840929    .03840929
gradboost           11            1   -.04982224   -.04982224
     nnet           12            1    .01931914    .01931914
     nnet           13            1    .04133947    .04133947

      +---------------------------------------------------------------------+
      | Y_lne~1_1   Y_lne~0_1   Y_lne~s1   Y_lnea~2   Y_lnear~3   Y_lnear~4 |
      |---------------------------------------------------------------------|
   1. | 2.7402085   3.0671013          1          0    .0125213    .0125213 |
   2. | 3.2704152   3.6048992          2          0   -.0810522   -.0810522 |
   3. | 3.1181544   3.1653015          3          0   -.1600371   -.1600371 |
   4. | 2.7318444   2.9316703          4          0    .7060225    .7060225 |
   5. | 3.4013557   3.4674806          5          0   -.0235216   -.0235216 |
      |---------------------------------------------------------------------|
   6. | 2.8238464   3.0389782          6          0   -.1372506   -.1372506 |
   7. | 2.6472168   3.0130308          7          0    .9574312    .9574312 |
   8. | 2.9290894   2.9822487          8          0    -.731223    -.731223 |
      +---------------------------------------------------------------------+
(note: file out_84685/Y_lnearn_ss_ols_short_ia.dta not found)
file out_84685/Y_lnearn_ss_ols_short_ia.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .18252289    .18252289
    logit            2    .09274302    .09274302
  lassocv            3    .12659987    .12659987
  ridgecv            4    .00177327    .00177327
  lassocv            5   -.24825387   -.24825387
  ridgecv            6    .29106779    .29106779
       rf            7    .41183786    .41183786
       rf            8    .04907352    .04907352
       rf            9   -.31709882   -.31709882
gradboost           10    .32208437    .32208437
gradboost           11    .11564885    .11564885
     nnet           12    .01561003    .01561003
     nnet           13    .03311785    .03311785

short-stacked weights across resamples for lnearn
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .01252126    .01252126
      ols            2            0    -.0810522    -.0810522
  lassocv            3            0   -.16003707   -.16003707
  ridgecv            4            0     .7060225     .7060225
  lassocv            5            0   -.02352159   -.02352159
  ridgecv            6            0   -.13725063   -.13725063
       rf            7            0    .95743119    .95743119
       rf            8            0   -.73122297   -.73122297
       rf            9            0    .39648104    .39648104
gradboost           10            0     .0905354     .0905354
gradboost           11            0    .07991536    .07991536
     nnet           12            0    .02373355    .02373355
     nnet           13            0   -.01972062   -.01972062
      ols            1            1    -.0120396    -.0120396
      ols            2            1   -.05136087   -.05136087
  lassocv            3            1   -.32836306   -.32836306
  ridgecv            4            1    .38436434    .38436434
  lassocv            5            1    .49704171    .49704171
  ridgecv            6            1   -.07301901   -.07301901
       rf            7            1    .65720853    .65720853
       rf            8            1    .04538264    .04538264
       rf            9            1   -.06601647   -.06601647
gradboost           10            1    .03840929    .03840929
gradboost           11            1   -.04982224   -.04982224
     nnet           12            1    .01931914    .01931914
     nnet           13            1    .04133947    .04133947

D_gender_r_ss[13,3]
               learner  mean_weight        rep_1
    logit            1    .18252289    .18252289
    logit            2    .09274302    .09274302
  lassocv            3    .12659987    .12659987
  ridgecv            4    .00177327    .00177327
  lassocv            5   -.24825387   -.24825387
  ridgecv            6    .29106779    .29106779
       rf            7    .41183786    .41183786
       rf            8    .04907352    .04907352
       rf            9   -.31709882   -.31709882
gradboost           10    .32208437    .32208437
gradboost           11    .11564885    .11564885
     nnet           12    .01561003    .01561003
     nnet           13    .03311785    .03311785

      +----------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gende~2   D_gende~3 |
      |----------------------------------------------|
   1. | .81199655          1    .1825229    .1825229 |
   2. | .45866109          2     .092743     .092743 |
   3. |  .1023889          3    .1265999    .1265999 |
   4. | .22224943          4    .0017733    .0017733 |
   5. | .63870473          5   -.2482539   -.2482539 |
      |----------------------------------------------|
   6. | .91745284          6    .2910678    .2910678 |
   7. | .89436398          7    .4118379    .4118379 |
   8. | .86260172          8    .0490735    .0490735 |
      +----------------------------------------------+
(note: file out_84685/D_gender_r_ss_ols_short_ia.dta not found)
file out_84685/D_gender_r_ss_ols_short_ia.dta saved

pool-stacked weights across resamples for gender_r
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .21932563    .21932563
    logit            2    .08147593    .08147593
  lassocv            3    .23735166    .23735166
  ridgecv            4    .08601884    .08601884
  lassocv            5   -.24658299   -.24658299
  ridgecv            6     .0843001     .0843001
       rf            7     .4195529     .4195529
       rf            8    .10927222    .10927222
       rf            9    -.2159568    -.2159568
gradboost           10    .11849586    .11849586
gradboost           11    .15966877    .15966877
     nnet           12   -.01978976   -.01978976
     nnet           13    .03413286    .03413286

pool-stacked weights across resamples for lnearn
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .00791989    .00791989
      ols            2            0   -.04989307   -.04989307
  lassocv            3            0   -.00040151   -.00040151
  ridgecv            4            0    .44033049    .44033049
  lassocv            5            0   -.00362503   -.00362503
  ridgecv            6            0   -.02135013   -.02135013
       rf            7            0    .69363957    .69363957
       rf            8            0    .12307345    .12307345
       rf            9            0   -.24671543   -.24671543
gradboost           10            0    .03924381    .03924381
gradboost           11            0    .06242037    .06242037
     nnet           12            0    .01500524    .01500524
     nnet           13            0   -.00357113   -.00357113
      ols            1            1   -.00851788   -.00851788
      ols            2            1   -.01800709   -.01800709
  lassocv            3            1    .11275047    .11275047
  ridgecv            4            1    .26976105    .26976105
  lassocv            5            1    .09895775    .09895775
  ridgecv            6            1   -.03208189   -.03208189
       rf            7            1    .54517205    .54517205
       rf            8            1    .24777873    .24777873
       rf            9            1   -.16175837   -.16175837
gradboost           10            1    .01510941    .01510941
gradboost           11            1    .00650752    .00650752
     nnet           12            1    .01788323    .01788323
     nnet           13            1    .01773362    .01773362

pool-stacked weights across resamples for gender_r
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .21932563    .21932563
    logit            2    .08147593    .08147593
  lassocv            3    .23735166    .23735166
  ridgecv            4    .08601884    .08601884
  lassocv            5   -.24658299   -.24658299
  ridgecv            6     .0843001     .0843001
       rf            7     .4195529     .4195529
       rf            8    .10927222    .10927222
       rf            9    -.2159568    -.2159568
gradboost           10    .11849586    .11849586
gradboost           11    .15966877    .15966877
     nnet           12   -.01978976   -.01978976
     nnet           13    .03413286    .03413286

pool-stacked weights across resamples for lnearn
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .00791989    .00791989
      ols            2            0   -.04989307   -.04989307
  lassocv            3            0   -.00040151   -.00040151
  ridgecv            4            0    .44033049    .44033049
  lassocv            5            0   -.00362503   -.00362503
  ridgecv            6            0   -.02135013   -.02135013
       rf            7            0    .69363957    .69363957
       rf            8            0    .12307345    .12307345
       rf            9            0   -.24671543   -.24671543
gradboost           10            0    .03924381    .03924381
gradboost           11            0    .06242037    .06242037
     nnet           12            0    .01500524    .01500524
     nnet           13            0   -.00357113   -.00357113
      ols            1            1   -.00851788   -.00851788
      ols            2            1   -.01800709   -.01800709
  lassocv            3            1    .11275047    .11275047
  ridgecv            4            1    .26976105    .26976105
  lassocv            5            1    .09895775    .09895775
  ridgecv            6            1   -.03208189   -.03208189
       rf            7            1    .54517205    .54517205
       rf            8            1    .24777873    .24777873
       rf            9            1   -.16175837   -.16175837
gradboost           10            1    .01510941    .01510941
gradboost           11            1    .00650752    .00650752
     nnet           12            1    .01788323    .01788323
     nnet           13            1    .01773362    .01773362

Y_lnearn_ps[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .00791989    .00791989
      ols            2            0   -.04989307   -.04989307
  lassocv            3            0   -.00040151   -.00040151
  ridgecv            4            0    .44033049    .44033049
  lassocv            5            0   -.00362503   -.00362503
  ridgecv            6            0   -.02135013   -.02135013
       rf            7            0    .69363957    .69363957
       rf            8            0    .12307345    .12307345
       rf            9            0   -.24671543   -.24671543
gradboost           10            0    .03924381    .03924381
gradboost           11            0    .06242037    .06242037
     nnet           12            0    .01500524    .01500524
     nnet           13            0   -.00357113   -.00357113
      ols            1            1   -.00851788   -.00851788
      ols            2            1   -.01800709   -.01800709
  lassocv            3            1    .11275047    .11275047
  ridgecv            4            1    .26976105    .26976105
  lassocv            5            1    .09895775    .09895775
  ridgecv            6            1   -.03208189   -.03208189
       rf            7            1    .54517205    .54517205
       rf            8            1    .24777873    .24777873
       rf            9            1   -.16175837   -.16175837
gradboost           10            1    .01510941    .01510941
gradboost           11            1    .00650752    .00650752
     nnet           12            1    .01788323    .01788323
     nnet           13            1    .01773362    .01773362

      +---------------------------------------------------------------------+
      | Y_lne~1_1   Y_lne~0_1   Y_lne~s1   Y_lnea~2   Y_lnear~3   Y_lnear~4 |
      |---------------------------------------------------------------------|
   1. | 2.7834837   2.9082116          1          0    .0079199    .0079199 |
   2. |  3.303588   3.4264805          2          0   -.0498931   -.0498931 |
   3. | 3.1357808   2.9836435          3          0   -.0004015   -.0004015 |
   4. | 2.7559567   2.7390885          4          0    .4403305    .4403305 |
   5. | 3.4403354   3.3308696          5          0    -.003625    -.003625 |
      |---------------------------------------------------------------------|
   6. | 2.8437907   2.8661064          6          0   -.0213501   -.0213501 |
   7. | 2.6454011   2.7752141          7          0    .6936396    .6936396 |
   8. | 2.9517372   2.8228902          8          0    .1230734    .1230734 |
      +---------------------------------------------------------------------+
(note: file out_84685/Y_lnearn_ps_ols_pooled_ia.dta not found)
file out_84685/Y_lnearn_ps_ols_pooled_ia.dta saved

pool-stacked weights across resamples for gender_r
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .21932563    .21932563
    logit            2    .08147593    .08147593
  lassocv            3    .23735166    .23735166
  ridgecv            4    .08601884    .08601884
  lassocv            5   -.24658299   -.24658299
  ridgecv            6     .0843001     .0843001
       rf            7     .4195529     .4195529
       rf            8    .10927222    .10927222
       rf            9    -.2159568    -.2159568
gradboost           10    .11849586    .11849586
gradboost           11    .15966877    .15966877
     nnet           12   -.01978976   -.01978976
     nnet           13    .03413286    .03413286

pool-stacked weights across resamples for lnearn
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .00791989    .00791989
      ols            2            0   -.04989307   -.04989307
  lassocv            3            0   -.00040151   -.00040151
  ridgecv            4            0    .44033049    .44033049
  lassocv            5            0   -.00362503   -.00362503
  ridgecv            6            0   -.02135013   -.02135013
       rf            7            0    .69363957    .69363957
       rf            8            0    .12307345    .12307345
       rf            9            0   -.24671543   -.24671543
gradboost           10            0    .03924381    .03924381
gradboost           11            0    .06242037    .06242037
     nnet           12            0    .01500524    .01500524
     nnet           13            0   -.00357113   -.00357113
      ols            1            1   -.00851788   -.00851788
      ols            2            1   -.01800709   -.01800709
  lassocv            3            1    .11275047    .11275047
  ridgecv            4            1    .26976105    .26976105
  lassocv            5            1    .09895775    .09895775
  ridgecv            6            1   -.03208189   -.03208189
       rf            7            1    .54517205    .54517205
       rf            8            1    .24777873    .24777873
       rf            9            1   -.16175837   -.16175837
gradboost           10            1    .01510941    .01510941
gradboost           11            1    .00650752    .00650752
     nnet           12            1    .01788323    .01788323
     nnet           13            1    .01773362    .01773362

D_gender_r_ps[13,3]
               learner  mean_weight        rep_1
    logit            1    .21932563    .21932563
    logit            2    .08147593    .08147593
  lassocv            3    .23735166    .23735166
  ridgecv            4    .08601884    .08601884
  lassocv            5   -.24658299   -.24658299
  ridgecv            6     .0843001     .0843001
       rf            7     .4195529     .4195529
       rf            8    .10927222    .10927222
       rf            9    -.2159568    -.2159568
gradboost           10    .11849586    .11849586
gradboost           11    .15966877    .15966877
     nnet           12   -.01978976   -.01978976
     nnet           13    .03413286    .03413286

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .80338956          1   .2193256   .2193256 |
   2. |   .451873          2   .0814759   .0814759 |
   3. | .10321137          3   .2373517   .2373517 |
   4. | .21574644          4   .0860188   .0860188 |
   5. | .62111212          5   -.246583   -.246583 |
      |--------------------------------------------|
   6. | .91175971          6   .0843001   .0843001 |
   7. | .88196693          7   .4195529   .4195529 |
   8. | .88048694          8   .1092722   .1092722 |
      +--------------------------------------------+
(note: file out_84685/D_gender_r_ps_ols_pooled_ia.dta not found)
file out_84685/D_gender_r_ps_ols_pooled_ia.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.099    (0.018)
  ss  1  [shortstack]          [ss]          [ss]    -0.099    (0.018)
  ps  1   [poolstack]          [ps]          [ps]    -0.099    (0.018)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0985712   .0178481    -5.52   0.000    -.1335527   -.0635896
------------------------------------------------------------------------------
Stacking final estimator: avg



Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.099    (0.018)
  ss  1  [shortstack]          [ss]          [ss]    -0.099    (0.018)
  ps  1   [poolstack]          [ps]          [ps]    -0.099    (0.018)

Stacking DDML model (ATET)
E[y|X,D=0]   = Y1_pystacked0_1                     Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1
E[D|X]       = D1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0985712   .0178481    -5.52   0.000    -.1335527   -.0635896
------------------------------------------------------------------------------
Stacking final estimator: avg

(note: variable final was str3, now str10 to accommodate using data's values)
file out_84685/results.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  ss  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.099    (0.018)
  ss  1  [shortstack]          [ss]          [ss]    -0.099    (0.018)
  ps  1   [poolstack]          [ps]          [ps]    -0.099    (0.018)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0985712   .0178481    -5.52   0.000    -.1335527   -.0635896
------------------------------------------------------------------------------
Stacking final estimator: avg

(note: variable final was str3, now str10 to accommodate using data's values)
file out_84685/results.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  ps  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.099    (0.018)
  ss  1  [shortstack]          [ss]          [ss]    -0.099    (0.018)
  ps  1   [poolstack]          [ps]          [ps]    -0.099    (0.018)

Poolstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ps0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ps1
E[D|X]       = D_gender_r_ps_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0985712   .0178481    -5.52   0.000    -.1335527   -.0635896
------------------------------------------------------------------------------
Stacking final estimator: avg

(note: variable final was str3, now str10 to accommodate using data's values)
file out_84685/results.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

Y1_pystacked_w_mn[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

      +-------------------------------------------+
      | Y1_pys~1   Y1_pys~2   Y1_pys~3   Y1_pys~4 |
      |-------------------------------------------|
   1. |        1          0   .0769231   .0769231 |
   2. |        2          0   .0769231   .0769231 |
   3. |        3          0   .0769231   .0769231 |
   4. |        4          0   .0769231   .0769231 |
   5. |        5          0   .0769231   .0769231 |
      |-------------------------------------------|
   6. |        6          0   .0769231   .0769231 |
   7. |        7          0   .0769231   .0769231 |
   8. |        8          0   .0769231   .0769231 |
      +-------------------------------------------+
(note: file out_84685/Y1_pystacked_w_mn_avg_regular_ia.dta not found)
file out_84685/Y1_pystacked_w_mn_avg_regular_ia.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

D1_pystacked_w_mn[13,3]
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

      +--------------------------------+
      | D1_pys~1   D1_pys~2   D1_pys~3 |
      |--------------------------------|
   1. |        1   .0769231   .0769231 |
   2. |        2   .0769231   .0769231 |
   3. |        3   .0769231   .0769231 |
   4. |        4   .0769231   .0769231 |
   5. |        5   .0769231   .0769231 |
      |--------------------------------|
   6. |        6   .0769231   .0769231 |
   7. |        7   .0769231   .0769231 |
   8. |        8   .0769231   .0769231 |
      +--------------------------------+
(note: file out_84685/D1_pystacked_w_mn_avg_regular_ia.dta not found)
file out_84685/D1_pystacked_w_mn_avg_regular_ia.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

short-stacked weights across resamples for lnearn
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

short-stacked weights across resamples for gender_r
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

short-stacked weights across resamples for lnearn
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

Y_lnearn_ss[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

      +-------------------------------------------------------------------+
      | Y_lne~1_1   Y_lne~0_1   Y_lne~s1   Y_lnea~2   Y_lnea~3   Y_lnea~4 |
      |-------------------------------------------------------------------|
   1. | 2.5758624   2.7787735          1          0   .0769231   .0769231 |
   2. | 3.0412224   3.2337729          2          0   .0769231   .0769231 |
   3. | 2.7643306   2.7726075          3          0   .0769231   .0769231 |
   4. | 2.4539075   2.5951848          4          0   .0769231   .0769231 |
   5. | 3.0704411    3.107289          5          0   .0769231   .0769231 |
      |-------------------------------------------------------------------|
   6. | 2.5948691   2.7334111          6          0   .0769231   .0769231 |
   7. | 2.3747213    2.652719          7          0   .0769231   .0769231 |
   8. | 2.7468109    2.627586          8          0   .0769231   .0769231 |
      +-------------------------------------------------------------------+
(note: file out_84685/Y_lnearn_ss_avg_short_ia.dta not found)
file out_84685/Y_lnearn_ss_avg_short_ia.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

short-stacked weights across resamples for lnearn
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

D_gender_r_ss[13,3]
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .73092075          1   .0769231   .0769231 |
   2. | .42438536          2   .0769231   .0769231 |
   3. | .17644887          3   .0769231   .0769231 |
   4. | .32592412          4   .0769231   .0769231 |
   5. | .56106698          5   .0769231   .0769231 |
      |--------------------------------------------|
   6. | .78809731          6   .0769231   .0769231 |
   7. | .78685583          7   .0769231   .0769231 |
   8. | .75729149          8   .0769231   .0769231 |
      +--------------------------------------------+
(note: file out_84685/D_gender_r_ss_avg_short_ia.dta not found)
file out_84685/D_gender_r_ss_avg_short_ia.dta saved

pool-stacked weights across resamples for gender_r
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

pool-stacked weights across resamples for lnearn
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

pool-stacked weights across resamples for gender_r
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

pool-stacked weights across resamples for lnearn
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

Y_lnearn_ps[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

      +-------------------------------------------------------------------+
      | Y_lne~1_1   Y_lne~0_1   Y_lne~s1   Y_lnea~2   Y_lnea~3   Y_lnea~4 |
      |-------------------------------------------------------------------|
   1. | 2.5758624   2.7787735          1          0   .0769231   .0769231 |
   2. | 3.0412224   3.2337729          2          0   .0769231   .0769231 |
   3. | 2.7643306   2.7726075          3          0   .0769231   .0769231 |
   4. | 2.4539075   2.5951848          4          0   .0769231   .0769231 |
   5. | 3.0704411    3.107289          5          0   .0769231   .0769231 |
      |-------------------------------------------------------------------|
   6. | 2.5948691   2.7334111          6          0   .0769231   .0769231 |
   7. | 2.3747213    2.652719          7          0   .0769231   .0769231 |
   8. | 2.7468109    2.627586          8          0   .0769231   .0769231 |
      +-------------------------------------------------------------------+
(note: file out_84685/Y_lnearn_ps_avg_pooled_ia.dta not found)
file out_84685/Y_lnearn_ps_avg_pooled_ia.dta saved

pool-stacked weights across resamples for gender_r
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

pool-stacked weights across resamples for lnearn
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

D_gender_r_ps[13,3]
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .73092075          1   .0769231   .0769231 |
   2. | .42438536          2   .0769231   .0769231 |
   3. | .17644887          3   .0769231   .0769231 |
   4. | .32592412          4   .0769231   .0769231 |
   5. | .56106698          5   .0769231   .0769231 |
      |--------------------------------------------|
   6. | .78809731          6   .0769231   .0769231 |
   7. | .78685583          7   .0769231   .0769231 |
   8. | .75729149          8   .0769231   .0769231 |
      +--------------------------------------------+
(note: file out_84685/D_gender_r_ps_avg_pooled_ia.dta not found)
file out_84685/D_gender_r_ps_avg_pooled_ia.dta saved
. 
.         forvalues i = 1(1)$L {
  2.                         ddml estimate, y1(Y1_pystacked1_L`i'_1) y0(Y1_pyst
> acked0_L`i'_1) ///
>                                                         d(D1_pystacked_L`i'_1
> ) robust atet foldvar(m0_sample_1  )
  3.                         regsave gender_r using `folder'/results.dta, ci //
> /
>                                                 addlabel(model,interactive,se
> ed,`seed',final,indiv,learner,`i') ///
>                                                 append
  4.         }

E[y|X,D=0]   = Y1_pystacked0_L1_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L1_1
E[D|X]       = D1_pystacked_L1_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1136359   .0863978    -1.32   0.188    -.2829724    .0557007
------------------------------------------------------------------------------
Warning: 127 propensity scores trimmed to lower limit ..
Warning: 37 propensity scores trimmed to upper limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_84685/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L2_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L2_1
E[D|X]       = D1_pystacked_L2_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1206246   .0163601    -7.37   0.000    -.1526899   -.0885594
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_84685/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L3_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L3_1
E[D|X]       = D1_pystacked_L3_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0779628   .0337493    -2.31   0.021    -.1441103   -.0118153
------------------------------------------------------------------------------
Warning: 80 propensity scores trimmed to lower limit ..
Warning: 20 propensity scores trimmed to upper limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_84685/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L4_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L4_1
E[D|X]       = D1_pystacked_L4_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |   -.062223   .0652841    -0.95   0.341    -.1901775    .0657316
------------------------------------------------------------------------------
Warning: 85 propensity scores trimmed to lower limit ..
Warning: 24 propensity scores trimmed to upper limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_84685/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L5_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L5_1
E[D|X]       = D1_pystacked_L5_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |   -.073568   .0855843    -0.86   0.390    -.2413101    .0941742
------------------------------------------------------------------------------
Warning: 95 propensity scores trimmed to lower limit ..
Warning: 25 propensity scores trimmed to upper limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_84685/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L6_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L6_1
E[D|X]       = D1_pystacked_L6_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |   -.237565   .1748013    -1.36   0.174    -.5801692    .1050393
------------------------------------------------------------------------------
Warning: 88 propensity scores trimmed to lower limit ..
Warning: 22 propensity scores trimmed to upper limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_84685/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L7_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L7_1
E[D|X]       = D1_pystacked_L7_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0659483   .0296494    -2.22   0.026      -.12406   -.0078365
------------------------------------------------------------------------------
Warning: 2 propensity scores trimmed to lower limit ..
Warning: 1 propensity scores trimmed to upper limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_84685/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L8_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L8_1
E[D|X]       = D1_pystacked_L8_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |   -.105199    .015711    -6.70   0.000     -.135992   -.0744061
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_84685/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L9_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L9_1
E[D|X]       = D1_pystacked_L9_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1098301   .0150218    -7.31   0.000    -.1392722    -.080388
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_84685/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L10_1                 Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L10_1
E[D|X]       = D1_pystacked_L10_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0786436   .0178054    -4.42   0.000    -.1135416   -.0437455
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_84685/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L11_1                 Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L11_1
E[D|X]       = D1_pystacked_L11_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0393472   .0412374    -0.95   0.340     -.120171    .0414767
------------------------------------------------------------------------------
Warning: 89 propensity scores trimmed to lower limit ..
Warning: 17 propensity scores trimmed to upper limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_84685/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L12_1                 Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L12_1
E[D|X]       = D1_pystacked_L12_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1044244   .0191742    -5.45   0.000    -.1420052   -.0668437
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_84685/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L13_1                 Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L13_1
E[D|X]       = D1_pystacked_L13_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |   .1127666   .1654814     0.68   0.496    -.2115711    .4371043
------------------------------------------------------------------------------
Warning: 177 propensity scores trimmed to lower limit ..
Warning: 115 propensity scores trimmed to upper limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_84685/results.dta saved
. 
. }       

.         
. *****************************************************************************
> *  
. *** interactive NX: short-stacking                                           
>                                       ***
. *****************************************************************************
> *
. 
. if (`estimator'==3) {
. 
. gen one = 1     
. 
.         cap drop y0base*
.         cap drop dbase*
.         cap drop y1base*
. 
.         *** no cross-fitting
.         pystacked lnearn $X_expanded   $pystring_reg0  if gender_r == 0, type
> (reg) njobs($cores)  
.                 mat nxw_ia_y0 = e(weights)
.                 mat list nxw_ia_y0
.                                 preserve
.                                 svmat nxw_ia_y0
.                                 keep nxw_ia_y0*
.                                 save `folder'/nxw_ia_y0, replace
.                                 restore
.         predict y0base0, xb
.         predict y0base, base
. 
.         pystacked lnearn $X_expanded  $pystring_reg0 if gender_r == 1  , type
> (reg) njobs($cores)  
.                 mat nxw_ia_y1 = e(weights)
.                 mat list nxw_ia_y1
.                                 preserve
.                                 svmat nxw_ia_y1
.                                 keep nxw_ia_y1*
.                                 save `folder'/nxw_ia_y1, replace
.                                 restore
.         predict y1base0, xb
.         predict y1base, base
. 
.         pystacked gender_r $X_expanded $pystring_class  
.                 mat nxw_ia_d = e(weights)
.                 mat list nxw_ia_d
.                                 preserve
.                                 svmat nxw_ia_d
.                                 keep nxw_ia_d*
.                                 save `folder'/nxw_ia_d, replace
.                                 restore         
.         predict dbase0, pr
.         predict dbase, base pr
.         
.         forvalues i = 0(1)$L {
  2.                         _estimate_ate interactive, yname(lnearn) dname(gen
> der_r) ///
>                                                 y0(y0base`i') y1(y1base`i') d
> (dbase`i') ///
>                                                 atet foldid(one) robust model
> (interactive)
  3.                         regsave gender_r using `folder'/results.dta, ///
>                                                 ci addlabel(model,nxinter,see
> d,`seed',final,nx,learner,`i') append
  4.         }
.                 
. }

.         
. *****************************************************************************
> *  
. *** partial NX: short-stacking                                               
>                                       ***
. *****************************************************************************
> *
. 
. if (`estimator'==4) {
.         
. cap gen one = 1 
. 
.         cap drop Ybase* 
.         cap drop Dbase*
. 
.         *** no cross-fitting
.         pystacked lnearn $X_expanded $pystring_reg 
.                 mat nxw_y = e(weights)
.                 mat list nxw_y
.                                 preserve
.                                 svmat nxw_y
.                                 keep nxw_y*
.                                 save `folder'/nxw_y, replace
.                                 restore
.         predict Ybase0
.         predict Ybase, basexb
. 
.         pystacked gender_r $X_expanded $pystring_reg 
.                 mat nxw_d = e(weights)
.                 mat list nxw_d
.                                 preserve
.                                 svmat nxw_d
.                                 keep nxw_d*
.                                 save `folder'/nxw_d, replace
.                                 restore         
.         predict Dbase0
.         predict Dbase, basexb
. 
.         forvalues i = 0(1)$L {
  2.                 cap drop Ytil
  3.                 cap drop Dtil
  4.                 gen Ytil = lnearn - Ybase`i'
  5.                 gen Dtil = gender_r - Dbase`i'
  6.                 reg Ytil Dtil, robust
  7.                 regsave Dtil using `folder'/results.dta, ///
>                         ci addlabel(model,nxpartial,seed,`seed',final,nx,lear
> ner,`i') append
  8.         }
. 
. }

.         
. cap log close
