-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /cluster/home/kahrens/ddml_applied/GWG/Output/GWG_84685_1.txt
  log type:  text
 opened on:  10 Dec 2023, 19:14:52

. 
. which ddml
/cluster/home/kahrens/ado/plus/d/ddml.ado
*! ddml v1.4.3
*! last edited: 17aug2023
*! authors: aa/ms

. which pystacked
/cluster/home/kahrens/ado/plus/p/pystacked.ado
*! pystacked v0.7.5
*! last edited: 7aug2023
*! authors: aa/ms

. 
. set seed `seed'

. local folder out_`seed'

. 
. use "../Data/gender_gap_ML_processed", clear

. 
. cap mkdir `folder'

. 
. *****************************************************************************
> ***
. ***  controls
. *****************************************************************************
> ***
. 
. // create squared age and tenure here
. gen age_r2 = age_r^2

. gen tenure2 = tenure^2
(2 missing values generated)

. 
. // no base categories
. global continuous                                                            
>                                                            ///
>         age_r                                                                
>                                                                    /// no mis
> sing
>         yrsqual         /* years of education (derived) */                   
>                                    /// 355 missing
>         /// leavedu             /* age when left education (derived) */      
>                            /// 1,081 missing
>         pvlit1          /* literacy score: plausible value 1 (also 2-10 avail
> ) */       /// no missing
>         pvnum1          /* numeracy score: plausible value 1 (also 2-10 avail
> ) */       /// no missing
>         tenure          /* tenure = years in work for current employer */    
>                    /// 2 missing
>                                                                              
>                                                                            //

. // add second order terms here
. global continuous $continuous age_r2 tenure2

. 
. global discrete0                                                             
>                                                            ///             
>         b_q01a          /* education, highest level attained */              
>                            /// no missing
>         b_q01b          /* area of study */                                  
>                                                    /// 434 missing
>         d_q06c          /* part of a larger organization */                  
>                                    /// 13 missing
>         d_q08a          /* management position */                            
>                                            /// no missing
>         d_q09           /* type of contract */                               
>                                            /// 12 missing
>         d_q10_t1        /* hours per week at this job or business */         
>                    /// 1 missing
>         d_q14           /* job satisfaction */                               
>                                            /// 1 missing
>         i_q08           /* health status */                                  
>                                                    /// 2 missing
>         j_q02a          /* living with a partner */                          
>                                            /// 899 missing
>         j_q03d1_c       /* age of youngest child */                          
>                                            /// 2,718 missing
>         j_q04c1_c       /* immigration: age */                               
>                                            /// 4,375 missing
>         j_q06b          /* mother's highest level of educ */                 
>                            /// 445 missing
>         j_q07b          /* father's highest level of educ */                 
>                            /// 515 missing
>         j_q03b          /* number of children*/                              
>                                            /// 1,856 missing
>         impar           /* immigration: parents */                           
>                                            /// 21 missing
>         imgen           /* immigration: generation */                        
>                                    /// 344 missing
>         nfe12jr         /* informal job-related educ in prev 12 months */    
>                    /// 116 missing
>         nfe12njr        /* informal non-job-related educ in prev 12 months */
>            /// 116 missing
>                                                                              
>                                                                            //
>                                                                              
>                                                          

. global personality                                                           
>                                                            ///
>         i_q04b          /* Learning strategies, Relate new ideas into real li
> fe */      /// 16 missing
>         i_q04d          /* Learning strategies, Like learning new things */  
>                    /// no missing
>         i_q04h          /* Learning strategies, Attribute something new */   
>                    /// 10 missing
>         i_q04j          /* Learning strategies, Deal with difficult things */
>            /// no missing
>         i_q04l          /* Learning strategies, Fit different ideas together 
> */         /// 5 missing
>         i_q04m          /* Learning strategies, Looking for additional info *
> /          /// 1 missing
>         i_q05f          /* Cultural engagement, Voluntary non-profit work */ 
>            /// no missing
>         i_q06a          /* Political efficacy, No influence on the government
>  */        /// 14 missing
>         i_q07a          /* Social trust, Trust only few people */            
>                            /// 4 missing
>         i_q07b          /* Social trust, Other people take advantage of you *
> /          /// 6 missing
>                                                                              
>                                                                            //

. global discrete $discrete0                                                   
>                                                    ///
>         new_reg_tl2     /* geographical region */                            
>                                            /// 2 missing
>         new_isco1c      /* occupation */                                     
>                                                    /// no missing
>         new_isic1c      /* industry */                                       
>                                                    // no missing

. 
. global X_simple                                                         ///
>         i.(b_q01a d_q10_t1 j_q03b)                              ///
>         c.($continuous)

. 
. global X_fullinteracted                                         ///
>         i.($discrete0 )                                                 ///
>         i.new_isco1c#i.new_isic1c#i.new_reg_tl2 ///
>         c.($continuous)                  

.         
. global X_cont                                                           ///
>         c.($continuous)##i.($discrete)

. 
. global X_expanded                                                       ///
>         i.($discrete)                                                   ///
>         c.($continuous)                                                 ///
>         c.age_r#i.($discrete)                                   ///
>         c.tenure#i.($discrete)

. 
.         
. 
. *****************************************************************************
> ***
. ***  estimation sample
. *****************************************************************************
> ***
. 
. gen byte touse=1

. markout touse lnearn $X_expanded

. keep if touse
(53 observations deleted)

. 
. 
. *****************************************************************************
> ***
. ***  learners
. *****************************************************************************
> ***
. 
. global cores = 5

. 
. global rf1 min_samples_leaf(1)  max_features(sqrt) n_estimators(500)

. global rf2 min_samples_leaf(50)  max_features(sqrt) n_estimators(500)

. global rf3 min_samples_leaf(100)  max_features(sqrt) n_estimators(500)

. global grad1 n_estimators(500) n_iter_no_change(10)  

. global grad2 n_estimators(500)  

. global nnet1 hidden_layer_sizes(40 20 1 20 50) early_stopping 

. global nnet2 hidden_layer_sizes(30 30 30) early_stopping  

. 
. global pystring_reg0                                                         
>    || ///
>                                         m(ols)                               
>                            || ///
>                                         m(ols) xvars($X_simple)              
>            || ///
>                                         m(lassocv)                           
>                            || ///
>                                         m(ridgecv)                           
>                            || ///
>                                         m(lassocv)      xvars($X_cont)       
>            || ///
>                                         m(ridgecv)      xvars($X_cont)       
>            || ///
>                                         m(rf) opt($rf1)                      
>                    || ///
>                                         m(rf) opt($rf2)                      
>                    || ///
>                                         m(rf) opt($rf3)                      
>                    || ///
>                                         m(gradboost) opt($grad1)             
>            || ///
>                                         m(gradboost) opt($grad2)             
>            || ///
>                                         m(nnet) opt($nnet1)                  
>            || ///
>                                         m(nnet) opt($nnet2)                  
>            || //

. 
. global pystring_reg  $pystring_reg0 , type(reg) njobs($cores) 

.  
. global pystring_class0                                                       
>            || ///
>                                         m(logit)                             
>                            || ///
>                                         m(logit) xvars($X_simple)            
>            || ///
>                                         m(lassocv)                           
>                            || ///
>                                         m(ridgecv)                           
>                            || ///
>                                         m(lassocv)      xvars($X_cont)       
>            || ///
>                                         m(ridgecv)      xvars($X_cont)       
>            || ///
>                                         m(rf) opt($rf1)                      
>                    || ///
>                                         m(rf) opt($rf2)                      
>                    || ///
>                                         m(rf) opt($rf3)                      
>                    || ///
>                                         m(gradboost) opt($grad1)             
>            || ///
>                                         m(gradboost) opt($grad2)             
>            || ///
>                                         m(nnet) opt($nnet1)                  
>            || ///
>                                         m(nnet) opt($nnet2)                  
>            || //                   

.                                 
. global pystring_class $pystring_class0 , type(class) njobs($cores)

.                                         
. global R =1  

. global K=10 

. global L =13

.         
. *****************************************************************************
> *  
. *** ddml: estimation                                                         
>                                               ***
. *****************************************************************************
> *
. 
. if (`estimator'==1) {
. 
.         ddml init partial,  reps($R) kfolds($K)
.         ddml E[Y|X]: pystacked lnearn $X_expanded $pystring_reg
Learner Y1_pystacked added successfully.
.         ddml E[D|X]: pystacked gender_r $X_expanded $pystring_reg
Learner D1_pystacked added successfully.
.         ddml crossfit, shortstack poolstack
Cross-fitting E[y|X] equation: lnearn
Cross-fitting fold 1 2 3 4 5 6 7 8 9 10 ...completed cross-fitting...completed 
> short-stacking...completed pooled-stacking
Cross-fitting E[D|X] equation: gender_r
Cross-fitting fold 1 2 3 4 5 6 7 8 9 10 ...completed cross-fitting...completed 
> short-stacking...completed pooled-stacking
.         ddml estimate, robust


Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  st  1  Y1_pystacked  D1_pystacked    -0.103    (0.016)
  ss  1  [shortstack]          [ss]    -0.101    (0.016)
  ps  1   [poolstack]          [ps]    -0.102    (0.016)

Shortstack DDML model
y-E[y|X]  = y-Y_lnearn_ss_1                        Number of obs   =      4836
D-E[D|X]  = D-D_gender_r_ss_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1011179   .0163844    -6.17   0.000    -.1332309    -.069005
       _cons |  -.0009941   .0062956    -0.16   0.875    -.0133333     .011345
------------------------------------------------------------------------------
Stacking final estimator: nnls1

.         
.         foreach mat in lnearn_mse gender_r_mse {
  2.                         ddml extract, show(mse)
  3.                         mat `mat' = r(`mat')
  4.                         mat list `mat'
  5.                                 preserve
  6.                                 svmat `mat'
  7.                                 keep `mat'*
  8.                                 keep if _n<=$L
  9.                                 gen stack_type = "conventional" if _n==1
 10.                                 replace stack_type = "pooled" if _n==2
 11.                                 replace stack_type = "short" if _n==3
 12.                                 gen model = "plm"
 13.                                 list if _n<=$L
 14.                                 save `folder'/`mat'_plm_mse, replace
 15.                                 restore 
 16.         }       

MSEs for gender_r:
                 rep   full smp      fold 1      fold 2      fold 3      fold 4
>       fold 5      fold 6      fold 7      fold 8      fold 9     fold 10 
    D1_pystacked   1      0.157       0.168       0.149       0.151       0.169
>        0.162       0.154       0.153       0.158       0.153       0.153  
   D_gender_r_ps   1      0.157       0.169       0.148       0.150       0.169
>        0.161       0.153       0.153       0.157       0.153       0.153  
   D_gender_r_ss   1      0.157       0.169       0.148       0.151       0.169
>        0.162       0.153       0.152       0.157       0.152       0.153  

MSEs for lnearn:
                 rep   full smp      fold 1      fold 2      fold 3      fold 4
>       fold 5      fold 6      fold 7      fold 8      fold 9     fold 10 
    Y1_pystacked   1      0.194       0.220       0.340       0.160       0.157
>        0.156       0.142       0.150       0.206       0.188       0.223  
     Y_lnearn_ps   1      0.194       0.220       0.338       0.159       0.156
>        0.156       0.143       0.151       0.205       0.188       0.219  
     Y_lnearn_ss   1      0.193       0.221       0.336       0.160       0.155
>        0.156       0.143       0.151       0.207       0.187       0.213  

lnearn_mse[3,12]
                      rep  full_sample        fold1        fold2        fold3
Y1_pystacked            1    .19421536    .22031626     .3399539    .16037065
 Y_lnearn_ps            1    .19359894    .22013663    .33798916     .1594022
 Y_lnearn_ss            1    .19297805    .22080466    .33648917    .16021338

                    fold4        fold5        fold6        fold7        fold8
Y1_pystacked    .15718604    .15554364    .14244328    .15021748    .20550102
 Y_lnearn_ps    .15587538    .15646359    .14290867    .15053214    .20525117
 Y_lnearn_ss    .15503059    .15635296     .1425939    .15090912    .20691173

                    fold9       fold10
Y1_pystacked    .18795665    .22256508
 Y_lnearn_ps    .18802919    .21930484
 Y_lnearn_ss    .18732353    .21306592
(4,823 observations deleted)
(12 missing values generated)
(1 real change made)
(1 real change made)

     +-----------------------------------------------------------------+
  1. | lnear~e1 | lnear~e2 | lnearn~3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        1 | .1942154 | .2203163 | .3399539 | .1603706 |  .157186 |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     | .1555436 | .1424433 | .1502175 |  .205501 | .1879566 | .2225651 |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |           conventional            |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  2. | lnear~e1 | lnear~e2 | lnearn~3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        1 | .1935989 | .2201366 | .3379892 | .1594022 | .1558754 |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     | .1564636 | .1429087 | .1505321 | .2052512 | .1880292 | .2193048 |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                 pooled            |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  3. | lnear~e1 | lnear~e2 | lnearn~3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        1 |  .192978 | .2208047 | .3364892 | .1602134 | .1550306 |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |  .156353 | .1425939 | .1509091 | .2069117 | .1873235 | .2130659 |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                  short            |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  4. | lnear~e1 | lnear~e2 | lnearn~3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  5. | lnear~e1 | lnear~e2 | lnearn~3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  6. | lnear~e1 | lnear~e2 | lnearn~3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  7. | lnear~e1 | lnear~e2 | lnearn~3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  8. | lnear~e1 | lnear~e2 | lnearn~3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  9. | lnear~e1 | lnear~e2 | lnearn~3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 10. | lnear~e1 | lnear~e2 | lnearn~3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 11. | lnear~e1 | lnear~e2 | lnearn~3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 12. | lnear~e1 | lnear~e2 | lnearn~3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 13. | lnear~e1 | lnear~e2 | lnearn~3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+
(note: file out_84685/lnearn_mse_plm_mse.dta not found)
file out_84685/lnearn_mse_plm_mse.dta saved

MSEs for gender_r:
                 rep   full smp      fold 1      fold 2      fold 3      fold 4
>       fold 5      fold 6      fold 7      fold 8      fold 9     fold 10 
    D1_pystacked   1      0.157       0.168       0.149       0.151       0.169
>        0.162       0.154       0.153       0.158       0.153       0.153  
   D_gender_r_ps   1      0.157       0.169       0.148       0.150       0.169
>        0.161       0.153       0.153       0.157       0.153       0.153  
   D_gender_r_ss   1      0.157       0.169       0.148       0.151       0.169
>        0.162       0.153       0.152       0.157       0.152       0.153  

MSEs for lnearn:
                 rep   full smp      fold 1      fold 2      fold 3      fold 4
>       fold 5      fold 6      fold 7      fold 8      fold 9     fold 10 
    Y1_pystacked   1      0.194       0.220       0.340       0.160       0.157
>        0.156       0.142       0.150       0.206       0.188       0.223  
     Y_lnearn_ps   1      0.194       0.220       0.338       0.159       0.156
>        0.156       0.143       0.151       0.205       0.188       0.219  
     Y_lnearn_ss   1      0.193       0.221       0.336       0.160       0.155
>        0.156       0.143       0.151       0.207       0.187       0.213  

gender_r_mse[3,12]
                      rep  full_sample        fold1        fold2        fold3
D1_pystacked            1    .15693099    .16830378     .1488669    .15071748
D_gender_r~s            1     .1568006    .16879951    .14830518    .15048522
D_gender_r~s            1    .15665411    .16910981    .14787399    .15064119

                    fold4        fold5        fold6        fold7        fold8
D1_pystacked    .16882488    .16176329    .15407092    .15269904     .1578162
D_gender_r~s    .16866368    .16134314    .15347948     .1533214    .15748117
D_gender_r~s    .16909623    .16152993    .15331052    .15241441    .15710862

                    fold9       fold10
D1_pystacked    .15320448    .15304953
D_gender_r~s    .15294562    .15318792
D_gender_r~s    .15243987    .15302384
(4,823 observations deleted)
(12 missing values generated)
(1 real change made)
(1 real change made)

     +-----------------------------------------------------------------+
  1. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        1 |  .156931 | .1683038 | .1488669 | .1507175 | .1688249 |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     | .1617633 | .1540709 |  .152699 | .1578162 | .1532045 | .1530495 |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |           conventional            |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  2. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        1 | .1568006 | .1687995 | .1483052 | .1504852 | .1686637 |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     | .1613431 | .1534795 | .1533214 | .1574812 | .1529456 | .1531879 |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                 pooled            |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  3. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        1 | .1566541 | .1691098 |  .147874 | .1506412 | .1690962 |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     | .1615299 | .1533105 | .1524144 | .1571086 | .1524399 | .1530238 |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                  short            |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  4. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  5. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  6. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  7. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  8. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  9. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 10. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 11. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 12. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 13. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+
(note: file out_84685/gender_r_mse_plm_mse.dta not found)
file out_84685/gender_r_mse_plm_mse.dta saved
. 
.         cap drop mse_*
.         foreach var of varlist Y1_* {
  2.                  cap drop sqerr_`var'
  3.                  gen double sqerr_`var'=(lnearn-`var')^2
  4.                  sum sqerr_`var', meanonly
  5.                  gen double mse_`var'=r(mean) if _n ==1 
  6.         }
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
.         foreach var of varlist D1_* {
  2.                  cap drop sqerr_`var'
  3.                  gen double sqerr_`var'=(gender_r-`var')^2
  4.                  sum sqerr_`var', meanonly
  5.                  gen double mse_`var'=r(mean) if _n ==1 
  6.         }
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
.         preserve
.                 keep mse_*
.                 keep if _n==1
(4,835 observations deleted)
.                 save `folder'/plm_mse, replace
(note: file out_84685/plm_mse.dta not found)
file out_84685/plm_mse.dta saved
.         restore
.         cap drop mse_*
. 
.         ** initialize results file
.         regsave gender_r using `folder'/results.dta, ci addlabel(model,partia
> l,seed,`seed',final,init,learner,-99) replace
(note: file out_84685/results.dta not found)
file out_84685/results.dta saved
. 
.         foreach final in nnls1 singlebest ols avg {
  2. 
.                 ddml estimate, robust finalest(`final')
  3.         
.                         // regular stacking results
.                         ddml estimate, mname(m0) spec(st) replay  
  4.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,partial,seed,`seed',final,`final',learner,-1) append
  5.                         
.                         // shortstacking results
.                         ddml estimate, mname(m0) spec(ss) replay 
  6.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,partial,seed,`seed',final,`final',learner,-2) append
  7.                         
.                         // poolstacking results
.                         ddml estimate, mname(m0) spec(ps) replay  
  8.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,partial,seed,`seed',final,`final',learner,-3) append     
  9.                 
.                         // pystacked weights
.                         ddml extract, show(stweights)   
 10.                         foreach mat in Y1_pystacked_w_mn D1_pystacked_w_mn
>  {
 11.                                         ddml extract, show(stweights)   
 12.                                         mat `mat' = r(`mat')
 13.                                         mat list `mat'
 14.                                                 preserve
 15.                                                 svmat `mat'
 16.                                                 keep `mat'*
 17.                                                 list if _n<=4
 18.                                                 save `folder'/`mat'_`final
> '_regular, replace
 19.                                                 restore
 20.                         }       
 21.                         // shortstacked weights
.                         ddml extract, show(ssweights)
 22.                         foreach mat in Y_lnearn_ss D_gender_r_ss {
 23.                                         qui ddml extract, show(ssweights)
 24.                                         mat `mat' = r(`mat')
 25.                                         mat list `mat'
 26.                                                 preserve
 27.                                                 svmat `mat'
 28.                                                 keep `mat'*
 29.                                                 list if _n<=4
 30.                                                 save `folder'/`mat'_`final
> '_short, replace
 31.                                                 restore
 32.                         }       
 33.                         // poolstacked weights
. 
.                         foreach mat in Y_lnearn_ps D_gender_r_ps {
 34.                                         qui ddml extract, show(psweights)
 35.                                         mat `mat' = r(`mat')
 36.                                         mat list `mat'
 37.                                                 preserve
 38.                                                 svmat `mat'
 39.                                                 keep `mat'*
 40.                                                 list if _n<=4
 41.                                                 save `folder'/`mat'_`final
> '_pooled, replace
 42.                                                 restore
 43.                         }       
 44.         
.         }


Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  st  1  Y1_pystacked  D1_pystacked    -0.103    (0.016)
  ss  1  [shortstack]          [ss]    -0.101    (0.016)
  ps  1   [poolstack]          [ps]    -0.102    (0.016)

Shortstack DDML model
y-E[y|X]  = y-Y_lnearn_ss_1                        Number of obs   =      4836
D-E[D|X]  = D-D_gender_r_ss_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1011179   .0163844    -6.17   0.000    -.1332309    -.069005
       _cons |  -.0009941   .0062956    -0.16   0.875    -.0133333     .011345
------------------------------------------------------------------------------
Stacking final estimator: nnls1



Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  st  1  Y1_pystacked  D1_pystacked    -0.103    (0.016)
  ss  1  [shortstack]          [ss]    -0.101    (0.016)
  ps  1   [poolstack]          [ps]    -0.102    (0.016)

Stacking DDML model
y-E[y|X]  = y-Y1_pystacked_1                       Number of obs   =      4836
D-E[D|X]  = D-D1_pystacked_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1027996    .016469    -6.24   0.000    -.1350782   -.0705209
       _cons |  -.0014671   .0063155    -0.23   0.816    -.0138453     .010911
------------------------------------------------------------------------------
Stacking final estimator: nnls1

file out_84685/results.dta saved


Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  ss  1  Y1_pystacked  D1_pystacked    -0.101    (0.016)
  ss  1  [shortstack]          [ss]    -0.101    (0.016)
  ps  1   [poolstack]          [ps]    -0.102    (0.016)

Shortstack DDML model
y-E[y|X]  = y-Y_lnearn_ss_1                        Number of obs   =      4836
D-E[D|X]  = D-D_gender_r_ss_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1011179   .0163844    -6.17   0.000    -.1332309    -.069005
       _cons |  -.0009941   .0062956    -0.16   0.875    -.0133333     .011345
------------------------------------------------------------------------------
Stacking final estimator: nnls1

file out_84685/results.dta saved


Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  ps  1  Y1_pystacked  D1_pystacked    -0.102    (0.016)
  ss  1  [shortstack]          [ss]    -0.101    (0.016)
  ps  1   [poolstack]          [ps]    -0.102    (0.016)

Poolstack DDML model
y-E[y|X]  = y-Y_lnearn_ps_1                        Number of obs   =      4836
D-E[D|X]  = D-D_gender_r_ps_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1021313    .016444    -6.21   0.000     -.134361   -.0699015
       _cons |  -.0017339   .0063055    -0.27   0.783    -.0140924    .0106246
------------------------------------------------------------------------------
Stacking final estimator: nnls1

file out_84685/results.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: nnls1
               learner  mean_weight        rep_1
      ols            1    .11268312    .11268312
      ols            2    .00028962    .00028962
  lassocv            3    .24415946    .24415946
  ridgecv            4    5.871e-17    5.871e-17
  lassocv            5    2.445e-17    2.445e-17
  ridgecv            6    4.705e-17    4.705e-17
       rf            7    .42209825    .42209825
       rf            8    9.777e-17    9.777e-17
       rf            9    1.050e-16    1.050e-16
gradboost           10    .01698394    .01698394
gradboost           11    .19145238    .19145238
     nnet           12    1.897e-16    1.897e-16
     nnet           13    .01233323    .01233323

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: nnls1
               learner  mean_weight        rep_1
      ols            1    .03079525    .03079525
      ols            2    6.698e-17    6.698e-17
  lassocv            3    .03850705    .03850705
  ridgecv            4    .07145443    .07145443
  lassocv            5    .05494156    .05494156
  ridgecv            6    .22306137    .22306137
       rf            7    .39685496    .39685496
       rf            8    1.109e-16    1.109e-16
       rf            9    1.381e-16    1.381e-16
gradboost           10    .02805745    .02805745
gradboost           11    .10947303    .10947303
     nnet           12    .02611678    .02611678
     nnet           13    .02073812    .02073812

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: nnls1
               learner  mean_weight        rep_1
      ols            1    .11268312    .11268312
      ols            2    .00028962    .00028962
  lassocv            3    .24415946    .24415946
  ridgecv            4    5.871e-17    5.871e-17
  lassocv            5    2.445e-17    2.445e-17
  ridgecv            6    4.705e-17    4.705e-17
       rf            7    .42209825    .42209825
       rf            8    9.777e-17    9.777e-17
       rf            9    1.050e-16    1.050e-16
gradboost           10    .01698394    .01698394
gradboost           11    .19145238    .19145238
     nnet           12    1.897e-16    1.897e-16
     nnet           13    .01233323    .01233323

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: nnls1
               learner  mean_weight        rep_1
      ols            1    .03079525    .03079525
      ols            2    6.698e-17    6.698e-17
  lassocv            3    .03850705    .03850705
  ridgecv            4    .07145443    .07145443
  lassocv            5    .05494156    .05494156
  ridgecv            6    .22306137    .22306137
       rf            7    .39685496    .39685496
       rf            8    1.109e-16    1.109e-16
       rf            9    1.381e-16    1.381e-16
gradboost           10    .02805745    .02805745
gradboost           11    .10947303    .10947303
     nnet           12    .02611678    .02611678
     nnet           13    .02073812    .02073812

Y1_pystacked_w_mn[13,3]
               learner  mean_weight        rep_1
      ols            1    .03079525    .03079525
      ols            2    6.698e-17    6.698e-17
  lassocv            3    .03850705    .03850705
  ridgecv            4    .07145443    .07145443
  lassocv            5    .05494156    .05494156
  ridgecv            6    .22306137    .22306137
       rf            7    .39685496    .39685496
       rf            8    1.109e-16    1.109e-16
       rf            9    1.381e-16    1.381e-16
gradboost           10    .02805745    .02805745
gradboost           11    .10947303    .10947303
     nnet           12    .02611678    .02611678
     nnet           13    .02073812    .02073812

      +--------------------------------+
      | Y1_pys~1   Y1_pys~2   Y1_pys~3 |
      |--------------------------------|
   1. |        1   .0307952   .0307952 |
   2. |        2   6.70e-17   6.70e-17 |
   3. |        3   .0385071   .0385071 |
   4. |        4   .0714544   .0714544 |
      +--------------------------------+
(note: file out_84685/Y1_pystacked_w_mn_nnls1_regular.dta not found)
file out_84685/Y1_pystacked_w_mn_nnls1_regular.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: nnls1
               learner  mean_weight        rep_1
      ols            1    .11268312    .11268312
      ols            2    .00028962    .00028962
  lassocv            3    .24415946    .24415946
  ridgecv            4    5.871e-17    5.871e-17
  lassocv            5    2.445e-17    2.445e-17
  ridgecv            6    4.705e-17    4.705e-17
       rf            7    .42209825    .42209825
       rf            8    9.777e-17    9.777e-17
       rf            9    1.050e-16    1.050e-16
gradboost           10    .01698394    .01698394
gradboost           11    .19145238    .19145238
     nnet           12    1.897e-16    1.897e-16
     nnet           13    .01233323    .01233323

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: nnls1
               learner  mean_weight        rep_1
      ols            1    .03079525    .03079525
      ols            2    6.698e-17    6.698e-17
  lassocv            3    .03850705    .03850705
  ridgecv            4    .07145443    .07145443
  lassocv            5    .05494156    .05494156
  ridgecv            6    .22306137    .22306137
       rf            7    .39685496    .39685496
       rf            8    1.109e-16    1.109e-16
       rf            9    1.381e-16    1.381e-16
gradboost           10    .02805745    .02805745
gradboost           11    .10947303    .10947303
     nnet           12    .02611678    .02611678
     nnet           13    .02073812    .02073812

D1_pystacked_w_mn[13,3]
               learner  mean_weight        rep_1
      ols            1    .11268312    .11268312
      ols            2    .00028962    .00028962
  lassocv            3    .24415946    .24415946
  ridgecv            4    5.871e-17    5.871e-17
  lassocv            5    2.445e-17    2.445e-17
  ridgecv            6    4.705e-17    4.705e-17
       rf            7    .42209825    .42209825
       rf            8    9.777e-17    9.777e-17
       rf            9    1.050e-16    1.050e-16
gradboost           10    .01698394    .01698394
gradboost           11    .19145238    .19145238
     nnet           12    1.897e-16    1.897e-16
     nnet           13    .01233323    .01233323

      +--------------------------------+
      | D1_pys~1   D1_pys~2   D1_pys~3 |
      |--------------------------------|
   1. |        1   .1126831   .1126831 |
   2. |        2   .0002896   .0002896 |
   3. |        3   .2441595   .2441595 |
   4. |        4   5.87e-17   5.87e-17 |
      +--------------------------------+
(note: file out_84685/D1_pystacked_w_mn_nnls1_regular.dta not found)
file out_84685/D1_pystacked_w_mn_nnls1_regular.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: nnls1
               learner  mean_weight        rep_1
      ols            1    .17435767    .17435767
      ols            2    4.625e-17    4.625e-17
  lassocv            3    .17449656    .17449656
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7    .48194128    .48194128
       rf            8            0            0
       rf            9    1.436e-16    1.436e-16
gradboost           10    2.339e-17    2.339e-17
gradboost           11    .16920449    .16920449
     nnet           12            0            0
     nnet           13    1.611e-16    1.611e-16

short-stacked weights across resamples for lnearn
final stacking estimator: nnls1
               learner  mean_weight        rep_1
      ols            1    7.158e-18    7.158e-18
      ols            2    5.786e-18    5.786e-18
  lassocv            3    1.106e-16    1.106e-16
  ridgecv            4    .01812359    .01812359
  lassocv            5    .17735098    .17735098
  ridgecv            6    .10976296    .10976296
       rf            7    .42246574    .42246574
       rf            8            0            0
       rf            9    8.541e-17    8.541e-17
gradboost           10    .03218493    .03218493
gradboost           11    .15058585    .15058585
     nnet           12    6.455e-17    6.455e-17
     nnet           13    .08952594    .08952594

Y_lnearn_ss[13,3]
               learner  mean_weight        rep_1
      ols            1    7.158e-18    7.158e-18
      ols            2    5.786e-18    5.786e-18
  lassocv            3    1.106e-16    1.106e-16
  ridgecv            4    .01812359    .01812359
  lassocv            5    .17735098    .17735098
  ridgecv            6    .10976296    .10976296
       rf            7    .42246574    .42246574
       rf            8            0            0
       rf            9    8.541e-17    8.541e-17
gradboost           10    .03218493    .03218493
gradboost           11    .15058585    .15058585
     nnet           12    6.455e-17    6.455e-17
     nnet           13    .08952594    .08952594

      +--------------------------------------------+
      | Y_lnea~_1   Y_lne~s1   Y_lnea~2   Y_lnea~3 |
      |--------------------------------------------|
   1. | 2.5833551          1   7.16e-18   7.16e-18 |
   2. | 3.1548607          2   5.79e-18   5.79e-18 |
   3. | 2.8743987          3   1.11e-16   1.11e-16 |
   4. | 2.5119581          4   .0181236   .0181236 |
      +--------------------------------------------+
(note: file out_84685/Y_lnearn_ss_nnls1_short.dta not found)
file out_84685/Y_lnearn_ss_nnls1_short.dta saved

D_gender_r_ss[13,3]
               learner  mean_weight        rep_1
      ols            1    .17435767    .17435767
      ols            2    4.625e-17    4.625e-17
  lassocv            3    .17449656    .17449656
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7    .48194128    .48194128
       rf            8            0            0
       rf            9    1.436e-16    1.436e-16
gradboost           10    2.339e-17    2.339e-17
gradboost           11    .16920449    .16920449
     nnet           12            0            0
     nnet           13    1.611e-16    1.611e-16

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .69505729          1   .1743577   .1743577 |
   2. | .48082876          2   4.62e-17   4.62e-17 |
   3. | .15830802          3   .1744966   .1744966 |
   4. | .27620001          4          0          0 |
      +--------------------------------------------+
(note: file out_84685/D_gender_r_ss_nnls1_short.dta not found)
file out_84685/D_gender_r_ss_nnls1_short.dta saved

Y_lnearn_ps[13,3]
               learner  mean_weight        rep_1
      ols            1    .02551239    .02551239
      ols            2    2.581e-15    2.581e-15
  lassocv            3    .12989243    .12989243
  ridgecv            4     .0696449     .0696449
  lassocv            5    2.776e-15    2.776e-15
  ridgecv            6    .17401983    .17401983
       rf            7    .44622124    .44622124
       rf            8    3.119e-15    3.119e-15
       rf            9    4.191e-15    4.191e-15
gradboost           10    4.329e-16    4.329e-16
gradboost           11    .13229987    .13229987
     nnet           12    3.937e-15    3.937e-15
     nnet           13    .02240934    .02240934

      +--------------------------------------------+
      | Y_lnea~_1   Y_lne~s1   Y_lnea~2   Y_lnea~3 |
      |--------------------------------------------|
   1. | 2.5773632          1   .0255124   .0255124 |
   2. |  3.123385          2   2.58e-15   2.58e-15 |
   3. | 2.8490552          3   .1298924   .1298924 |
   4. | 2.4973276          4   .0696449   .0696449 |
      +--------------------------------------------+
(note: file out_84685/Y_lnearn_ps_nnls1_pooled.dta not found)
file out_84685/Y_lnearn_ps_nnls1_pooled.dta saved

D_gender_r_ps[13,3]
               learner  mean_weight        rep_1
      ols            1    .09694717    .09694717
      ols            2            0            0
  lassocv            3    .26783134    .26783134
  ridgecv            4    1.116e-16    1.116e-16
  lassocv            5    5.668e-16    5.668e-16
  ridgecv            6    7.229e-16    7.229e-16
       rf            7    .42807579    .42807579
       rf            8    4.624e-17    4.624e-17
       rf            9    1.501e-15    1.501e-15
gradboost           10    5.634e-16    5.634e-16
gradboost           11    .20026105    .20026105
     nnet           12    1.403e-15    1.403e-15
     nnet           13    .00688465    .00688465

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .69453671          1   .0969472   .0969472 |
   2. | .47202567          2          0          0 |
   3. | .16103867          3   .2678313   .2678313 |
   4. | .28014005          4   1.12e-16   1.12e-16 |
      +--------------------------------------------+
(note: file out_84685/D_gender_r_ps_nnls1_pooled.dta not found)
file out_84685/D_gender_r_ps_nnls1_pooled.dta saved


Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  st  1  Y1_pystacked  D1_pystacked    -0.097    (0.017)
  ss  1  [shortstack]          [ss]    -0.103    (0.016)
  ps  1   [poolstack]          [ps]    -0.103    (0.016)

Shortstack DDML model
y-E[y|X]  = y-Y_lnearn_ss_1                        Number of obs   =      4836
D-E[D|X]  = D-D_gender_r_ss_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1026586   .0164529    -6.24   0.000    -.1349056   -.0704115
       _cons |   -.002207   .0063852    -0.35   0.730    -.0147217    .0103078
------------------------------------------------------------------------------
Stacking final estimator: singlebest



Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  st  1  Y1_pystacked  D1_pystacked    -0.097    (0.017)
  ss  1  [shortstack]          [ss]    -0.103    (0.016)
  ps  1   [poolstack]          [ps]    -0.103    (0.016)

Stacking DDML model
y-E[y|X]  = y-Y1_pystacked_1                       Number of obs   =      4836
D-E[D|X]  = D-D1_pystacked_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0967005   .0165514    -5.84   0.000    -.1291406   -.0642604
       _cons |  -.0007914   .0063817    -0.12   0.901    -.0132994    .0117166
------------------------------------------------------------------------------
Stacking final estimator: singlebest

file out_84685/results.dta saved


Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  ss  1  Y1_pystacked  D1_pystacked    -0.103    (0.016)
  ss  1  [shortstack]          [ss]    -0.103    (0.016)
  ps  1   [poolstack]          [ps]    -0.103    (0.016)

Shortstack DDML model
y-E[y|X]  = y-Y_lnearn_ss_1                        Number of obs   =      4836
D-E[D|X]  = D-D_gender_r_ss_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1026586   .0164529    -6.24   0.000    -.1349056   -.0704115
       _cons |   -.002207   .0063852    -0.35   0.730    -.0147217    .0103078
------------------------------------------------------------------------------
Stacking final estimator: singlebest

file out_84685/results.dta saved


Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  ps  1  Y1_pystacked  D1_pystacked    -0.103    (0.016)
  ss  1  [shortstack]          [ss]    -0.103    (0.016)
  ps  1   [poolstack]          [ps]    -0.103    (0.016)

Poolstack DDML model
y-E[y|X]  = y-Y_lnearn_ps_1                        Number of obs   =      4836
D-E[D|X]  = D-D_gender_r_ps_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1026586   .0164529    -6.24   0.000    -.1349056   -.0704115
       _cons |   -.002207   .0063852    -0.35   0.730    -.0147217    .0103078
------------------------------------------------------------------------------
Stacking final estimator: singlebest

file out_84685/results.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: singlebest
               learner  mean_weight        rep_1
      ols            1            0            0
      ols            2            0            0
  lassocv            3           .5           .5
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7           .4           .4
       rf            8            0            0
       rf            9            0            0
gradboost           10           .1           .1
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: singlebest
               learner  mean_weight        rep_1
      ols            1            0            0
      ols            2            0            0
  lassocv            3           .1           .1
  ridgecv            4            0            0
  lassocv            5           .3           .3
  ridgecv            6           .1           .1
       rf            7           .5           .5
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: singlebest
               learner  mean_weight        rep_1
      ols            1            0            0
      ols            2            0            0
  lassocv            3           .5           .5
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7           .4           .4
       rf            8            0            0
       rf            9            0            0
gradboost           10           .1           .1
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: singlebest
               learner  mean_weight        rep_1
      ols            1            0            0
      ols            2            0            0
  lassocv            3           .1           .1
  ridgecv            4            0            0
  lassocv            5           .3           .3
  ridgecv            6           .1           .1
       rf            7           .5           .5
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

Y1_pystacked_w_mn[13,3]
               learner  mean_weight        rep_1
      ols            1            0            0
      ols            2            0            0
  lassocv            3           .1           .1
  ridgecv            4            0            0
  lassocv            5           .3           .3
  ridgecv            6           .1           .1
       rf            7           .5           .5
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

      +--------------------------------+
      | Y1_pys~1   Y1_pys~2   Y1_pys~3 |
      |--------------------------------|
   1. |        1          0          0 |
   2. |        2          0          0 |
   3. |        3         .1         .1 |
   4. |        4          0          0 |
      +--------------------------------+
(note: file out_84685/Y1_pystacked_w_mn_singlebest_regular.dta not found)
file out_84685/Y1_pystacked_w_mn_singlebest_regular.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: singlebest
               learner  mean_weight        rep_1
      ols            1            0            0
      ols            2            0            0
  lassocv            3           .5           .5
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7           .4           .4
       rf            8            0            0
       rf            9            0            0
gradboost           10           .1           .1
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: singlebest
               learner  mean_weight        rep_1
      ols            1            0            0
      ols            2            0            0
  lassocv            3           .1           .1
  ridgecv            4            0            0
  lassocv            5           .3           .3
  ridgecv            6           .1           .1
       rf            7           .5           .5
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

D1_pystacked_w_mn[13,3]
               learner  mean_weight        rep_1
      ols            1            0            0
      ols            2            0            0
  lassocv            3           .5           .5
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7           .4           .4
       rf            8            0            0
       rf            9            0            0
gradboost           10           .1           .1
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

      +--------------------------------+
      | D1_pys~1   D1_pys~2   D1_pys~3 |
      |--------------------------------|
   1. |        1          0          0 |
   2. |        2          0          0 |
   3. |        3         .5         .5 |
   4. |        4          0          0 |
      +--------------------------------+
(note: file out_84685/D1_pystacked_w_mn_singlebest_regular.dta not found)
file out_84685/D1_pystacked_w_mn_singlebest_regular.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: singlebest
               learner  mean_weight        rep_1
      ols            1            0            0
      ols            2            0            0
  lassocv            3            0            0
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            1            1
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

short-stacked weights across resamples for lnearn
final stacking estimator: singlebest
               learner  mean_weight        rep_1
      ols            1            0            0
      ols            2            0            0
  lassocv            3            0            0
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            1            1
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

Y_lnearn_ss[13,3]
               learner  mean_weight        rep_1
      ols            1            0            0
      ols            2            0            0
  lassocv            3            0            0
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            1            1
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

      +--------------------------------------------+
      | Y_lnea~_1   Y_lne~s1   Y_lnea~2   Y_lnea~3 |
      |--------------------------------------------|
   1. | 2.5403035          1          0          0 |
   2. | 3.0528536          2          0          0 |
   3. | 2.8337467          3          0          0 |
   4. | 2.5395918          4          0          0 |
      +--------------------------------------------+
(note: file out_84685/Y_lnearn_ss_singlebest_short.dta not found)
file out_84685/Y_lnearn_ss_singlebest_short.dta saved

D_gender_r_ss[13,3]
               learner  mean_weight        rep_1
      ols            1            0            0
      ols            2            0            0
  lassocv            3            0            0
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            1            1
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. |      .704          1          0          0 |
   2. | .55800003          2          0          0 |
   3. | .15800001          3          0          0 |
   4. |      .168          4          0          0 |
      +--------------------------------------------+
(note: file out_84685/D_gender_r_ss_singlebest_short.dta not found)
file out_84685/D_gender_r_ss_singlebest_short.dta saved

Y_lnearn_ps[13,3]
               learner  mean_weight        rep_1
      ols            1            0            0
      ols            2            0            0
  lassocv            3            0            0
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            1            1
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

      +--------------------------------------------+
      | Y_lnea~_1   Y_lne~s1   Y_lnea~2   Y_lnea~3 |
      |--------------------------------------------|
   1. | 2.5403035          1          0          0 |
   2. | 3.0528536          2          0          0 |
   3. | 2.8337467          3          0          0 |
   4. | 2.5395918          4          0          0 |
      +--------------------------------------------+
(note: file out_84685/Y_lnearn_ps_singlebest_pooled.dta not found)
file out_84685/Y_lnearn_ps_singlebest_pooled.dta saved

D_gender_r_ps[13,3]
               learner  mean_weight        rep_1
      ols            1            0            0
      ols            2            0            0
  lassocv            3            0            0
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            1            1
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. |      .704          1          0          0 |
   2. | .55800003          2          0          0 |
   3. | .15800001          3          0          0 |
   4. |      .168          4          0          0 |
      +--------------------------------------------+
(note: file out_84685/D_gender_r_ps_singlebest_pooled.dta not found)
file out_84685/D_gender_r_ps_singlebest_pooled.dta saved


Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  st  1  Y1_pystacked  D1_pystacked    -0.352    (0.057)
  ss  1  [shortstack]          [ss]    -0.102    (0.016)
  ps  1   [poolstack]          [ps]    -0.104    (0.017)

Shortstack DDML model
y-E[y|X]  = y-Y_lnearn_ss_1                        Number of obs   =      4836
D-E[D|X]  = D-D_gender_r_ss_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1015895   .0164704    -6.17   0.000    -.1338709    -.069308
       _cons |  -.1071937   .0067096   -15.98   0.000    -.1203443   -.0940431
------------------------------------------------------------------------------
Stacking final estimator: ols



Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  st  1  Y1_pystacked  D1_pystacked    -0.352    (0.057)
  ss  1  [shortstack]          [ss]    -0.102    (0.016)
  ps  1   [poolstack]          [ps]    -0.104    (0.017)

Stacking DDML model
y-E[y|X]  = y-Y1_pystacked_1                       Number of obs   =      4836
D-E[D|X]  = D-D1_pystacked_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |   -.351725   .0572419    -6.14   0.000    -.4639171   -.2395328
       _cons |   .8886532   .0371947    23.89   0.000      .815753    .9615534
------------------------------------------------------------------------------
Stacking final estimator: ols

(note: variable final was str3, now str10 to accommodate using data's values)
file out_84685/results.dta saved


Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  ss  1  Y1_pystacked  D1_pystacked    -0.102    (0.016)
  ss  1  [shortstack]          [ss]    -0.102    (0.016)
  ps  1   [poolstack]          [ps]    -0.104    (0.017)

Shortstack DDML model
y-E[y|X]  = y-Y_lnearn_ss_1                        Number of obs   =      4836
D-E[D|X]  = D-D_gender_r_ss_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1015895   .0164704    -6.17   0.000    -.1338709    -.069308
       _cons |  -.1071937   .0067096   -15.98   0.000    -.1203443   -.0940431
------------------------------------------------------------------------------
Stacking final estimator: ols

(note: variable final was str3, now str10 to accommodate using data's values)
file out_84685/results.dta saved


Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  ps  1  Y1_pystacked  D1_pystacked    -0.104    (0.017)
  ss  1  [shortstack]          [ss]    -0.102    (0.016)
  ps  1   [poolstack]          [ps]    -0.104    (0.017)

Poolstack DDML model
y-E[y|X]  = y-Y_lnearn_ps_1                        Number of obs   =      4836
D-E[D|X]  = D-D_gender_r_ps_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1040795   .0165868    -6.27   0.000    -.1365891   -.0715698
       _cons |  -.0818777   .0062571   -13.09   0.000    -.0941414   -.0696141
------------------------------------------------------------------------------
Stacking final estimator: ols

(note: variable final was str3, now str10 to accommodate using data's values)
file out_84685/results.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: ols
               learner  mean_weight        rep_1
      ols            1    .09474241    .09474241
      ols            2    .17570829    .17570829
  lassocv            3    .48178391    .48178391
  ridgecv            4    .13902702    .13902702
  lassocv            5    -.3037814    -.3037814
  ridgecv            6   -.09175614   -.09175614
       rf            7     .4800006     .4800006
       rf            8    .72334998    .72334998
       rf            9   -.78900813   -.78900813
gradboost           10    .08334794    .08334794
gradboost           11    .11228157    .11228157
     nnet           12   -.08127624   -.08127624
     nnet           13    .00615321    .00615321

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: ols
               learner  mean_weight        rep_1
      ols            1    .01449104    .01449104
      ols            2   -.00725602   -.00725602
  lassocv            3   -.18562213   -.18562213
  ridgecv            4    .24571017    .24571017
  lassocv            5    .12496302    .12496302
  ridgecv            6    .28896499    .28896499
       rf            7    .53454257    .53454257
       rf            8    .25822409    .25822409
       rf            9   -.42101674   -.42101674
gradboost           10    .09584357    .09584357
gradboost           11    .04823099    .04823099
     nnet           12   -.33120606   -.33120606
     nnet           13    .01117482    .01117482

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: ols
               learner  mean_weight        rep_1
      ols            1    .09474241    .09474241
      ols            2    .17570829    .17570829
  lassocv            3    .48178391    .48178391
  ridgecv            4    .13902702    .13902702
  lassocv            5    -.3037814    -.3037814
  ridgecv            6   -.09175614   -.09175614
       rf            7     .4800006     .4800006
       rf            8    .72334998    .72334998
       rf            9   -.78900813   -.78900813
gradboost           10    .08334794    .08334794
gradboost           11    .11228157    .11228157
     nnet           12   -.08127624   -.08127624
     nnet           13    .00615321    .00615321

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: ols
               learner  mean_weight        rep_1
      ols            1    .01449104    .01449104
      ols            2   -.00725602   -.00725602
  lassocv            3   -.18562213   -.18562213
  ridgecv            4    .24571017    .24571017
  lassocv            5    .12496302    .12496302
  ridgecv            6    .28896499    .28896499
       rf            7    .53454257    .53454257
       rf            8    .25822409    .25822409
       rf            9   -.42101674   -.42101674
gradboost           10    .09584357    .09584357
gradboost           11    .04823099    .04823099
     nnet           12   -.33120606   -.33120606
     nnet           13    .01117482    .01117482

Y1_pystacked_w_mn[13,3]
               learner  mean_weight        rep_1
      ols            1    .01449104    .01449104
      ols            2   -.00725602   -.00725602
  lassocv            3   -.18562213   -.18562213
  ridgecv            4    .24571017    .24571017
  lassocv            5    .12496302    .12496302
  ridgecv            6    .28896499    .28896499
       rf            7    .53454257    .53454257
       rf            8    .25822409    .25822409
       rf            9   -.42101674   -.42101674
gradboost           10    .09584357    .09584357
gradboost           11    .04823099    .04823099
     nnet           12   -.33120606   -.33120606
     nnet           13    .01117482    .01117482

      +----------------------------------+
      | Y1_pys~1   Y1_pyst~2   Y1_pyst~3 |
      |----------------------------------|
   1. |        1     .014491     .014491 |
   2. |        2    -.007256    -.007256 |
   3. |        3   -.1856221   -.1856221 |
   4. |        4    .2457102    .2457102 |
      +----------------------------------+
(note: file out_84685/Y1_pystacked_w_mn_ols_regular.dta not found)
file out_84685/Y1_pystacked_w_mn_ols_regular.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: ols
               learner  mean_weight        rep_1
      ols            1    .09474241    .09474241
      ols            2    .17570829    .17570829
  lassocv            3    .48178391    .48178391
  ridgecv            4    .13902702    .13902702
  lassocv            5    -.3037814    -.3037814
  ridgecv            6   -.09175614   -.09175614
       rf            7     .4800006     .4800006
       rf            8    .72334998    .72334998
       rf            9   -.78900813   -.78900813
gradboost           10    .08334794    .08334794
gradboost           11    .11228157    .11228157
     nnet           12   -.08127624   -.08127624
     nnet           13    .00615321    .00615321

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: ols
               learner  mean_weight        rep_1
      ols            1    .01449104    .01449104
      ols            2   -.00725602   -.00725602
  lassocv            3   -.18562213   -.18562213
  ridgecv            4    .24571017    .24571017
  lassocv            5    .12496302    .12496302
  ridgecv            6    .28896499    .28896499
       rf            7    .53454257    .53454257
       rf            8    .25822409    .25822409
       rf            9   -.42101674   -.42101674
gradboost           10    .09584357    .09584357
gradboost           11    .04823099    .04823099
     nnet           12   -.33120606   -.33120606
     nnet           13    .01117482    .01117482

D1_pystacked_w_mn[13,3]
               learner  mean_weight        rep_1
      ols            1    .09474241    .09474241
      ols            2    .17570829    .17570829
  lassocv            3    .48178391    .48178391
  ridgecv            4    .13902702    .13902702
  lassocv            5    -.3037814    -.3037814
  ridgecv            6   -.09175614   -.09175614
       rf            7     .4800006     .4800006
       rf            8    .72334998    .72334998
       rf            9   -.78900813   -.78900813
gradboost           10    .08334794    .08334794
gradboost           11    .11228157    .11228157
     nnet           12   -.08127624   -.08127624
     nnet           13    .00615321    .00615321

      +--------------------------------+
      | D1_pys~1   D1_pys~2   D1_pys~3 |
      |--------------------------------|
   1. |        1   .0947424   .0947424 |
   2. |        2   .1757083   .1757083 |
   3. |        3   .4817839   .4817839 |
   4. |        4    .139027    .139027 |
      +--------------------------------+
(note: file out_84685/D1_pystacked_w_mn_ols_regular.dta not found)
file out_84685/D1_pystacked_w_mn_ols_regular.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: ols
               learner  mean_weight        rep_1
      ols            1    .13615085    .13615085
      ols            2    .16824789    .16824789
  lassocv            3    .28235785    .28235785
  ridgecv            4    .07722023    .07722023
  lassocv            5   -.10665836   -.10665836
  ridgecv            6   -.04459129   -.04459129
       rf            7    .57967097    .57967097
       rf            8    .72390538    .72390538
       rf            9   -.89081906   -.89081906
gradboost           10    .10667335    .10667335
gradboost           11    .07103422    .07103422
     nnet           12   -.25087266   -.25087266
     nnet           13   -.01835378   -.01835378

short-stacked weights across resamples for lnearn
final stacking estimator: ols
               learner  mean_weight        rep_1
      ols            1    .01645426    .01645426
      ols            2   -.06334475   -.06334475
  lassocv            3   -.46457821   -.46457821
  ridgecv            4    .67902244    .67902244
  lassocv            5    .34287829    .34287829
  ridgecv            6   -.17947041   -.17947041
       rf            7     .5702623     .5702623
       rf            8    .31804258    .31804258
       rf            9   -.55180635   -.55180635
gradboost           10    .19554356    .19554356
gradboost           11     .0639343     .0639343
     nnet           12      .036432      .036432
     nnet           13    .07845324    .07845324

Y_lnearn_ss[13,3]
               learner  mean_weight        rep_1
      ols            1    .01645426    .01645426
      ols            2   -.06334475   -.06334475
  lassocv            3   -.46457821   -.46457821
  ridgecv            4    .67902244    .67902244
  lassocv            5    .34287829    .34287829
  ridgecv            6   -.17947041   -.17947041
       rf            7     .5702623     .5702623
       rf            8    .31804258    .31804258
       rf            9   -.55180635   -.55180635
gradboost           10    .19554356    .19554356
gradboost           11     .0639343     .0639343
     nnet           12      .036432      .036432
     nnet           13    .07845324    .07845324

      +----------------------------------------------+
      | Y_lnea~_1   Y_lne~s1   Y_lnear~2   Y_lnear~3 |
      |----------------------------------------------|
   1. | 2.6722084          1    .0164543    .0164543 |
   2. |  3.274365          2   -.0633448   -.0633448 |
   3. | 2.9760209          3   -.4645782   -.4645782 |
   4. | 2.6410122          4    .6790224    .6790224 |
      +----------------------------------------------+
(note: file out_84685/Y_lnearn_ss_ols_short.dta not found)
file out_84685/Y_lnearn_ss_ols_short.dta saved

D_gender_r_ss[13,3]
               learner  mean_weight        rep_1
      ols            1    .13615085    .13615085
      ols            2    .16824789    .16824789
  lassocv            3    .28235785    .28235785
  ridgecv            4    .07722023    .07722023
  lassocv            5   -.10665836   -.10665836
  ridgecv            6   -.04459129   -.04459129
       rf            7    .57967097    .57967097
       rf            8    .72390538    .72390538
       rf            9   -.89081906   -.89081906
gradboost           10    .10667335    .10667335
gradboost           11    .07103422    .07103422
     nnet           12   -.25087266   -.25087266
     nnet           13   -.01835378   -.01835378

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .59130535          1   .1361509   .1361509 |
   2. | .37029921          2   .1682479   .1682479 |
   3. | .01580928          3   .2823578   .2823578 |
   4. | .06227711          4   .0772202   .0772202 |
      +--------------------------------------------+
(note: file out_84685/D_gender_r_ss_ols_short.dta not found)
file out_84685/D_gender_r_ss_ols_short.dta saved

Y_lnearn_ps[13,3]
               learner  mean_weight        rep_1
      ols            1    .01082738    .01082738
      ols            2   -.00493751   -.00493751
  lassocv            3    .06122219    .06122219
  ridgecv            4     .2708981     .2708981
  lassocv            5   -.12480432   -.12480432
  ridgecv            6     .2566848     .2566848
       rf            7    .55280009    .55280009
       rf            8    .27459299    .27459299
       rf            9   -.44461626   -.44461626
gradboost           10    .09679498    .09679498
gradboost           11     .0557208     .0557208
     nnet           12    .00820105    .00820105
     nnet           13     .0115566     .0115566

      +----------------------------------------------+
      | Y_lnea~_1   Y_lne~s1   Y_lnear~2   Y_lnear~3 |
      |----------------------------------------------|
   1. | 2.6277516          1    .0108274    .0108274 |
   2. | 3.1993127          2   -.0049375   -.0049375 |
   3. | 2.9116754          3    .0612222    .0612222 |
   4. | 2.5533466          4    .2708981    .2708981 |
      +----------------------------------------------+
(note: file out_84685/Y_lnearn_ps_ols_pooled.dta not found)
file out_84685/Y_lnearn_ps_ols_pooled.dta saved

D_gender_r_ps[13,3]
               learner  mean_weight        rep_1
      ols            1    .08619301    .08619301
      ols            2    .17996676    .17996676
  lassocv            3    .30370408    .30370408
  ridgecv            4    .16241678    .16241678
  lassocv            5   -.10398052   -.10398052
  ridgecv            6   -.12062313   -.12062313
       rf            7    .48339937    .48339937
       rf            8     .7121783     .7121783
       rf            9    -.7840683    -.7840683
gradboost           10     .0746611     .0746611
gradboost           11    .11656669    .11656669
     nnet           12     .0674918     .0674918
     nnet           13    .00712692    .00712692

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .79568818          1    .086193    .086193 |
   2. | .56361804          2   .1799668   .1799668 |
   3. | .22313452          3   .3037041   .3037041 |
   4. | .28634717          4   .1624168   .1624168 |
      +--------------------------------------------+
(note: file out_84685/D_gender_r_ps_ols_pooled.dta not found)
file out_84685/D_gender_r_ps_ols_pooled.dta saved


Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  st  1  Y1_pystacked  D1_pystacked    -0.105    (0.016)
  ss  1  [shortstack]          [ss]    -0.105    (0.016)
  ps  1   [poolstack]          [ps]    -0.105    (0.016)

Shortstack DDML model
y-E[y|X]  = y-Y_lnearn_ss_1                        Number of obs   =      4836
D-E[D|X]  = D-D_gender_r_ss_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1049264   .0164368    -6.38   0.000     -.137142   -.0727109
       _cons |   .0006678   .0063577     0.11   0.916    -.0117931    .0131286
------------------------------------------------------------------------------
Stacking final estimator: avg



Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  st  1  Y1_pystacked  D1_pystacked    -0.105    (0.016)
  ss  1  [shortstack]          [ss]    -0.105    (0.016)
  ps  1   [poolstack]          [ps]    -0.105    (0.016)

Stacking DDML model
y-E[y|X]  = y-Y1_pystacked_1                       Number of obs   =      4836
D-E[D|X]  = D-D1_pystacked_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1049264   .0164368    -6.38   0.000     -.137142   -.0727109
       _cons |   .0006678   .0063577     0.11   0.916    -.0117931    .0131286
------------------------------------------------------------------------------
Stacking final estimator: avg

(note: variable final was str3, now str10 to accommodate using data's values)
file out_84685/results.dta saved


Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  ss  1  Y1_pystacked  D1_pystacked    -0.105    (0.016)
  ss  1  [shortstack]          [ss]    -0.105    (0.016)
  ps  1   [poolstack]          [ps]    -0.105    (0.016)

Shortstack DDML model
y-E[y|X]  = y-Y_lnearn_ss_1                        Number of obs   =      4836
D-E[D|X]  = D-D_gender_r_ss_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1049264   .0164368    -6.38   0.000     -.137142   -.0727109
       _cons |   .0006678   .0063577     0.11   0.916    -.0117931    .0131286
------------------------------------------------------------------------------
Stacking final estimator: avg

(note: variable final was str3, now str10 to accommodate using data's values)
file out_84685/results.dta saved


Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  ps  1  Y1_pystacked  D1_pystacked    -0.105    (0.016)
  ss  1  [shortstack]          [ss]    -0.105    (0.016)
  ps  1   [poolstack]          [ps]    -0.105    (0.016)

Poolstack DDML model
y-E[y|X]  = y-Y_lnearn_ps_1                        Number of obs   =      4836
D-E[D|X]  = D-D_gender_r_ps_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1049264   .0164368    -6.38   0.000     -.137142   -.0727109
       _cons |   .0006678   .0063577     0.11   0.916    -.0117931    .0131286
------------------------------------------------------------------------------
Stacking final estimator: avg

(note: variable final was str3, now str10 to accommodate using data's values)
file out_84685/results.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: avg
               learner  mean_weight        rep_1
      ols            1    .07692308    .07692308
      ols            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: avg
               learner  mean_weight        rep_1
      ols            1    .07692308    .07692308
      ols            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: avg
               learner  mean_weight        rep_1
      ols            1    .07692308    .07692308
      ols            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: avg
               learner  mean_weight        rep_1
      ols            1    .07692308    .07692308
      ols            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

Y1_pystacked_w_mn[13,3]
               learner  mean_weight        rep_1
      ols            1    .07692308    .07692308
      ols            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

      +--------------------------------+
      | Y1_pys~1   Y1_pys~2   Y1_pys~3 |
      |--------------------------------|
   1. |        1   .0769231   .0769231 |
   2. |        2   .0769231   .0769231 |
   3. |        3   .0769231   .0769231 |
   4. |        4   .0769231   .0769231 |
      +--------------------------------+
(note: file out_84685/Y1_pystacked_w_mn_avg_regular.dta not found)
file out_84685/Y1_pystacked_w_mn_avg_regular.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: avg
               learner  mean_weight        rep_1
      ols            1    .07692308    .07692308
      ols            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: avg
               learner  mean_weight        rep_1
      ols            1    .07692308    .07692308
      ols            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

D1_pystacked_w_mn[13,3]
               learner  mean_weight        rep_1
      ols            1    .07692308    .07692308
      ols            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

      +--------------------------------+
      | D1_pys~1   D1_pys~2   D1_pys~3 |
      |--------------------------------|
   1. |        1   .0769231   .0769231 |
   2. |        2   .0769231   .0769231 |
   3. |        3   .0769231   .0769231 |
   4. |        4   .0769231   .0769231 |
      +--------------------------------+
(note: file out_84685/D1_pystacked_w_mn_avg_regular.dta not found)
file out_84685/D1_pystacked_w_mn_avg_regular.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: avg
               learner  mean_weight        rep_1
      ols            1    .07692308    .07692308
      ols            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

short-stacked weights across resamples for lnearn
final stacking estimator: avg
               learner  mean_weight        rep_1
      ols            1    .07692308    .07692308
      ols            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

Y_lnearn_ss[13,3]
               learner  mean_weight        rep_1
      ols            1    .07692308    .07692308
      ols            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

      +--------------------------------------------+
      | Y_lnea~_1   Y_lne~s1   Y_lnea~2   Y_lnea~3 |
      |--------------------------------------------|
   1. | 2.6470462          1   .0769231   .0769231 |
   2. | 3.1621518          2   .0769231   .0769231 |
   3. | 2.8714756          3   .0769231   .0769231 |
   4. | 2.5370972          4   .0769231   .0769231 |
      +--------------------------------------------+
(note: file out_84685/Y_lnearn_ss_avg_short.dta not found)
file out_84685/Y_lnearn_ss_avg_short.dta saved

D_gender_r_ss[13,3]
               learner  mean_weight        rep_1
      ols            1    .07692308    .07692308
      ols            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .68858025          1   .0769231   .0769231 |
   2. | .42011752          2   .0769231   .0769231 |
   3. | .25147691          3   .0769231   .0769231 |
   4. |  .4040963          4   .0769231   .0769231 |
      +--------------------------------------------+
(note: file out_84685/D_gender_r_ss_avg_short.dta not found)
file out_84685/D_gender_r_ss_avg_short.dta saved

Y_lnearn_ps[13,3]
               learner  mean_weight        rep_1
      ols            1    .07692308    .07692308
      ols            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

      +--------------------------------------------+
      | Y_lnea~_1   Y_lne~s1   Y_lnea~2   Y_lnea~3 |
      |--------------------------------------------|
   1. | 2.6470462          1   .0769231   .0769231 |
   2. | 3.1621518          2   .0769231   .0769231 |
   3. | 2.8714756          3   .0769231   .0769231 |
   4. | 2.5370972          4   .0769231   .0769231 |
      +--------------------------------------------+
(note: file out_84685/Y_lnearn_ps_avg_pooled.dta not found)
file out_84685/Y_lnearn_ps_avg_pooled.dta saved

D_gender_r_ps[13,3]
               learner  mean_weight        rep_1
      ols            1    .07692308    .07692308
      ols            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .68858025          1   .0769231   .0769231 |
   2. | .42011752          2   .0769231   .0769231 |
   3. | .25147691          3   .0769231   .0769231 |
   4. |  .4040963          4   .0769231   .0769231 |
      +--------------------------------------------+
(note: file out_84685/D_gender_r_ps_avg_pooled.dta not found)
file out_84685/D_gender_r_ps_avg_pooled.dta saved
. 
.         forvalues i = 1(1)$L {
  2.                         ddml estimate, y(Y1_pystacked_L`i'_1) ///
>                                                         d(D1_pystacked_L`i'_1
> ) robust
  3.                         regsave gender_r using `folder'/results.dta, ci //
> /
>                                                 addlabel(model,partial,seed,`
> seed',final,indiv,learner,`i') ///
>                                                 append
  4.         }

y-E[y|X]  = Y1_pystacked_L1_1                      Number of obs   =      4836
D-E[D|X]  = D1_pystacked_L1_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0993623   .0165003    -6.02   0.000    -.1317024   -.0670223
       _cons |  -.0012214   .0066427    -0.18   0.854    -.0142407     .011798
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_84685/results.dta saved

y-E[y|X]  = Y1_pystacked_L2_1                      Number of obs   =      4836
D-E[D|X]  = D1_pystacked_L2_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1219339   .0154458    -7.89   0.000    -.1522071   -.0916606
       _cons |  -.0003479   .0068675    -0.05   0.960    -.0138079    .0131121
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_84685/results.dta saved

y-E[y|X]  = Y1_pystacked_L3_1                      Number of obs   =      4836
D-E[D|X]  = D1_pystacked_L3_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0997062   .0166244    -6.00   0.000    -.1322894    -.067123
       _cons |  -.0012593   .0064019    -0.20   0.844    -.0138067    .0112881
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_84685/results.dta saved

y-E[y|X]  = Y1_pystacked_L4_1                      Number of obs   =      4836
D-E[D|X]  = D1_pystacked_L4_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0991393   .0164836    -6.01   0.000    -.1314466    -.066832
       _cons |  -.0006691   .0064184    -0.10   0.917    -.0132488    .0119107
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_84685/results.dta saved

y-E[y|X]  = Y1_pystacked_L5_1                      Number of obs   =      4836
D-E[D|X]  = D1_pystacked_L5_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0988568   .0166256    -5.95   0.000    -.1314423   -.0662713
       _cons |  -.0027873   .0064129    -0.43   0.664    -.0153564    .0097817
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_84685/results.dta saved

y-E[y|X]  = Y1_pystacked_L6_1                      Number of obs   =      4836
D-E[D|X]  = D1_pystacked_L6_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1036795   .0165199    -6.28   0.000     -.136058    -.071301
       _cons |  -.0017295   .0064251    -0.27   0.788    -.0143225    .0108635
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_84685/results.dta saved

y-E[y|X]  = Y1_pystacked_L7_1                      Number of obs   =      4836
D-E[D|X]  = D1_pystacked_L7_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1026586   .0164529    -6.24   0.000    -.1349056   -.0704115
       _cons |   -.002207   .0063852    -0.35   0.730    -.0147217    .0103078
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_84685/results.dta saved

y-E[y|X]  = Y1_pystacked_L8_1                      Number of obs   =      4836
D-E[D|X]  = D1_pystacked_L8_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1118363    .016877    -6.63   0.000    -.1449146   -.0787579
       _cons |  -.0001056   .0066254    -0.02   0.987    -.0130912      .01288
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_84685/results.dta saved

y-E[y|X]  = Y1_pystacked_L9_1                      Number of obs   =      4836
D-E[D|X]  = D1_pystacked_L9_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1135533   .0167296    -6.79   0.000    -.1463428   -.0807639
       _cons |  -.0001724   .0067538    -0.03   0.980    -.0134096    .0130649
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_84685/results.dta saved

y-E[y|X]  = Y1_pystacked_L10_1                     Number of obs   =      4836
D-E[D|X]  = D1_pystacked_L10_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0888574   .0168181    -5.28   0.000    -.1218203   -.0558945
       _cons |  -.0003624   .0064298    -0.06   0.955    -.0129647    .0122398
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_84685/results.dta saved

y-E[y|X]  = Y1_pystacked_L11_1                     Number of obs   =      4836
D-E[D|X]  = D1_pystacked_L11_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0839823   .0162978    -5.15   0.000    -.1159254   -.0520393
       _cons |  -.0040333    .006564    -0.61   0.539    -.0168984    .0088319
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_84685/results.dta saved

y-E[y|X]  = Y1_pystacked_L12_1                     Number of obs   =      4836
D-E[D|X]  = D1_pystacked_L12_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |   -.111039   .0155231    -7.15   0.000    -.1414637   -.0806143
       _cons |    .007457   .0075489     0.99   0.323    -.0073386    .0222527
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_84685/results.dta saved

y-E[y|X]  = Y1_pystacked_L13_1                     Number of obs   =      4836
D-E[D|X]  = D1_pystacked_L13_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0568559   .0167565    -3.39   0.001    -.0896982   -.0240137
       _cons |   .0151238   .0076375     1.98   0.048     .0001545    .0300931
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_84685/results.dta saved
. 
. }

.         
. *****************************************************************************
> *  
. *** interactive: estimation                                                  
>                                       ***
. *****************************************************************************
> *
.         
. if (`estimator'==2) {   
. 
.         ddml init interactive, kfolds($K) reps($R)
.         ddml E[Y|X,D]: pystacked lnearn $X_expanded $pystring_reg
.         ddml E[D|X]: pystacked gender_r $X_expanded $pystring_class
.         ddml crossfit, shortstack poolstack
.         ddml estimate, robust atet
. 
.         cap drop mse_*
.         foreach var of varlist Y1_pystacked0* {
  2.                  cap drop sqerr_`var'
  3.                  gen double sqerr_`var'=(lnearn-`var')^2 if gender_r==0
  4.                  sum sqerr_`var' if gender_r==0, meanonly
  5.                  gen double mse_`var'=r(mean) if _n ==1 
  6.         }
.         foreach var of varlist Y1_pystacked1* {
  2.                  cap drop sqerr_`var'
  3.                  gen double sqerr_`var'=(lnearn-`var')^2 if gender_r==1
  4.                  sum sqerr_`var' if gender_r==1, meanonly
  5.                  gen double mse_`var'=r(mean) if _n ==1 
  6.         }
.         foreach var of varlist D1_* {
  2.                  cap drop sqerr_`var'
  3.                  gen double sqerr_`var'=(gender_r-`var')^2
  4.                  sum sqerr_`var', meanonly
  5.                  gen double mse_`var'=r(mean) if _n ==1 
  6.         }
.         preserve
.                 keep mse_*
.                 keep if _n==1
.                 save `folder'/inter_mse, replace
.         restore
.         cap drop mse_*
.         
.         local mat gender_r_mse
.                         ddml extract, show(mse)
.                         mat `mat' = r(`mat')
.                         mat list `mat'
.                                 preserve
.                                 svmat `mat'
.                                 keep `mat'*
.                                 keep if _n<=$L
.                                 gen stack_type = "conventional" if _n==1
.                                 replace stack_type = "pooled" if _n==2
.                                 replace stack_type = "short" if _n==3
.                                 gen model = "interactive"
.                                 list if _n<=$L
.                                 save `folder'/`mat'_inter_gender_mse, replace
.                                 restore 
.                                 
.         local mat lnearn_mse
.                         ddml extract, show(mse)
.                         mat `mat' = r(`mat')
.                         mat list `mat'
.                                 preserve
.                                 svmat `mat'
.                                 keep `mat'*
.                                 keep if _n<=(2*$L)
.                                 gen stack_type = "conventional" if _n<=2
.                                 replace stack_type = "pooled" if _n>=3 & _n<=
> 4
.                                 replace stack_type = "short" if _n>4
.                                 gen model = "interactive"
.                                 list if _n<=(2*$L)
.                                 save `folder'/`mat'_inter_lnearn_mse, replace
.                                 restore 
.         
.         foreach final in nnls1 singlebest ols avg {
  2. 
.                 ddml estimate, robust finalest(`final') atet
  3.         
.                         // regular stacking results
.                         ddml estimate, mname(m0) spec(st) replay atet
  4.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,interactive,seed,`seed',final,`final',learner,-1) append
  5.                         
.                         // shortstacking results
.                         ddml estimate, mname(m0) spec(ss) replay atet
  6.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,interactive,seed,`seed',final,`final',learner,-2) append
  7.                         
.                         // poolstacking results
.                         ddml estimate, mname(m0) spec(ps) replay atet
  8.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,interactive,seed,`seed',final,`final',learner,-3) append
  9.                 
.                         // pystacked weights
.                         ddml extract, show(stweights)
 10.                         foreach mat in Y1_pystacked_w_mn D1_pystacked_w_mn
>  {
 11.                                         ddml extract, show(stweights)
 12.                                         mat `mat' = r(`mat')
 13.                                         mat list `mat'
 14.                                                 preserve
 15.                                                 svmat `mat'
 16.                                                 keep `mat'*
 17.                                                 list if _n<=8
 18.                                                 save `folder'/`mat'_`final
> '_regular_ia, replace
 19.                                                 restore
 20.                         }       
 21.                         // shortstacked weights
.                         ddml extract, show(ssweights)
 22.                         foreach mat in Y_lnearn_ss D_gender_r_ss {
 23.                                         ddml extract, show(ssweights)
 24.                                         mat `mat' = r(`mat')
 25.                                         mat list `mat'
 26.                                                 preserve
 27.                                                 svmat `mat'
 28.                                                 keep `mat'*
 29.                                                 list if _n<=8
 30.                                                 save `folder'/`mat'_`final
> '_short_ia, replace
 31.                                                 restore
 32.                         }       
 33.                         // poolstacked weights
.                         ddml extract, show(psweights)
 34.                         foreach mat in Y_lnearn_ps D_gender_r_ps {
 35.                                         ddml extract, show(psweights)
 36.                                         mat `mat' = r(`mat')
 37.                                         mat list `mat'
 38.                                                 preserve
 39.                                                 svmat `mat'
 40.                                                 keep `mat'*
 41.                                                 list if _n<=8
 42.                                                 save `folder'/`mat'_`final
> '_pooled_ia, replace
 43.                                                 restore
 44.                         }       
 45.         
.         }
. 
.         forvalues i = 1(1)$L {
  2.                         ddml estimate, y1(Y1_pystacked1_L`i'_1) y0(Y1_pyst
> acked0_L`i'_1) ///
>                                                         d(D1_pystacked_L`i'_1
> ) robust atet foldvar(m0_sample_1  )
  3.                         regsave gender_r using `folder'/results.dta, ci //
> /
>                                                 addlabel(model,interactive,se
> ed,`seed',final,indiv,learner,`i') ///
>                                                 append
  4.         }
. 
. }       

.         
. *****************************************************************************
> *  
. *** interactive NX: short-stacking                                           
>                                       ***
. *****************************************************************************
> *
. 
. if (`estimator'==3) {
. 
. gen one = 1     
. 
.         cap drop y0base*
.         cap drop dbase*
.         cap drop y1base*
. 
.         *** no cross-fitting
.         pystacked lnearn $X_expanded   $pystring_reg0  if gender_r == 0, type
> (reg) njobs($cores)  
.                 mat nxw_ia_y0 = e(weights)
.                 mat list nxw_ia_y0
.                                 preserve
.                                 svmat nxw_ia_y0
.                                 keep nxw_ia_y0*
.                                 save `folder'/nxw_ia_y0, replace
.                                 restore
.         predict y0base0, xb
.         predict y0base, base
. 
.         pystacked lnearn $X_expanded  $pystring_reg0 if gender_r == 1  , type
> (reg) njobs($cores)  
.                 mat nxw_ia_y1 = e(weights)
.                 mat list nxw_ia_y1
.                                 preserve
.                                 svmat nxw_ia_y1
.                                 keep nxw_ia_y1*
.                                 save `folder'/nxw_ia_y1, replace
.                                 restore
.         predict y1base0, xb
.         predict y1base, base
. 
.         pystacked gender_r $X_expanded $pystring_class  
.                 mat nxw_ia_d = e(weights)
.                 mat list nxw_ia_d
.                                 preserve
.                                 svmat nxw_ia_d
.                                 keep nxw_ia_d*
.                                 save `folder'/nxw_ia_d, replace
.                                 restore         
.         predict dbase0, pr
.         predict dbase, base pr
.         
.         forvalues i = 0(1)$L {
  2.                         _estimate_ate interactive, yname(lnearn) dname(gen
> der_r) ///
>                                                 y0(y0base`i') y1(y1base`i') d
> (dbase`i') ///
>                                                 atet foldid(one) robust model
> (interactive)
  3.                         regsave gender_r using `folder'/results.dta, ///
>                                                 ci addlabel(model,nxinter,see
> d,`seed',final,nx,learner,`i') append
  4.         }
.                 
. }

.         
. *****************************************************************************
> *  
. *** partial NX: short-stacking                                               
>                                       ***
. *****************************************************************************
> *
. 
. if (`estimator'==4) {
.         
. cap gen one = 1 
. 
.         cap drop Ybase* 
.         cap drop Dbase*
. 
.         *** no cross-fitting
.         pystacked lnearn $X_expanded $pystring_reg 
.                 mat nxw_y = e(weights)
.                 mat list nxw_y
.                                 preserve
.                                 svmat nxw_y
.                                 keep nxw_y*
.                                 save `folder'/nxw_y, replace
.                                 restore
.         predict Ybase0
.         predict Ybase, basexb
. 
.         pystacked gender_r $X_expanded $pystring_reg 
.                 mat nxw_d = e(weights)
.                 mat list nxw_d
.                                 preserve
.                                 svmat nxw_d
.                                 keep nxw_d*
.                                 save `folder'/nxw_d, replace
.                                 restore         
.         predict Dbase0
.         predict Dbase, basexb
. 
.         forvalues i = 0(1)$L {
  2.                 cap drop Ytil
  3.                 cap drop Dtil
  4.                 gen Ytil = lnearn - Ybase`i'
  5.                 gen Dtil = gender_r - Dbase`i'
  6.                 reg Ytil Dtil, robust
  7.                 regsave Dtil using `folder'/results.dta, ///
>                         ci addlabel(model,nxpartial,seed,`seed',final,nx,lear
> ner,`i') append
  8.         }
. 
. }

.         
. cap log close
