-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /cluster/home/kahrens/ddml_applied/GWG/Output/GWG_923_1.txt
  log type:  text
 opened on:  10 Dec 2023, 19:14:52

. 
. which ddml
/cluster/home/kahrens/ado/plus/d/ddml.ado
*! ddml v1.4.3
*! last edited: 17aug2023
*! authors: aa/ms

. which pystacked
/cluster/home/kahrens/ado/plus/p/pystacked.ado
*! pystacked v0.7.5
*! last edited: 7aug2023
*! authors: aa/ms

. 
. set seed `seed'

. local folder out_`seed'

. 
. use "../Data/gender_gap_ML_processed", clear

. 
. cap mkdir `folder'

. 
. *****************************************************************************
> ***
. ***  controls
. *****************************************************************************
> ***
. 
. // create squared age and tenure here
. gen age_r2 = age_r^2

. gen tenure2 = tenure^2
(2 missing values generated)

. 
. // no base categories
. global continuous                                                            
>                                                            ///
>         age_r                                                                
>                                                                    /// no mis
> sing
>         yrsqual         /* years of education (derived) */                   
>                                    /// 355 missing
>         /// leavedu             /* age when left education (derived) */      
>                            /// 1,081 missing
>         pvlit1          /* literacy score: plausible value 1 (also 2-10 avail
> ) */       /// no missing
>         pvnum1          /* numeracy score: plausible value 1 (also 2-10 avail
> ) */       /// no missing
>         tenure          /* tenure = years in work for current employer */    
>                    /// 2 missing
>                                                                              
>                                                                            //

. // add second order terms here
. global continuous $continuous age_r2 tenure2

. 
. global discrete0                                                             
>                                                            ///             
>         b_q01a          /* education, highest level attained */              
>                            /// no missing
>         b_q01b          /* area of study */                                  
>                                                    /// 434 missing
>         d_q06c          /* part of a larger organization */                  
>                                    /// 13 missing
>         d_q08a          /* management position */                            
>                                            /// no missing
>         d_q09           /* type of contract */                               
>                                            /// 12 missing
>         d_q10_t1        /* hours per week at this job or business */         
>                    /// 1 missing
>         d_q14           /* job satisfaction */                               
>                                            /// 1 missing
>         i_q08           /* health status */                                  
>                                                    /// 2 missing
>         j_q02a          /* living with a partner */                          
>                                            /// 899 missing
>         j_q03d1_c       /* age of youngest child */                          
>                                            /// 2,718 missing
>         j_q04c1_c       /* immigration: age */                               
>                                            /// 4,375 missing
>         j_q06b          /* mother's highest level of educ */                 
>                            /// 445 missing
>         j_q07b          /* father's highest level of educ */                 
>                            /// 515 missing
>         j_q03b          /* number of children*/                              
>                                            /// 1,856 missing
>         impar           /* immigration: parents */                           
>                                            /// 21 missing
>         imgen           /* immigration: generation */                        
>                                    /// 344 missing
>         nfe12jr         /* informal job-related educ in prev 12 months */    
>                    /// 116 missing
>         nfe12njr        /* informal non-job-related educ in prev 12 months */
>            /// 116 missing
>                                                                              
>                                                                            //
>                                                                              
>                                                          

. global personality                                                           
>                                                            ///
>         i_q04b          /* Learning strategies, Relate new ideas into real li
> fe */      /// 16 missing
>         i_q04d          /* Learning strategies, Like learning new things */  
>                    /// no missing
>         i_q04h          /* Learning strategies, Attribute something new */   
>                    /// 10 missing
>         i_q04j          /* Learning strategies, Deal with difficult things */
>            /// no missing
>         i_q04l          /* Learning strategies, Fit different ideas together 
> */         /// 5 missing
>         i_q04m          /* Learning strategies, Looking for additional info *
> /          /// 1 missing
>         i_q05f          /* Cultural engagement, Voluntary non-profit work */ 
>            /// no missing
>         i_q06a          /* Political efficacy, No influence on the government
>  */        /// 14 missing
>         i_q07a          /* Social trust, Trust only few people */            
>                            /// 4 missing
>         i_q07b          /* Social trust, Other people take advantage of you *
> /          /// 6 missing
>                                                                              
>                                                                            //

. global discrete $discrete0                                                   
>                                                    ///
>         new_reg_tl2     /* geographical region */                            
>                                            /// 2 missing
>         new_isco1c      /* occupation */                                     
>                                                    /// no missing
>         new_isic1c      /* industry */                                       
>                                                    // no missing

. 
. global X_simple                                                         ///
>         i.(b_q01a d_q10_t1 j_q03b)                              ///
>         c.($continuous)

. 
. global X_fullinteracted                                         ///
>         i.($discrete0 )                                                 ///
>         i.new_isco1c#i.new_isic1c#i.new_reg_tl2 ///
>         c.($continuous)                  

.         
. global X_cont                                                           ///
>         c.($continuous)##i.($discrete)

. 
. global X_expanded                                                       ///
>         i.($discrete)                                                   ///
>         c.($continuous)                                                 ///
>         c.age_r#i.($discrete)                                   ///
>         c.tenure#i.($discrete)

. 
.         
. 
. *****************************************************************************
> ***
. ***  estimation sample
. *****************************************************************************
> ***
. 
. gen byte touse=1

. markout touse lnearn $X_expanded

. keep if touse
(53 observations deleted)

. 
. 
. *****************************************************************************
> ***
. ***  learners
. *****************************************************************************
> ***
. 
. global cores = 5

. 
. global rf1 min_samples_leaf(1)  max_features(sqrt) n_estimators(500)

. global rf2 min_samples_leaf(50)  max_features(sqrt) n_estimators(500)

. global rf3 min_samples_leaf(100)  max_features(sqrt) n_estimators(500)

. global grad1 n_estimators(500) n_iter_no_change(10)  

. global grad2 n_estimators(500)  

. global nnet1 hidden_layer_sizes(40 20 1 20 50) early_stopping 

. global nnet2 hidden_layer_sizes(30 30 30) early_stopping  

. 
. global pystring_reg0                                                         
>    || ///
>                                         m(ols)                               
>                            || ///
>                                         m(ols) xvars($X_simple)              
>            || ///
>                                         m(lassocv)                           
>                            || ///
>                                         m(ridgecv)                           
>                            || ///
>                                         m(lassocv)      xvars($X_cont)       
>            || ///
>                                         m(ridgecv)      xvars($X_cont)       
>            || ///
>                                         m(rf) opt($rf1)                      
>                    || ///
>                                         m(rf) opt($rf2)                      
>                    || ///
>                                         m(rf) opt($rf3)                      
>                    || ///
>                                         m(gradboost) opt($grad1)             
>            || ///
>                                         m(gradboost) opt($grad2)             
>            || ///
>                                         m(nnet) opt($nnet1)                  
>            || ///
>                                         m(nnet) opt($nnet2)                  
>            || //

. 
. global pystring_reg  $pystring_reg0 , type(reg) njobs($cores) 

.  
. global pystring_class0                                                       
>            || ///
>                                         m(logit)                             
>                            || ///
>                                         m(logit) xvars($X_simple)            
>            || ///
>                                         m(lassocv)                           
>                            || ///
>                                         m(ridgecv)                           
>                            || ///
>                                         m(lassocv)      xvars($X_cont)       
>            || ///
>                                         m(ridgecv)      xvars($X_cont)       
>            || ///
>                                         m(rf) opt($rf1)                      
>                    || ///
>                                         m(rf) opt($rf2)                      
>                    || ///
>                                         m(rf) opt($rf3)                      
>                    || ///
>                                         m(gradboost) opt($grad1)             
>            || ///
>                                         m(gradboost) opt($grad2)             
>            || ///
>                                         m(nnet) opt($nnet1)                  
>            || ///
>                                         m(nnet) opt($nnet2)                  
>            || //                   

.                                 
. global pystring_class $pystring_class0 , type(class) njobs($cores)

.                                         
. global R =1  

. global K=10 

. global L =13

.         
. *****************************************************************************
> *  
. *** ddml: estimation                                                         
>                                               ***
. *****************************************************************************
> *
. 
. if (`estimator'==1) {
. 
.         ddml init partial,  reps($R) kfolds($K)
.         ddml E[Y|X]: pystacked lnearn $X_expanded $pystring_reg
Learner Y1_pystacked added successfully.
.         ddml E[D|X]: pystacked gender_r $X_expanded $pystring_reg
Learner D1_pystacked added successfully.
.         ddml crossfit, shortstack poolstack
Cross-fitting E[y|X] equation: lnearn
Cross-fitting fold 1 2 3 4 5 6 7 8 9 10 ...completed cross-fitting...completed 
> short-stacking...completed pooled-stacking
Cross-fitting E[D|X] equation: gender_r
Cross-fitting fold 1 2 3 4 5 6 7 8 9 10 ...completed cross-fitting...completed 
> short-stacking...completed pooled-stacking
.         ddml estimate, robust


Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  st  1  Y1_pystacked  D1_pystacked    -0.102    (0.017)
  ss  1  [shortstack]          [ss]    -0.101    (0.017)
  ps  1   [poolstack]          [ps]    -0.101    (0.016)

Shortstack DDML model
y-E[y|X]  = y-Y_lnearn_ss_1                        Number of obs   =      4836
D-E[D|X]  = D-D_gender_r_ss_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1014066   .0165956    -6.11   0.000    -.1339333   -.0688798
       _cons |   -.003144   .0062874    -0.50   0.617    -.0154671     .009179
------------------------------------------------------------------------------
Stacking final estimator: nnls1

.         
.         foreach mat in lnearn_mse gender_r_mse {
  2.                         ddml extract, show(mse)
  3.                         mat `mat' = r(`mat')
  4.                         mat list `mat'
  5.                                 preserve
  6.                                 svmat `mat'
  7.                                 keep `mat'*
  8.                                 keep if _n<=$L
  9.                                 gen stack_type = "conventional" if _n==1
 10.                                 replace stack_type = "pooled" if _n==2
 11.                                 replace stack_type = "short" if _n==3
 12.                                 gen model = "plm"
 13.                                 list if _n<=$L
 14.                                 save `folder'/`mat'_plm_mse, replace
 15.                                 restore 
 16.         }       

MSEs for gender_r:
                 rep   full smp      fold 1      fold 2      fold 3      fold 4
>       fold 5      fold 6      fold 7      fold 8      fold 9     fold 10 
    D1_pystacked   1      0.157       0.152       0.157       0.156       0.142
>        0.151       0.166       0.149       0.161       0.169       0.166  
   D_gender_r_ps   1      0.157       0.152       0.157       0.156       0.141
>        0.151       0.166       0.149       0.161       0.168       0.165  
   D_gender_r_ss   1      0.156       0.153       0.156       0.154       0.140
>        0.151       0.165       0.149       0.161       0.168       0.165  

MSEs for lnearn:
                 rep   full smp      fold 1      fold 2      fold 3      fold 4
>       fold 5      fold 6      fold 7      fold 8      fold 9     fold 10 
    Y1_pystacked   1      0.193       0.142       0.203       0.318       0.133
>        0.196       0.200       0.141       0.208       0.183       0.208  
     Y_lnearn_ps   1      0.193       0.143       0.202       0.318       0.133
>        0.195       0.202       0.141       0.207       0.183       0.206  
     Y_lnearn_ss   1      0.193       0.142       0.202       0.318       0.132
>        0.195       0.202       0.142       0.206       0.182       0.203  

lnearn_mse[3,12]
                      rep  full_sample        fold1        fold2        fold3
Y1_pystacked            1    .19321593    .14231236    .20300903    .31763664
 Y_lnearn_ps            1    .19281052    .14284367    .20169313    .31750243
 Y_lnearn_ss            1    .19250008    .14225214    .20184721    .31768763

                    fold4        fold5        fold6        fold7        fold8
Y1_pystacked    .13302924    .19608527     .2004567    .14116612    .20765188
 Y_lnearn_ps     .1326334    .19488385    .20197339    .14093347    .20723617
 Y_lnearn_ss    .13204488    .19493978    .20239278    .14238751    .20625999

                    fold9       fold10
Y1_pystacked    .18267197    .20833681
 Y_lnearn_ps    .18289414    .20571469
 Y_lnearn_ss    .18194998    .20344262
(4,823 observations deleted)
(12 missing values generated)
(1 real change made)
(1 real change made)

     +-----------------------------------------------------------------+
  1. | lnear~e1 | lnear~e2 | lnearn~3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        1 | .1932159 | .1423124 |  .203009 | .3176366 | .1330292 |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     | .1960853 | .2004567 | .1411661 | .2076519 |  .182672 | .2083368 |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |           conventional            |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  2. | lnear~e1 | lnear~e2 | lnearn~3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        1 | .1928105 | .1428437 | .2016931 | .3175024 | .1326334 |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     | .1948839 | .2019734 | .1409335 | .2072362 | .1828941 | .2057147 |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                 pooled            |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  3. | lnear~e1 | lnear~e2 | lnearn~3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        1 | .1925001 | .1422521 | .2018472 | .3176876 | .1320449 |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     | .1949398 | .2023928 | .1423875 |   .20626 |   .18195 | .2034426 |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                  short            |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  4. | lnear~e1 | lnear~e2 | lnearn~3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  5. | lnear~e1 | lnear~e2 | lnearn~3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  6. | lnear~e1 | lnear~e2 | lnearn~3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  7. | lnear~e1 | lnear~e2 | lnearn~3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  8. | lnear~e1 | lnear~e2 | lnearn~3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  9. | lnear~e1 | lnear~e2 | lnearn~3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 10. | lnear~e1 | lnear~e2 | lnearn~3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 11. | lnear~e1 | lnear~e2 | lnearn~3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 12. | lnear~e1 | lnear~e2 | lnearn~3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 13. | lnear~e1 | lnear~e2 | lnearn~3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+
(note: file out_923/lnearn_mse_plm_mse.dta not found)
file out_923/lnearn_mse_plm_mse.dta saved

MSEs for gender_r:
                 rep   full smp      fold 1      fold 2      fold 3      fold 4
>       fold 5      fold 6      fold 7      fold 8      fold 9     fold 10 
    D1_pystacked   1      0.157       0.152       0.157       0.156       0.142
>        0.151       0.166       0.149       0.161       0.169       0.166  
   D_gender_r_ps   1      0.157       0.152       0.157       0.156       0.141
>        0.151       0.166       0.149       0.161       0.168       0.165  
   D_gender_r_ss   1      0.156       0.153       0.156       0.154       0.140
>        0.151       0.165       0.149       0.161       0.168       0.165  

MSEs for lnearn:
                 rep   full smp      fold 1      fold 2      fold 3      fold 4
>       fold 5      fold 6      fold 7      fold 8      fold 9     fold 10 
    Y1_pystacked   1      0.193       0.142       0.203       0.318       0.133
>        0.196       0.200       0.141       0.208       0.183       0.208  
     Y_lnearn_ps   1      0.193       0.143       0.202       0.318       0.133
>        0.195       0.202       0.141       0.207       0.183       0.206  
     Y_lnearn_ss   1      0.193       0.142       0.202       0.318       0.132
>        0.195       0.202       0.142       0.206       0.182       0.203  

gender_r_mse[3,12]
                      rep  full_sample        fold1        fold2        fold3
D1_pystacked            1    .15696121    .15237545    .15716108    .15598462
D_gender_r~s            1    .15674921     .1522979    .15733417    .15578621
D_gender_r~s            1     .1563288     .1532254    .15573812    .15442835

                    fold4        fold5        fold6        fold7        fold8
D1_pystacked     .1416327    .15148507    .16626537    .14918471    .16094102
D_gender_r~s    .14144759    .15096626    .16641304    .14891293    .16093207
D_gender_r~s    .14033159     .1513689    .16484936    .14936029    .16101725

                    fold9       fold10
D1_pystacked    .16898956    .16560844
D_gender_r~s    .16807386    .16534552
D_gender_r~s    .16751398    .16547173
(4,823 observations deleted)
(12 missing values generated)
(1 real change made)
(1 real change made)

     +-----------------------------------------------------------------+
  1. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        1 | .1569612 | .1523754 | .1571611 | .1559846 | .1416327 |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     | .1514851 | .1662654 | .1491847 |  .160941 | .1689896 | .1656085 |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |           conventional            |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  2. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        1 | .1567492 | .1522979 | .1573342 | .1557862 | .1414476 |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     | .1509663 |  .166413 | .1489129 | .1609321 | .1680739 | .1653455 |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                 pooled            |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  3. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        1 | .1563288 | .1532254 | .1557381 | .1544283 | .1403316 |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     | .1513689 | .1648494 | .1493603 | .1610173 |  .167514 | .1654717 |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                  short            |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  4. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  5. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  6. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  7. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  8. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  9. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 10. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 11. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 12. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 13. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+
(note: file out_923/gender_r_mse_plm_mse.dta not found)
file out_923/gender_r_mse_plm_mse.dta saved
. 
.         cap drop mse_*
.         foreach var of varlist Y1_* {
  2.                  cap drop sqerr_`var'
  3.                  gen double sqerr_`var'=(lnearn-`var')^2
  4.                  sum sqerr_`var', meanonly
  5.                  gen double mse_`var'=r(mean) if _n ==1 
  6.         }
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
.         foreach var of varlist D1_* {
  2.                  cap drop sqerr_`var'
  3.                  gen double sqerr_`var'=(gender_r-`var')^2
  4.                  sum sqerr_`var', meanonly
  5.                  gen double mse_`var'=r(mean) if _n ==1 
  6.         }
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
.         preserve
.                 keep mse_*
.                 keep if _n==1
(4,835 observations deleted)
.                 save `folder'/plm_mse, replace
(note: file out_923/plm_mse.dta not found)
file out_923/plm_mse.dta saved
.         restore
.         cap drop mse_*
. 
.         ** initialize results file
.         regsave gender_r using `folder'/results.dta, ci addlabel(model,partia
> l,seed,`seed',final,init,learner,-99) replace
(note: file out_923/results.dta not found)
file out_923/results.dta saved
. 
.         foreach final in nnls1 singlebest ols avg {
  2. 
.                 ddml estimate, robust finalest(`final')
  3.         
.                         // regular stacking results
.                         ddml estimate, mname(m0) spec(st) replay  
  4.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,partial,seed,`seed',final,`final',learner,-1) append
  5.                         
.                         // shortstacking results
.                         ddml estimate, mname(m0) spec(ss) replay 
  6.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,partial,seed,`seed',final,`final',learner,-2) append
  7.                         
.                         // poolstacking results
.                         ddml estimate, mname(m0) spec(ps) replay  
  8.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,partial,seed,`seed',final,`final',learner,-3) append     
  9.                 
.                         // pystacked weights
.                         ddml extract, show(stweights)   
 10.                         foreach mat in Y1_pystacked_w_mn D1_pystacked_w_mn
>  {
 11.                                         ddml extract, show(stweights)   
 12.                                         mat `mat' = r(`mat')
 13.                                         mat list `mat'
 14.                                                 preserve
 15.                                                 svmat `mat'
 16.                                                 keep `mat'*
 17.                                                 list if _n<=4
 18.                                                 save `folder'/`mat'_`final
> '_regular, replace
 19.                                                 restore
 20.                         }       
 21.                         // shortstacked weights
.                         ddml extract, show(ssweights)
 22.                         foreach mat in Y_lnearn_ss D_gender_r_ss {
 23.                                         qui ddml extract, show(ssweights)
 24.                                         mat `mat' = r(`mat')
 25.                                         mat list `mat'
 26.                                                 preserve
 27.                                                 svmat `mat'
 28.                                                 keep `mat'*
 29.                                                 list if _n<=4
 30.                                                 save `folder'/`mat'_`final
> '_short, replace
 31.                                                 restore
 32.                         }       
 33.                         // poolstacked weights
. 
.                         foreach mat in Y_lnearn_ps D_gender_r_ps {
 34.                                         qui ddml extract, show(psweights)
 35.                                         mat `mat' = r(`mat')
 36.                                         mat list `mat'
 37.                                                 preserve
 38.                                                 svmat `mat'
 39.                                                 keep `mat'*
 40.                                                 list if _n<=4
 41.                                                 save `folder'/`mat'_`final
> '_pooled, replace
 42.                                                 restore
 43.                         }       
 44.         
.         }


Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  st  1  Y1_pystacked  D1_pystacked    -0.102    (0.017)
  ss  1  [shortstack]          [ss]    -0.101    (0.017)
  ps  1   [poolstack]          [ps]    -0.101    (0.016)

Shortstack DDML model
y-E[y|X]  = y-Y_lnearn_ss_1                        Number of obs   =      4836
D-E[D|X]  = D-D_gender_r_ss_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1014066   .0165956    -6.11   0.000    -.1339333   -.0688798
       _cons |   -.003144   .0062874    -0.50   0.617    -.0154671     .009179
------------------------------------------------------------------------------
Stacking final estimator: nnls1



Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  st  1  Y1_pystacked  D1_pystacked    -0.102    (0.017)
  ss  1  [shortstack]          [ss]    -0.101    (0.017)
  ps  1   [poolstack]          [ps]    -0.101    (0.016)

Stacking DDML model
y-E[y|X]  = y-Y1_pystacked_1                       Number of obs   =      4836
D-E[D|X]  = D-D1_pystacked_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1020964   .0165252    -6.18   0.000    -.1344852   -.0697075
       _cons |   -.002559   .0062987    -0.41   0.685    -.0149042    .0097861
------------------------------------------------------------------------------
Stacking final estimator: nnls1

file out_923/results.dta saved


Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  ss  1  Y1_pystacked  D1_pystacked    -0.101    (0.017)
  ss  1  [shortstack]          [ss]    -0.101    (0.017)
  ps  1   [poolstack]          [ps]    -0.101    (0.016)

Shortstack DDML model
y-E[y|X]  = y-Y_lnearn_ss_1                        Number of obs   =      4836
D-E[D|X]  = D-D_gender_r_ss_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1014066   .0165956    -6.11   0.000    -.1339333   -.0688798
       _cons |   -.003144   .0062874    -0.50   0.617    -.0154671     .009179
------------------------------------------------------------------------------
Stacking final estimator: nnls1

file out_923/results.dta saved


Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  ps  1  Y1_pystacked  D1_pystacked    -0.101    (0.016)
  ss  1  [shortstack]          [ss]    -0.101    (0.017)
  ps  1   [poolstack]          [ps]    -0.101    (0.016)

Poolstack DDML model
y-E[y|X]  = y-Y_lnearn_ps_1                        Number of obs   =      4836
D-E[D|X]  = D-D_gender_r_ps_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1008548   .0164841    -6.12   0.000    -.1331631   -.0685465
       _cons |  -.0030082   .0062925    -0.48   0.633    -.0153412    .0093248
------------------------------------------------------------------------------
Stacking final estimator: nnls1

file out_923/results.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: nnls1
               learner  mean_weight        rep_1
      ols            1    .08166809    .08166809
      ols            2    .00129426    .00129426
  lassocv            3    .27081704    .27081704
  ridgecv            4    7.386e-17    7.386e-17
  lassocv            5    4.051e-17    4.051e-17
  ridgecv            6    4.476e-17    4.476e-17
       rf            7    .39011912    .39011912
       rf            8    2.630e-17    2.630e-17
       rf            9    9.719e-17    9.719e-17
gradboost           10    .00562313    .00562313
gradboost           11    .22064273    .22064273
     nnet           12    .01464953    .01464953
     nnet           13    .01518609    .01518609

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: nnls1
               learner  mean_weight        rep_1
      ols            1    .03557831    .03557831
      ols            2    8.070e-17    8.070e-17
  lassocv            3    .09120735    .09120735
  ridgecv            4    .04889195    .04889195
  lassocv            5    .05859756    .05859756
  ridgecv            6    .15301356    .15301356
       rf            7    .42425901    .42425901
       rf            8    7.038e-17    7.038e-17
       rf            9    7.102e-17    7.102e-17
gradboost           10    .00677718    .00677718
gradboost           11    .12372445    .12372445
     nnet           12    .02948087    .02948087
     nnet           13    .02846975    .02846975

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: nnls1
               learner  mean_weight        rep_1
      ols            1    .08166809    .08166809
      ols            2    .00129426    .00129426
  lassocv            3    .27081704    .27081704
  ridgecv            4    7.386e-17    7.386e-17
  lassocv            5    4.051e-17    4.051e-17
  ridgecv            6    4.476e-17    4.476e-17
       rf            7    .39011912    .39011912
       rf            8    2.630e-17    2.630e-17
       rf            9    9.719e-17    9.719e-17
gradboost           10    .00562313    .00562313
gradboost           11    .22064273    .22064273
     nnet           12    .01464953    .01464953
     nnet           13    .01518609    .01518609

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: nnls1
               learner  mean_weight        rep_1
      ols            1    .03557831    .03557831
      ols            2    8.070e-17    8.070e-17
  lassocv            3    .09120735    .09120735
  ridgecv            4    .04889195    .04889195
  lassocv            5    .05859756    .05859756
  ridgecv            6    .15301356    .15301356
       rf            7    .42425901    .42425901
       rf            8    7.038e-17    7.038e-17
       rf            9    7.102e-17    7.102e-17
gradboost           10    .00677718    .00677718
gradboost           11    .12372445    .12372445
     nnet           12    .02948087    .02948087
     nnet           13    .02846975    .02846975

Y1_pystacked_w_mn[13,3]
               learner  mean_weight        rep_1
      ols            1    .03557831    .03557831
      ols            2    8.070e-17    8.070e-17
  lassocv            3    .09120735    .09120735
  ridgecv            4    .04889195    .04889195
  lassocv            5    .05859756    .05859756
  ridgecv            6    .15301356    .15301356
       rf            7    .42425901    .42425901
       rf            8    7.038e-17    7.038e-17
       rf            9    7.102e-17    7.102e-17
gradboost           10    .00677718    .00677718
gradboost           11    .12372445    .12372445
     nnet           12    .02948087    .02948087
     nnet           13    .02846975    .02846975

      +--------------------------------+
      | Y1_pys~1   Y1_pys~2   Y1_pys~3 |
      |--------------------------------|
   1. |        1   .0355783   .0355783 |
   2. |        2   8.07e-17   8.07e-17 |
   3. |        3   .0912074   .0912074 |
   4. |        4    .048892    .048892 |
      +--------------------------------+
(note: file out_923/Y1_pystacked_w_mn_nnls1_regular.dta not found)
file out_923/Y1_pystacked_w_mn_nnls1_regular.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: nnls1
               learner  mean_weight        rep_1
      ols            1    .08166809    .08166809
      ols            2    .00129426    .00129426
  lassocv            3    .27081704    .27081704
  ridgecv            4    7.386e-17    7.386e-17
  lassocv            5    4.051e-17    4.051e-17
  ridgecv            6    4.476e-17    4.476e-17
       rf            7    .39011912    .39011912
       rf            8    2.630e-17    2.630e-17
       rf            9    9.719e-17    9.719e-17
gradboost           10    .00562313    .00562313
gradboost           11    .22064273    .22064273
     nnet           12    .01464953    .01464953
     nnet           13    .01518609    .01518609

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: nnls1
               learner  mean_weight        rep_1
      ols            1    .03557831    .03557831
      ols            2    8.070e-17    8.070e-17
  lassocv            3    .09120735    .09120735
  ridgecv            4    .04889195    .04889195
  lassocv            5    .05859756    .05859756
  ridgecv            6    .15301356    .15301356
       rf            7    .42425901    .42425901
       rf            8    7.038e-17    7.038e-17
       rf            9    7.102e-17    7.102e-17
gradboost           10    .00677718    .00677718
gradboost           11    .12372445    .12372445
     nnet           12    .02948087    .02948087
     nnet           13    .02846975    .02846975

D1_pystacked_w_mn[13,3]
               learner  mean_weight        rep_1
      ols            1    .08166809    .08166809
      ols            2    .00129426    .00129426
  lassocv            3    .27081704    .27081704
  ridgecv            4    7.386e-17    7.386e-17
  lassocv            5    4.051e-17    4.051e-17
  ridgecv            6    4.476e-17    4.476e-17
       rf            7    .39011912    .39011912
       rf            8    2.630e-17    2.630e-17
       rf            9    9.719e-17    9.719e-17
gradboost           10    .00562313    .00562313
gradboost           11    .22064273    .22064273
     nnet           12    .01464953    .01464953
     nnet           13    .01518609    .01518609

      +--------------------------------+
      | D1_pys~1   D1_pys~2   D1_pys~3 |
      |--------------------------------|
   1. |        1   .0816681   .0816681 |
   2. |        2   .0012943   .0012943 |
   3. |        3    .270817    .270817 |
   4. |        4   7.39e-17   7.39e-17 |
      +--------------------------------+
(note: file out_923/D1_pystacked_w_mn_nnls1_regular.dta not found)
file out_923/D1_pystacked_w_mn_nnls1_regular.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: nnls1
               learner  mean_weight        rep_1
      ols            1    .23353685    .23353685
      ols            2            0            0
  lassocv            3    .10086369    .10086369
  ridgecv            4    1.415e-16    1.415e-16
  lassocv            5    1.010e-16    1.010e-16
  ridgecv            6    2.527e-17    2.527e-17
       rf            7    .45534123    .45534123
       rf            8            0            0
       rf            9    1.181e-16    1.181e-16
gradboost           10            0            0
gradboost           11    .19360391    .19360391
     nnet           12    3.695e-16    3.695e-16
     nnet           13    .01665432    .01665432

short-stacked weights across resamples for lnearn
final stacking estimator: nnls1
               learner  mean_weight        rep_1
      ols            1    .04283888    .04283888
      ols            2            0            0
  lassocv            3    1.085e-17    1.085e-17
  ridgecv            4    7.395e-17    7.395e-17
  lassocv            5    .16485841    .16485841
  ridgecv            6    .20782394    .20782394
       rf            7    .40917522    .40917522
       rf            8    6.157e-17    6.157e-17
       rf            9            0            0
gradboost           10    6.656e-17    6.656e-17
gradboost           11    .12829323    .12829323
     nnet           12            0            0
     nnet           13    .04701032    .04701032

Y_lnearn_ss[13,3]
               learner  mean_weight        rep_1
      ols            1    .04283888    .04283888
      ols            2            0            0
  lassocv            3    1.085e-17    1.085e-17
  ridgecv            4    7.395e-17    7.395e-17
  lassocv            5    .16485841    .16485841
  ridgecv            6    .20782394    .20782394
       rf            7    .40917522    .40917522
       rf            8    6.157e-17    6.157e-17
       rf            9            0            0
gradboost           10    6.656e-17    6.656e-17
gradboost           11    .12829323    .12829323
     nnet           12            0            0
     nnet           13    .04701032    .04701032

      +--------------------------------------------+
      | Y_lnea~_1   Y_lne~s1   Y_lnea~2   Y_lnea~3 |
      |--------------------------------------------|
   1. | 2.6401884          1   .0428389   .0428389 |
   2. | 3.1444374          2          0          0 |
   3. | 2.8706682          3   1.08e-17   1.08e-17 |
   4. | 2.5467736          4   7.39e-17   7.39e-17 |
      +--------------------------------------------+
(note: file out_923/Y_lnearn_ss_nnls1_short.dta not found)
file out_923/Y_lnearn_ss_nnls1_short.dta saved

D_gender_r_ss[13,3]
               learner  mean_weight        rep_1
      ols            1    .23353685    .23353685
      ols            2            0            0
  lassocv            3    .10086369    .10086369
  ridgecv            4    1.415e-16    1.415e-16
  lassocv            5    1.010e-16    1.010e-16
  ridgecv            6    2.527e-17    2.527e-17
       rf            7    .45534123    .45534123
       rf            8            0            0
       rf            9    1.181e-16    1.181e-16
gradboost           10            0            0
gradboost           11    .19360391    .19360391
     nnet           12    3.695e-16    3.695e-16
     nnet           13    .01665432    .01665432

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .74266501          1   .2335369   .2335369 |
   2. |  .4526672          2          0          0 |
   3. | .14339518          3   .1008637   .1008637 |
   4. | .30118885          4   1.42e-16   1.42e-16 |
      +--------------------------------------------+
(note: file out_923/D_gender_r_ss_nnls1_short.dta not found)
file out_923/D_gender_r_ss_nnls1_short.dta saved

Y_lnearn_ps[13,3]
               learner  mean_weight        rep_1
      ols            1    .02601886    .02601886
      ols            2    5.929e-16    5.929e-16
  lassocv            3    .17289316    .17289316
  ridgecv            4    .06351563    .06351563
  lassocv            5            0            0
  ridgecv            6    .11699676    .11699676
       rf            7    .44860721    .44860721
       rf            8    3.096e-16    3.096e-16
       rf            9            0            0
gradboost           10            0            0
gradboost           11    .14161335    .14161335
     nnet           12            0            0
     nnet           13    .03035503    .03035503

      +--------------------------------------------+
      | Y_lnea~_1   Y_lne~s1   Y_lnea~2   Y_lnea~3 |
      |--------------------------------------------|
   1. | 2.6396771          1   .0260189   .0260189 |
   2. | 3.1337876          2   5.93e-16   5.93e-16 |
   3. | 2.8710946          3   .1728932   .1728932 |
   4. | 2.5463045          4   .0635156   .0635156 |
      +--------------------------------------------+
(note: file out_923/Y_lnearn_ps_nnls1_pooled.dta not found)
file out_923/Y_lnearn_ps_nnls1_pooled.dta saved

D_gender_r_ps[13,3]
               learner  mean_weight        rep_1
      ols            1    .06672891    .06672891
      ols            2            0            0
  lassocv            3    .30524563    .30524563
  ridgecv            4            0            0
  lassocv            5    3.655e-16    3.655e-16
  ridgecv            6    9.881e-17    9.881e-17
       rf            7    .39028694    .39028694
       rf            8    1.059e-15    1.059e-15
       rf            9    1.314e-15    1.314e-15
gradboost           10    1.120e-16    1.120e-16
gradboost           11    .23103593    .23103593
     nnet           12            0            0
     nnet           13    .00670259    .00670259

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .74116064          1   .0667289   .0667289 |
   2. |  .4630429          2          0          0 |
   3. | .14351758          3   .3052456   .3052456 |
   4. | .30169248          4          0          0 |
      +--------------------------------------------+
(note: file out_923/D_gender_r_ps_nnls1_pooled.dta not found)
file out_923/D_gender_r_ps_nnls1_pooled.dta saved


Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  st  1  Y1_pystacked  D1_pystacked    -0.102    (0.016)
  ss  1  [shortstack]          [ss]    -0.094    (0.017)
  ps  1   [poolstack]          [ps]    -0.103    (0.017)

Shortstack DDML model
y-E[y|X]  = y-Y_lnearn_ss_1                        Number of obs   =      4836
D-E[D|X]  = D-D_gender_r_ss_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0938889   .0165168    -5.68   0.000    -.1262613   -.0615166
       _cons |   -.002574   .0063853    -0.40   0.687     -.015089     .009941
------------------------------------------------------------------------------
Stacking final estimator: singlebest



Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  st  1  Y1_pystacked  D1_pystacked    -0.102    (0.016)
  ss  1  [shortstack]          [ss]    -0.094    (0.017)
  ps  1   [poolstack]          [ps]    -0.103    (0.017)

Stacking DDML model
y-E[y|X]  = y-Y1_pystacked_1                       Number of obs   =      4836
D-E[D|X]  = D-D1_pystacked_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1018803   .0163663    -6.23   0.000    -.1339576    -.069803
       _cons |  -.0025119   .0063826    -0.39   0.694    -.0150216    .0099977
------------------------------------------------------------------------------
Stacking final estimator: singlebest

file out_923/results.dta saved


Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  ss  1  Y1_pystacked  D1_pystacked    -0.094    (0.017)
  ss  1  [shortstack]          [ss]    -0.094    (0.017)
  ps  1   [poolstack]          [ps]    -0.103    (0.017)

Shortstack DDML model
y-E[y|X]  = y-Y_lnearn_ss_1                        Number of obs   =      4836
D-E[D|X]  = D-D_gender_r_ss_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0938889   .0165168    -5.68   0.000    -.1262613   -.0615166
       _cons |   -.002574   .0063853    -0.40   0.687     -.015089     .009941
------------------------------------------------------------------------------
Stacking final estimator: singlebest

file out_923/results.dta saved


Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  ps  1  Y1_pystacked  D1_pystacked    -0.103    (0.017)
  ss  1  [shortstack]          [ss]    -0.094    (0.017)
  ps  1   [poolstack]          [ps]    -0.103    (0.017)

Poolstack DDML model
y-E[y|X]  = y-Y_lnearn_ps_1                        Number of obs   =      4836
D-E[D|X]  = D-D_gender_r_ps_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1030023   .0165768    -6.21   0.000    -.1354923   -.0705124
       _cons |   -.003116   .0063747    -0.49   0.625    -.0156102    .0093782
------------------------------------------------------------------------------
Stacking final estimator: singlebest

file out_923/results.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: singlebest
               learner  mean_weight        rep_1
      ols            1            0            0
      ols            2            0            0
  lassocv            3           .6           .6
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7           .3           .3
       rf            8            0            0
       rf            9            0            0
gradboost           10           .1           .1
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: singlebest
               learner  mean_weight        rep_1
      ols            1            0            0
      ols            2            0            0
  lassocv            3           .2           .2
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6           .1           .1
       rf            7           .7           .7
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: singlebest
               learner  mean_weight        rep_1
      ols            1            0            0
      ols            2            0            0
  lassocv            3           .6           .6
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7           .3           .3
       rf            8            0            0
       rf            9            0            0
gradboost           10           .1           .1
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: singlebest
               learner  mean_weight        rep_1
      ols            1            0            0
      ols            2            0            0
  lassocv            3           .2           .2
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6           .1           .1
       rf            7           .7           .7
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

Y1_pystacked_w_mn[13,3]
               learner  mean_weight        rep_1
      ols            1            0            0
      ols            2            0            0
  lassocv            3           .2           .2
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6           .1           .1
       rf            7           .7           .7
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

      +--------------------------------+
      | Y1_pys~1   Y1_pys~2   Y1_pys~3 |
      |--------------------------------|
   1. |        1          0          0 |
   2. |        2          0          0 |
   3. |        3         .2         .2 |
   4. |        4          0          0 |
      +--------------------------------+
(note: file out_923/Y1_pystacked_w_mn_singlebest_regular.dta not found)
file out_923/Y1_pystacked_w_mn_singlebest_regular.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: singlebest
               learner  mean_weight        rep_1
      ols            1            0            0
      ols            2            0            0
  lassocv            3           .6           .6
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7           .3           .3
       rf            8            0            0
       rf            9            0            0
gradboost           10           .1           .1
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: singlebest
               learner  mean_weight        rep_1
      ols            1            0            0
      ols            2            0            0
  lassocv            3           .2           .2
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6           .1           .1
       rf            7           .7           .7
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

D1_pystacked_w_mn[13,3]
               learner  mean_weight        rep_1
      ols            1            0            0
      ols            2            0            0
  lassocv            3           .6           .6
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7           .3           .3
       rf            8            0            0
       rf            9            0            0
gradboost           10           .1           .1
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

      +--------------------------------+
      | D1_pys~1   D1_pys~2   D1_pys~3 |
      |--------------------------------|
   1. |        1          0          0 |
   2. |        2          0          0 |
   3. |        3         .6         .6 |
   4. |        4          0          0 |
      +--------------------------------+
(note: file out_923/D1_pystacked_w_mn_singlebest_regular.dta not found)
file out_923/D1_pystacked_w_mn_singlebest_regular.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: singlebest
               learner  mean_weight        rep_1
      ols            1            0            0
      ols            2            0            0
  lassocv            3            0            0
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            1            1
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

short-stacked weights across resamples for lnearn
final stacking estimator: singlebest
               learner  mean_weight        rep_1
      ols            1            0            0
      ols            2            0            0
  lassocv            3            0            0
  ridgecv            4            0            0
  lassocv            5            1            1
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

Y_lnearn_ss[13,3]
               learner  mean_weight        rep_1
      ols            1            0            0
      ols            2            0            0
  lassocv            3            0            0
  ridgecv            4            0            0
  lassocv            5            1            1
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

      +--------------------------------------------+
      | Y_lnea~_1   Y_lne~s1   Y_lnea~2   Y_lnea~3 |
      |--------------------------------------------|
   1. | 2.6017079          1          0          0 |
   2. | 3.1777189          2          0          0 |
   3. | 2.8376827          3          0          0 |
   4. |  2.524555          4          0          0 |
      +--------------------------------------------+
(note: file out_923/Y_lnearn_ss_singlebest_short.dta not found)
file out_923/Y_lnearn_ss_singlebest_short.dta saved

D_gender_r_ss[13,3]
               learner  mean_weight        rep_1
      ols            1            0            0
      ols            2            0            0
  lassocv            3            0            0
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            1            1
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .76800001          1          0          0 |
   2. | .48800001          2          0          0 |
   3. | .13600001          3          0          0 |
   4. | .19599999          4          0          0 |
      +--------------------------------------------+
(note: file out_923/D_gender_r_ss_singlebest_short.dta not found)
file out_923/D_gender_r_ss_singlebest_short.dta saved

Y_lnearn_ps[13,3]
               learner  mean_weight        rep_1
      ols            1            0            0
      ols            2            0            0
  lassocv            3            0            0
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            1            1
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

      +--------------------------------------------+
      | Y_lnea~_1   Y_lne~s1   Y_lnea~2   Y_lnea~3 |
      |--------------------------------------------|
   1. | 2.5944841          1          0          0 |
   2. | 3.0736532          2          0          0 |
   3. | 2.8712728          3          0          0 |
   4. | 2.5709298          4          0          0 |
      +--------------------------------------------+
(note: file out_923/Y_lnearn_ps_singlebest_pooled.dta not found)
file out_923/Y_lnearn_ps_singlebest_pooled.dta saved

D_gender_r_ps[13,3]
               learner  mean_weight        rep_1
      ols            1            0            0
      ols            2            0            0
  lassocv            3            1            1
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .66940773          1          0          0 |
   2. | .38096282          2          0          0 |
   3. | .18201673          3          1          1 |
   4. | .38785279          4          0          0 |
      +--------------------------------------------+
(note: file out_923/D_gender_r_ps_singlebest_pooled.dta not found)
file out_923/D_gender_r_ps_singlebest_pooled.dta saved


Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  st  1  Y1_pystacked  D1_pystacked    -0.507    (0.031)
  ss  1  [shortstack]          [ss]    -0.102    (0.017)
  ps  1   [poolstack]          [ps]    -0.102    (0.017)

Shortstack DDML model
y-E[y|X]  = y-Y_lnearn_ss_1                        Number of obs   =      4836
D-E[D|X]  = D-D_gender_r_ss_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1024728   .0165847    -6.18   0.000    -.1349783   -.0699673
       _cons |  -.1361798   .0061898   -22.00   0.000    -.1483116   -.1240481
------------------------------------------------------------------------------
Stacking final estimator: ols



Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  st  1  Y1_pystacked  D1_pystacked    -0.507    (0.031)
  ss  1  [shortstack]          [ss]    -0.102    (0.017)
  ps  1   [poolstack]          [ps]    -0.102    (0.017)

Stacking DDML model
y-E[y|X]  = y-Y1_pystacked_1                       Number of obs   =      4836
D-E[D|X]  = D-D1_pystacked_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.5066778   .0307125   -16.50   0.000    -.5668732   -.4464825
       _cons |  -.0071261   .0167948    -0.42   0.671    -.0400433     .025791
------------------------------------------------------------------------------
Stacking final estimator: ols

(note: variable final was str3, now str10 to accommodate using data's values)
file out_923/results.dta saved


Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  ss  1  Y1_pystacked  D1_pystacked    -0.102    (0.017)
  ss  1  [shortstack]          [ss]    -0.102    (0.017)
  ps  1   [poolstack]          [ps]    -0.102    (0.017)

Shortstack DDML model
y-E[y|X]  = y-Y_lnearn_ss_1                        Number of obs   =      4836
D-E[D|X]  = D-D_gender_r_ss_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1024728   .0165847    -6.18   0.000    -.1349783   -.0699673
       _cons |  -.1361798   .0061898   -22.00   0.000    -.1483116   -.1240481
------------------------------------------------------------------------------
Stacking final estimator: ols

(note: variable final was str3, now str10 to accommodate using data's values)
file out_923/results.dta saved


Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  ps  1  Y1_pystacked  D1_pystacked    -0.102    (0.017)
  ss  1  [shortstack]          [ss]    -0.102    (0.017)
  ps  1   [poolstack]          [ps]    -0.102    (0.017)

Poolstack DDML model
y-E[y|X]  = y-Y_lnearn_ps_1                        Number of obs   =      4836
D-E[D|X]  = D-D_gender_r_ps_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1022226   .0165521    -6.18   0.000    -.1346641    -.069781
       _cons |  -.0676884   .0061834   -10.95   0.000    -.0798076   -.0555692
------------------------------------------------------------------------------
Stacking final estimator: ols

(note: variable final was str3, now str10 to accommodate using data's values)
file out_923/results.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: ols
               learner  mean_weight        rep_1
      ols            1    .07729079    .07729079
      ols            2    .17392622    .17392622
  lassocv            3    .51470093    .51470093
  ridgecv            4    .08463399    .08463399
  lassocv            5   -.34583626   -.34583626
  ridgecv            6   -.00521371   -.00521371
       rf            7    .48248658    .48248658
       rf            8    .62609041    .62609041
       rf            9   -.75106551   -.75106551
gradboost           10    .09189672    .09189672
gradboost           11     .1328145     .1328145
     nnet           12   -.28679836   -.28679836
     nnet           13    .00697355    .00697355

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: ols
               learner  mean_weight        rep_1
      ols            1    .01318631    .01318631
      ols            2   -.01119225   -.01119225
  lassocv            3   -.03011035   -.03011035
  ridgecv            4    .21375371    .21375371
  lassocv            5    .00007286    .00007286
  ridgecv            6    .25586037    .25586037
       rf            7    .51921256    .51921256
       rf            8    .44510642    .44510642
       rf            9   -.55343442   -.55343442
gradboost           10    .04634999    .04634999
gradboost           11    .07878558    .07878558
     nnet           12    .02577673    .02577673
     nnet           13    .01990234    .01990234

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: ols
               learner  mean_weight        rep_1
      ols            1    .07729079    .07729079
      ols            2    .17392622    .17392622
  lassocv            3    .51470093    .51470093
  ridgecv            4    .08463399    .08463399
  lassocv            5   -.34583626   -.34583626
  ridgecv            6   -.00521371   -.00521371
       rf            7    .48248658    .48248658
       rf            8    .62609041    .62609041
       rf            9   -.75106551   -.75106551
gradboost           10    .09189672    .09189672
gradboost           11     .1328145     .1328145
     nnet           12   -.28679836   -.28679836
     nnet           13    .00697355    .00697355

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: ols
               learner  mean_weight        rep_1
      ols            1    .01318631    .01318631
      ols            2   -.01119225   -.01119225
  lassocv            3   -.03011035   -.03011035
  ridgecv            4    .21375371    .21375371
  lassocv            5    .00007286    .00007286
  ridgecv            6    .25586037    .25586037
       rf            7    .51921256    .51921256
       rf            8    .44510642    .44510642
       rf            9   -.55343442   -.55343442
gradboost           10    .04634999    .04634999
gradboost           11    .07878558    .07878558
     nnet           12    .02577673    .02577673
     nnet           13    .01990234    .01990234

Y1_pystacked_w_mn[13,3]
               learner  mean_weight        rep_1
      ols            1    .01318631    .01318631
      ols            2   -.01119225   -.01119225
  lassocv            3   -.03011035   -.03011035
  ridgecv            4    .21375371    .21375371
  lassocv            5    .00007286    .00007286
  ridgecv            6    .25586037    .25586037
       rf            7    .51921256    .51921256
       rf            8    .44510642    .44510642
       rf            9   -.55343442   -.55343442
gradboost           10    .04634999    .04634999
gradboost           11    .07878558    .07878558
     nnet           12    .02577673    .02577673
     nnet           13    .01990234    .01990234

      +----------------------------------+
      | Y1_pys~1   Y1_pyst~2   Y1_pyst~3 |
      |----------------------------------|
   1. |        1    .0131863    .0131863 |
   2. |        2   -.0111922   -.0111922 |
   3. |        3   -.0301103   -.0301103 |
   4. |        4    .2137537    .2137537 |
      +----------------------------------+
(note: file out_923/Y1_pystacked_w_mn_ols_regular.dta not found)
file out_923/Y1_pystacked_w_mn_ols_regular.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: ols
               learner  mean_weight        rep_1
      ols            1    .07729079    .07729079
      ols            2    .17392622    .17392622
  lassocv            3    .51470093    .51470093
  ridgecv            4    .08463399    .08463399
  lassocv            5   -.34583626   -.34583626
  ridgecv            6   -.00521371   -.00521371
       rf            7    .48248658    .48248658
       rf            8    .62609041    .62609041
       rf            9   -.75106551   -.75106551
gradboost           10    .09189672    .09189672
gradboost           11     .1328145     .1328145
     nnet           12   -.28679836   -.28679836
     nnet           13    .00697355    .00697355

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: ols
               learner  mean_weight        rep_1
      ols            1    .01318631    .01318631
      ols            2   -.01119225   -.01119225
  lassocv            3   -.03011035   -.03011035
  ridgecv            4    .21375371    .21375371
  lassocv            5    .00007286    .00007286
  ridgecv            6    .25586037    .25586037
       rf            7    .51921256    .51921256
       rf            8    .44510642    .44510642
       rf            9   -.55343442   -.55343442
gradboost           10    .04634999    .04634999
gradboost           11    .07878558    .07878558
     nnet           12    .02577673    .02577673
     nnet           13    .01990234    .01990234

D1_pystacked_w_mn[13,3]
               learner  mean_weight        rep_1
      ols            1    .07729079    .07729079
      ols            2    .17392622    .17392622
  lassocv            3    .51470093    .51470093
  ridgecv            4    .08463399    .08463399
  lassocv            5   -.34583626   -.34583626
  ridgecv            6   -.00521371   -.00521371
       rf            7    .48248658    .48248658
       rf            8    .62609041    .62609041
       rf            9   -.75106551   -.75106551
gradboost           10    .09189672    .09189672
gradboost           11     .1328145     .1328145
     nnet           12   -.28679836   -.28679836
     nnet           13    .00697355    .00697355

      +--------------------------------+
      | D1_pys~1   D1_pys~2   D1_pys~3 |
      |--------------------------------|
   1. |        1   .0772908   .0772908 |
   2. |        2   .1739262   .1739262 |
   3. |        3   .5147009   .5147009 |
   4. |        4    .084634    .084634 |
      +--------------------------------+
(note: file out_923/D1_pystacked_w_mn_ols_regular.dta not found)
file out_923/D1_pystacked_w_mn_ols_regular.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: ols
               learner  mean_weight        rep_1
      ols            1    .21144215    .21144215
      ols            2    .15092993    .15092993
  lassocv            3    .30608304    .30608304
  ridgecv            4    .18785799    .18785799
  lassocv            5   -.21684227   -.21684227
  ridgecv            6   -.14368863   -.14368863
       rf            7    .54550037    .54550037
       rf            8    .56082862    .56082862
       rf            9    -.5991316    -.5991316
gradboost           10   -.03333516   -.03333516
gradboost           11    .14477065    .14477065
     nnet           12    .02620245    .02620245
     nnet           13    .01233414    .01233414

short-stacked weights across resamples for lnearn
final stacking estimator: ols
               learner  mean_weight        rep_1
      ols            1    .01459334    .01459334
      ols            2    -.0212843    -.0212843
  lassocv            3   -.15744262   -.15744262
  ridgecv            4    .18031842    .18031842
  lassocv            5    .19341528    .19341528
  ridgecv            6    .22317978    .22317978
       rf            7    .62849885    .62849885
       rf            8   -.16066983   -.16066983
       rf            9   -.08270715   -.08270715
gradboost           10    .11020096    .11020096
gradboost           11    .05283418    .05283418
     nnet           12    .02322356    .02322356
     nnet           13    .04053873    .04053873

Y_lnearn_ss[13,3]
               learner  mean_weight        rep_1
      ols            1    .01459334    .01459334
      ols            2    -.0212843    -.0212843
  lassocv            3   -.15744262   -.15744262
  ridgecv            4    .18031842    .18031842
  lassocv            5    .19341528    .19341528
  ridgecv            6    .22317978    .22317978
       rf            7    .62849885    .62849885
       rf            8   -.16066983   -.16066983
       rf            9   -.08270715   -.08270715
gradboost           10    .11020096    .11020096
gradboost           11    .05283418    .05283418
     nnet           12    .02322356    .02322356
     nnet           13    .04053873    .04053873

      +----------------------------------------------+
      | Y_lnea~_1   Y_lne~s1   Y_lnear~2   Y_lnear~3 |
      |----------------------------------------------|
   1. | 2.7176772          1    .0145933    .0145933 |
   2. | 3.2964167          2   -.0212843   -.0212843 |
   3. | 2.9953133          3   -.1574426   -.1574426 |
   4. | 2.6526682          4    .1803184    .1803184 |
      +----------------------------------------------+
(note: file out_923/Y_lnearn_ss_ols_short.dta not found)
file out_923/Y_lnearn_ss_ols_short.dta saved

D_gender_r_ss[13,3]
               learner  mean_weight        rep_1
      ols            1    .21144215    .21144215
      ols            2    .15092993    .15092993
  lassocv            3    .30608304    .30608304
  ridgecv            4    .18785799    .18785799
  lassocv            5   -.21684227   -.21684227
  ridgecv            6   -.14368863   -.14368863
       rf            7    .54550037    .54550037
       rf            8    .56082862    .56082862
       rf            9    -.5991316    -.5991316
gradboost           10   -.03333516   -.03333516
gradboost           11    .14477065    .14477065
     nnet           12    .02620245    .02620245
     nnet           13    .01233414    .01233414

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .82635228          1   .2114422   .2114422 |
   2. | .52958654          2   .1509299   .1509299 |
   3. | .17922596          3   .3060831   .3060831 |
   4. | .29655777          4    .187858    .187858 |
      +--------------------------------------------+
(note: file out_923/D_gender_r_ss_ols_short.dta not found)
file out_923/D_gender_r_ss_ols_short.dta saved

Y_lnearn_ps[13,3]
               learner  mean_weight        rep_1
      ols            1    .02008947    .02008947
      ols            2   -.01524446   -.01524446
  lassocv            3    .04127449    .04127449
  ridgecv            4    .34449635    .34449635
  lassocv            5   -.08862396   -.08862396
  ridgecv            6    .13668428    .13668428
       rf            7    .53176403    .53176403
       rf            8    .48360831    .48360831
       rf            9   -.59368015   -.59368015
gradboost           10    .04458012    .04458012
gradboost           11    .08710361    .08710361
     nnet           12    .00976817    .00976817
     nnet           13    .01937313    .01937313

      +----------------------------------------------+
      | Y_lnea~_1   Y_lne~s1   Y_lnear~2   Y_lnear~3 |
      |----------------------------------------------|
   1. | 2.6716144          1    .0200895    .0200895 |
   2. | 3.2023663          2   -.0152445   -.0152445 |
   3. | 2.9308822          3    .0412745    .0412745 |
   4. | 2.5884818          4    .3444963    .3444963 |
      +----------------------------------------------+
(note: file out_923/Y_lnearn_ps_ols_pooled.dta not found)
file out_923/Y_lnearn_ps_ols_pooled.dta saved

D_gender_r_ps[13,3]
               learner  mean_weight        rep_1
      ols            1     .0541807     .0541807
      ols            2    .17689457    .17689457
  lassocv            3    .52090659    .52090659
  ridgecv            4    .06751494    .06751494
  lassocv            5   -.34814785   -.34814785
  ridgecv            6    .03657626    .03657626
       rf            7    .48693896    .48693896
       rf            8    .62550327    .62550327
       rf            9   -.75709763   -.75709763
gradboost           10    .09098387    .09098387
gradboost           11    .13769502    .13769502
     nnet           12     .0092129     .0092129
     nnet           13    .00350297    .00350297

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. |  .7943655          1   .0541807   .0541807 |
   2. |  .5015709          2   .1768946   .1768946 |
   3. | .15410199          3   .5209066   .5209066 |
   4. |  .2577808          4   .0675149   .0675149 |
      +--------------------------------------------+
(note: file out_923/D_gender_r_ps_ols_pooled.dta not found)
file out_923/D_gender_r_ps_ols_pooled.dta saved


Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  st  1  Y1_pystacked  D1_pystacked    -0.105    (0.017)
  ss  1  [shortstack]          [ss]    -0.105    (0.017)
  ps  1   [poolstack]          [ps]    -0.105    (0.017)

Shortstack DDML model
y-E[y|X]  = y-Y_lnearn_ss_1                        Number of obs   =      4836
D-E[D|X]  = D-D_gender_r_ss_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1047942   .0166256    -6.30   0.000    -.1373797   -.0722087
       _cons |  -.0013923   .0063441    -0.22   0.826    -.0138266    .0110419
------------------------------------------------------------------------------
Stacking final estimator: avg



Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  st  1  Y1_pystacked  D1_pystacked    -0.105    (0.017)
  ss  1  [shortstack]          [ss]    -0.105    (0.017)
  ps  1   [poolstack]          [ps]    -0.105    (0.017)

Stacking DDML model
y-E[y|X]  = y-Y1_pystacked_1                       Number of obs   =      4836
D-E[D|X]  = D-D1_pystacked_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1047942   .0166256    -6.30   0.000    -.1373797   -.0722087
       _cons |  -.0013923   .0063441    -0.22   0.826    -.0138266    .0110419
------------------------------------------------------------------------------
Stacking final estimator: avg

(note: variable final was str3, now str10 to accommodate using data's values)
file out_923/results.dta saved


Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  ss  1  Y1_pystacked  D1_pystacked    -0.105    (0.017)
  ss  1  [shortstack]          [ss]    -0.105    (0.017)
  ps  1   [poolstack]          [ps]    -0.105    (0.017)

Shortstack DDML model
y-E[y|X]  = y-Y_lnearn_ss_1                        Number of obs   =      4836
D-E[D|X]  = D-D_gender_r_ss_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1047942   .0166256    -6.30   0.000    -.1373797   -.0722087
       _cons |  -.0013923   .0063441    -0.22   0.826    -.0138266    .0110419
------------------------------------------------------------------------------
Stacking final estimator: avg

(note: variable final was str3, now str10 to accommodate using data's values)
file out_923/results.dta saved


Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  ps  1  Y1_pystacked  D1_pystacked    -0.105    (0.017)
  ss  1  [shortstack]          [ss]    -0.105    (0.017)
  ps  1   [poolstack]          [ps]    -0.105    (0.017)

Poolstack DDML model
y-E[y|X]  = y-Y_lnearn_ps_1                        Number of obs   =      4836
D-E[D|X]  = D-D_gender_r_ps_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1047942   .0166256    -6.30   0.000    -.1373797   -.0722087
       _cons |  -.0013923   .0063441    -0.22   0.826    -.0138266    .0110419
------------------------------------------------------------------------------
Stacking final estimator: avg

(note: variable final was str3, now str10 to accommodate using data's values)
file out_923/results.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: avg
               learner  mean_weight        rep_1
      ols            1    .07692308    .07692308
      ols            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: avg
               learner  mean_weight        rep_1
      ols            1    .07692308    .07692308
      ols            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: avg
               learner  mean_weight        rep_1
      ols            1    .07692308    .07692308
      ols            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: avg
               learner  mean_weight        rep_1
      ols            1    .07692308    .07692308
      ols            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

Y1_pystacked_w_mn[13,3]
               learner  mean_weight        rep_1
      ols            1    .07692308    .07692308
      ols            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

      +--------------------------------+
      | Y1_pys~1   Y1_pys~2   Y1_pys~3 |
      |--------------------------------|
   1. |        1   .0769231   .0769231 |
   2. |        2   .0769231   .0769231 |
   3. |        3   .0769231   .0769231 |
   4. |        4   .0769231   .0769231 |
      +--------------------------------+
(note: file out_923/Y1_pystacked_w_mn_avg_regular.dta not found)
file out_923/Y1_pystacked_w_mn_avg_regular.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: avg
               learner  mean_weight        rep_1
      ols            1    .07692308    .07692308
      ols            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: avg
               learner  mean_weight        rep_1
      ols            1    .07692308    .07692308
      ols            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

D1_pystacked_w_mn[13,3]
               learner  mean_weight        rep_1
      ols            1    .07692308    .07692308
      ols            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

      +--------------------------------+
      | D1_pys~1   D1_pys~2   D1_pys~3 |
      |--------------------------------|
   1. |        1   .0769231   .0769231 |
   2. |        2   .0769231   .0769231 |
   3. |        3   .0769231   .0769231 |
   4. |        4   .0769231   .0769231 |
      +--------------------------------+
(note: file out_923/D1_pystacked_w_mn_avg_regular.dta not found)
file out_923/D1_pystacked_w_mn_avg_regular.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: avg
               learner  mean_weight        rep_1
      ols            1    .07692308    .07692308
      ols            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

short-stacked weights across resamples for lnearn
final stacking estimator: avg
               learner  mean_weight        rep_1
      ols            1    .07692308    .07692308
      ols            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

Y_lnearn_ss[13,3]
               learner  mean_weight        rep_1
      ols            1    .07692308    .07692308
      ols            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

      +--------------------------------------------+
      | Y_lnea~_1   Y_lne~s1   Y_lnea~2   Y_lnea~3 |
      |--------------------------------------------|
   1. | 2.6609149          1   .0769231   .0769231 |
   2. | 3.1700511          2   .0769231   .0769231 |
   3. |  2.862617          3   .0769231   .0769231 |
   4. | 2.5454252          4   .0769231   .0769231 |
      +--------------------------------------------+
(note: file out_923/Y_lnearn_ss_avg_short.dta not found)
file out_923/Y_lnearn_ss_avg_short.dta saved

D_gender_r_ss[13,3]
               learner  mean_weight        rep_1
      ols            1    .07692308    .07692308
      ols            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .71123696          1   .0769231   .0769231 |
   2. | .43365455          2   .0769231   .0769231 |
   3. | .24400807          3   .0769231   .0769231 |
   4. | .40368178          4   .0769231   .0769231 |
      +--------------------------------------------+
(note: file out_923/D_gender_r_ss_avg_short.dta not found)
file out_923/D_gender_r_ss_avg_short.dta saved

Y_lnearn_ps[13,3]
               learner  mean_weight        rep_1
      ols            1    .07692308    .07692308
      ols            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

      +--------------------------------------------+
      | Y_lnea~_1   Y_lne~s1   Y_lnea~2   Y_lnea~3 |
      |--------------------------------------------|
   1. | 2.6609149          1   .0769231   .0769231 |
   2. | 3.1700511          2   .0769231   .0769231 |
   3. |  2.862617          3   .0769231   .0769231 |
   4. | 2.5454252          4   .0769231   .0769231 |
      +--------------------------------------------+
(note: file out_923/Y_lnearn_ps_avg_pooled.dta not found)
file out_923/Y_lnearn_ps_avg_pooled.dta saved

D_gender_r_ps[13,3]
               learner  mean_weight        rep_1
      ols            1    .07692308    .07692308
      ols            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .71123696          1   .0769231   .0769231 |
   2. | .43365455          2   .0769231   .0769231 |
   3. | .24400807          3   .0769231   .0769231 |
   4. | .40368178          4   .0769231   .0769231 |
      +--------------------------------------------+
(note: file out_923/D_gender_r_ps_avg_pooled.dta not found)
file out_923/D_gender_r_ps_avg_pooled.dta saved
. 
.         forvalues i = 1(1)$L {
  2.                         ddml estimate, y(Y1_pystacked_L`i'_1) ///
>                                                         d(D1_pystacked_L`i'_1
> ) robust
  3.                         regsave gender_r using `folder'/results.dta, ci //
> /
>                                                 addlabel(model,partial,seed,`
> seed',final,indiv,learner,`i') ///
>                                                 append
  4.         }

y-E[y|X]  = Y1_pystacked_L1_1                      Number of obs   =      4836
D-E[D|X]  = D1_pystacked_L1_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0985652   .0173966    -5.67   0.000     -.132662   -.0644685
       _cons |  -.0038327    .006588    -0.58   0.561    -.0167449    .0090796
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_923/results.dta saved

y-E[y|X]  = Y1_pystacked_L2_1                      Number of obs   =      4836
D-E[D|X]  = D1_pystacked_L2_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1216978   .0154543    -7.87   0.000    -.1519877   -.0914078
       _cons |  -.0006754   .0068607    -0.10   0.922    -.0141221    .0127714
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_923/results.dta saved

y-E[y|X]  = Y1_pystacked_L3_1                      Number of obs   =      4836
D-E[D|X]  = D1_pystacked_L3_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0974809   .0165474    -5.89   0.000    -.1299132   -.0650486
       _cons |  -.0019495   .0063828    -0.31   0.760    -.0144596    .0105607
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_923/results.dta saved

y-E[y|X]  = Y1_pystacked_L4_1                      Number of obs   =      4836
D-E[D|X]  = D1_pystacked_L4_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0971278   .0166155    -5.85   0.000    -.1296936   -.0645621
       _cons |  -.0013282     .00641    -0.21   0.836    -.0138915    .0112352
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_923/results.dta saved

y-E[y|X]  = Y1_pystacked_L5_1                      Number of obs   =      4836
D-E[D|X]  = D1_pystacked_L5_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0988223   .0166825    -5.92   0.000    -.1315195   -.0661251
       _cons |  -.0028445   .0063746    -0.45   0.655    -.0153386    .0096495
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_923/results.dta saved

y-E[y|X]  = Y1_pystacked_L6_1                      Number of obs   =      4836
D-E[D|X]  = D1_pystacked_L6_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0968938   .0178975    -5.41   0.000    -.1319723   -.0618153
       _cons |  -.0028299   .0063958    -0.44   0.658    -.0153654    .0097056
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_923/results.dta saved

y-E[y|X]  = Y1_pystacked_L7_1                      Number of obs   =      4836
D-E[D|X]  = D1_pystacked_L7_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1011128   .0165468    -6.11   0.000    -.1335438   -.0686817
       _cons |  -.0028135    .006384    -0.44   0.659    -.0153258    .0096988
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_923/results.dta saved

y-E[y|X]  = Y1_pystacked_L8_1                      Number of obs   =      4836
D-E[D|X]  = D1_pystacked_L8_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1105095   .0169309    -6.53   0.000    -.1436935   -.0773255
       _cons |  -.0001453   .0066275    -0.02   0.983    -.0131349    .0128444
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_923/results.dta saved

y-E[y|X]  = Y1_pystacked_L9_1                      Number of obs   =      4836
D-E[D|X]  = D1_pystacked_L9_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1124517   .0167448    -6.72   0.000     -.145271   -.0796324
       _cons |  -.0002129   .0067525    -0.03   0.975    -.0134476    .0130218
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_923/results.dta saved

y-E[y|X]  = Y1_pystacked_L10_1                     Number of obs   =      4836
D-E[D|X]  = D1_pystacked_L10_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0894476   .0166074    -5.39   0.000    -.1219976   -.0568977
       _cons |  -.0005612   .0064511    -0.09   0.931    -.0132051    .0120827
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_923/results.dta saved

y-E[y|X]  = Y1_pystacked_L11_1                     Number of obs   =      4836
D-E[D|X]  = D1_pystacked_L11_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0905723   .0161693    -5.60   0.000    -.1222635   -.0588811
       _cons |  -.0064913    .006559    -0.99   0.322    -.0193467    .0063641
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_923/results.dta saved

y-E[y|X]  = Y1_pystacked_L12_1                     Number of obs   =      4836
D-E[D|X]  = D1_pystacked_L12_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |   -.109844    .015874    -6.92   0.000    -.1409565   -.0787315
       _cons |   .0057078    .007507     0.76   0.447    -.0090056    .0204211
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_923/results.dta saved

y-E[y|X]  = Y1_pystacked_L13_1                     Number of obs   =      4836
D-E[D|X]  = D1_pystacked_L13_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0683509   .0178967    -3.82   0.000    -.1034278    -.033274
       _cons |   .0002452   .0079698     0.03   0.975    -.0153753    .0158658
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_923/results.dta saved
. 
. }

.         
. *****************************************************************************
> *  
. *** interactive: estimation                                                  
>                                       ***
. *****************************************************************************
> *
.         
. if (`estimator'==2) {   
. 
.         ddml init interactive, kfolds($K) reps($R)
.         ddml E[Y|X,D]: pystacked lnearn $X_expanded $pystring_reg
.         ddml E[D|X]: pystacked gender_r $X_expanded $pystring_class
.         ddml crossfit, shortstack poolstack
.         ddml estimate, robust atet
. 
.         cap drop mse_*
.         foreach var of varlist Y1_pystacked0* {
  2.                  cap drop sqerr_`var'
  3.                  gen double sqerr_`var'=(lnearn-`var')^2 if gender_r==0
  4.                  sum sqerr_`var' if gender_r==0, meanonly
  5.                  gen double mse_`var'=r(mean) if _n ==1 
  6.         }
.         foreach var of varlist Y1_pystacked1* {
  2.                  cap drop sqerr_`var'
  3.                  gen double sqerr_`var'=(lnearn-`var')^2 if gender_r==1
  4.                  sum sqerr_`var' if gender_r==1, meanonly
  5.                  gen double mse_`var'=r(mean) if _n ==1 
  6.         }
.         foreach var of varlist D1_* {
  2.                  cap drop sqerr_`var'
  3.                  gen double sqerr_`var'=(gender_r-`var')^2
  4.                  sum sqerr_`var', meanonly
  5.                  gen double mse_`var'=r(mean) if _n ==1 
  6.         }
.         preserve
.                 keep mse_*
.                 keep if _n==1
.                 save `folder'/inter_mse, replace
.         restore
.         cap drop mse_*
.         
.         local mat gender_r_mse
.                         ddml extract, show(mse)
.                         mat `mat' = r(`mat')
.                         mat list `mat'
.                                 preserve
.                                 svmat `mat'
.                                 keep `mat'*
.                                 keep if _n<=$L
.                                 gen stack_type = "conventional" if _n==1
.                                 replace stack_type = "pooled" if _n==2
.                                 replace stack_type = "short" if _n==3
.                                 gen model = "interactive"
.                                 list if _n<=$L
.                                 save `folder'/`mat'_inter_gender_mse, replace
.                                 restore 
.                                 
.         local mat lnearn_mse
.                         ddml extract, show(mse)
.                         mat `mat' = r(`mat')
.                         mat list `mat'
.                                 preserve
.                                 svmat `mat'
.                                 keep `mat'*
.                                 keep if _n<=(2*$L)
.                                 gen stack_type = "conventional" if _n<=2
.                                 replace stack_type = "pooled" if _n>=3 & _n<=
> 4
.                                 replace stack_type = "short" if _n>4
.                                 gen model = "interactive"
.                                 list if _n<=(2*$L)
.                                 save `folder'/`mat'_inter_lnearn_mse, replace
.                                 restore 
.         
.         foreach final in nnls1 singlebest ols avg {
  2. 
.                 ddml estimate, robust finalest(`final') atet
  3.         
.                         // regular stacking results
.                         ddml estimate, mname(m0) spec(st) replay atet
  4.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,interactive,seed,`seed',final,`final',learner,-1) append
  5.                         
.                         // shortstacking results
.                         ddml estimate, mname(m0) spec(ss) replay atet
  6.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,interactive,seed,`seed',final,`final',learner,-2) append
  7.                         
.                         // poolstacking results
.                         ddml estimate, mname(m0) spec(ps) replay atet
  8.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,interactive,seed,`seed',final,`final',learner,-3) append
  9.                 
.                         // pystacked weights
.                         ddml extract, show(stweights)
 10.                         foreach mat in Y1_pystacked_w_mn D1_pystacked_w_mn
>  {
 11.                                         ddml extract, show(stweights)
 12.                                         mat `mat' = r(`mat')
 13.                                         mat list `mat'
 14.                                                 preserve
 15.                                                 svmat `mat'
 16.                                                 keep `mat'*
 17.                                                 list if _n<=8
 18.                                                 save `folder'/`mat'_`final
> '_regular_ia, replace
 19.                                                 restore
 20.                         }       
 21.                         // shortstacked weights
.                         ddml extract, show(ssweights)
 22.                         foreach mat in Y_lnearn_ss D_gender_r_ss {
 23.                                         ddml extract, show(ssweights)
 24.                                         mat `mat' = r(`mat')
 25.                                         mat list `mat'
 26.                                                 preserve
 27.                                                 svmat `mat'
 28.                                                 keep `mat'*
 29.                                                 list if _n<=8
 30.                                                 save `folder'/`mat'_`final
> '_short_ia, replace
 31.                                                 restore
 32.                         }       
 33.                         // poolstacked weights
.                         ddml extract, show(psweights)
 34.                         foreach mat in Y_lnearn_ps D_gender_r_ps {
 35.                                         ddml extract, show(psweights)
 36.                                         mat `mat' = r(`mat')
 37.                                         mat list `mat'
 38.                                                 preserve
 39.                                                 svmat `mat'
 40.                                                 keep `mat'*
 41.                                                 list if _n<=8
 42.                                                 save `folder'/`mat'_`final
> '_pooled_ia, replace
 43.                                                 restore
 44.                         }       
 45.         
.         }
. 
.         forvalues i = 1(1)$L {
  2.                         ddml estimate, y1(Y1_pystacked1_L`i'_1) y0(Y1_pyst
> acked0_L`i'_1) ///
>                                                         d(D1_pystacked_L`i'_1
> ) robust atet foldvar(m0_sample_1  )
  3.                         regsave gender_r using `folder'/results.dta, ci //
> /
>                                                 addlabel(model,interactive,se
> ed,`seed',final,indiv,learner,`i') ///
>                                                 append
  4.         }
. 
. }       

.         
. *****************************************************************************
> *  
. *** interactive NX: short-stacking                                           
>                                       ***
. *****************************************************************************
> *
. 
. if (`estimator'==3) {
. 
. gen one = 1     
. 
.         cap drop y0base*
.         cap drop dbase*
.         cap drop y1base*
. 
.         *** no cross-fitting
.         pystacked lnearn $X_expanded   $pystring_reg0  if gender_r == 0, type
> (reg) njobs($cores)  
.                 mat nxw_ia_y0 = e(weights)
.                 mat list nxw_ia_y0
.                                 preserve
.                                 svmat nxw_ia_y0
.                                 keep nxw_ia_y0*
.                                 save `folder'/nxw_ia_y0, replace
.                                 restore
.         predict y0base0, xb
.         predict y0base, base
. 
.         pystacked lnearn $X_expanded  $pystring_reg0 if gender_r == 1  , type
> (reg) njobs($cores)  
.                 mat nxw_ia_y1 = e(weights)
.                 mat list nxw_ia_y1
.                                 preserve
.                                 svmat nxw_ia_y1
.                                 keep nxw_ia_y1*
.                                 save `folder'/nxw_ia_y1, replace
.                                 restore
.         predict y1base0, xb
.         predict y1base, base
. 
.         pystacked gender_r $X_expanded $pystring_class  
.                 mat nxw_ia_d = e(weights)
.                 mat list nxw_ia_d
.                                 preserve
.                                 svmat nxw_ia_d
.                                 keep nxw_ia_d*
.                                 save `folder'/nxw_ia_d, replace
.                                 restore         
.         predict dbase0, pr
.         predict dbase, base pr
.         
.         forvalues i = 0(1)$L {
  2.                         _estimate_ate interactive, yname(lnearn) dname(gen
> der_r) ///
>                                                 y0(y0base`i') y1(y1base`i') d
> (dbase`i') ///
>                                                 atet foldid(one) robust model
> (interactive)
  3.                         regsave gender_r using `folder'/results.dta, ///
>                                                 ci addlabel(model,nxinter,see
> d,`seed',final,nx,learner,`i') append
  4.         }
.                 
. }

.         
. *****************************************************************************
> *  
. *** partial NX: short-stacking                                               
>                                       ***
. *****************************************************************************
> *
. 
. if (`estimator'==4) {
.         
. cap gen one = 1 
. 
.         cap drop Ybase* 
.         cap drop Dbase*
. 
.         *** no cross-fitting
.         pystacked lnearn $X_expanded $pystring_reg 
.                 mat nxw_y = e(weights)
.                 mat list nxw_y
.                                 preserve
.                                 svmat nxw_y
.                                 keep nxw_y*
.                                 save `folder'/nxw_y, replace
.                                 restore
.         predict Ybase0
.         predict Ybase, basexb
. 
.         pystacked gender_r $X_expanded $pystring_reg 
.                 mat nxw_d = e(weights)
.                 mat list nxw_d
.                                 preserve
.                                 svmat nxw_d
.                                 keep nxw_d*
.                                 save `folder'/nxw_d, replace
.                                 restore         
.         predict Dbase0
.         predict Dbase, basexb
. 
.         forvalues i = 0(1)$L {
  2.                 cap drop Ytil
  3.                 cap drop Dtil
  4.                 gen Ytil = lnearn - Ybase`i'
  5.                 gen Dtil = gender_r - Dbase`i'
  6.                 reg Ytil Dtil, robust
  7.                 regsave Dtil using `folder'/results.dta, ///
>                         ci addlabel(model,nxpartial,seed,`seed',final,nx,lear
> ner,`i') append
  8.         }
. 
. }

.         
. cap log close
