-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /cluster/home/kahrens/ddml_applied/GWG/Output/GWG_58248_1.txt
  log type:  text
 opened on:  10 Dec 2023, 19:14:52

. 
. which ddml
/cluster/home/kahrens/ado/plus/d/ddml.ado
*! ddml v1.4.3
*! last edited: 17aug2023
*! authors: aa/ms

. which pystacked
/cluster/home/kahrens/ado/plus/p/pystacked.ado
*! pystacked v0.7.5
*! last edited: 7aug2023
*! authors: aa/ms

. 
. set seed `seed'

. local folder out_`seed'

. 
. use "../Data/gender_gap_ML_processed", clear

. 
. cap mkdir `folder'

. 
. *****************************************************************************
> ***
. ***  controls
. *****************************************************************************
> ***
. 
. // create squared age and tenure here
. gen age_r2 = age_r^2

. gen tenure2 = tenure^2
(2 missing values generated)

. 
. // no base categories
. global continuous                                                            
>                                                            ///
>         age_r                                                                
>                                                                    /// no mis
> sing
>         yrsqual         /* years of education (derived) */                   
>                                    /// 355 missing
>         /// leavedu             /* age when left education (derived) */      
>                            /// 1,081 missing
>         pvlit1          /* literacy score: plausible value 1 (also 2-10 avail
> ) */       /// no missing
>         pvnum1          /* numeracy score: plausible value 1 (also 2-10 avail
> ) */       /// no missing
>         tenure          /* tenure = years in work for current employer */    
>                    /// 2 missing
>                                                                              
>                                                                            //

. // add second order terms here
. global continuous $continuous age_r2 tenure2

. 
. global discrete0                                                             
>                                                            ///             
>         b_q01a          /* education, highest level attained */              
>                            /// no missing
>         b_q01b          /* area of study */                                  
>                                                    /// 434 missing
>         d_q06c          /* part of a larger organization */                  
>                                    /// 13 missing
>         d_q08a          /* management position */                            
>                                            /// no missing
>         d_q09           /* type of contract */                               
>                                            /// 12 missing
>         d_q10_t1        /* hours per week at this job or business */         
>                    /// 1 missing
>         d_q14           /* job satisfaction */                               
>                                            /// 1 missing
>         i_q08           /* health status */                                  
>                                                    /// 2 missing
>         j_q02a          /* living with a partner */                          
>                                            /// 899 missing
>         j_q03d1_c       /* age of youngest child */                          
>                                            /// 2,718 missing
>         j_q04c1_c       /* immigration: age */                               
>                                            /// 4,375 missing
>         j_q06b          /* mother's highest level of educ */                 
>                            /// 445 missing
>         j_q07b          /* father's highest level of educ */                 
>                            /// 515 missing
>         j_q03b          /* number of children*/                              
>                                            /// 1,856 missing
>         impar           /* immigration: parents */                           
>                                            /// 21 missing
>         imgen           /* immigration: generation */                        
>                                    /// 344 missing
>         nfe12jr         /* informal job-related educ in prev 12 months */    
>                    /// 116 missing
>         nfe12njr        /* informal non-job-related educ in prev 12 months */
>            /// 116 missing
>                                                                              
>                                                                            //
>                                                                              
>                                                          

. global personality                                                           
>                                                            ///
>         i_q04b          /* Learning strategies, Relate new ideas into real li
> fe */      /// 16 missing
>         i_q04d          /* Learning strategies, Like learning new things */  
>                    /// no missing
>         i_q04h          /* Learning strategies, Attribute something new */   
>                    /// 10 missing
>         i_q04j          /* Learning strategies, Deal with difficult things */
>            /// no missing
>         i_q04l          /* Learning strategies, Fit different ideas together 
> */         /// 5 missing
>         i_q04m          /* Learning strategies, Looking for additional info *
> /          /// 1 missing
>         i_q05f          /* Cultural engagement, Voluntary non-profit work */ 
>            /// no missing
>         i_q06a          /* Political efficacy, No influence on the government
>  */        /// 14 missing
>         i_q07a          /* Social trust, Trust only few people */            
>                            /// 4 missing
>         i_q07b          /* Social trust, Other people take advantage of you *
> /          /// 6 missing
>                                                                              
>                                                                            //

. global discrete $discrete0                                                   
>                                                    ///
>         new_reg_tl2     /* geographical region */                            
>                                            /// 2 missing
>         new_isco1c      /* occupation */                                     
>                                                    /// no missing
>         new_isic1c      /* industry */                                       
>                                                    // no missing

. 
. global X_simple                                                         ///
>         i.(b_q01a d_q10_t1 j_q03b)                              ///
>         c.($continuous)

. 
. global X_fullinteracted                                         ///
>         i.($discrete0 )                                                 ///
>         i.new_isco1c#i.new_isic1c#i.new_reg_tl2 ///
>         c.($continuous)                  

.         
. global X_cont                                                           ///
>         c.($continuous)##i.($discrete)

. 
. global X_expanded                                                       ///
>         i.($discrete)                                                   ///
>         c.($continuous)                                                 ///
>         c.age_r#i.($discrete)                                   ///
>         c.tenure#i.($discrete)

. 
.         
. 
. *****************************************************************************
> ***
. ***  estimation sample
. *****************************************************************************
> ***
. 
. gen byte touse=1

. markout touse lnearn $X_expanded

. keep if touse
(53 observations deleted)

. 
. 
. *****************************************************************************
> ***
. ***  learners
. *****************************************************************************
> ***
. 
. global cores = 5

. 
. global rf1 min_samples_leaf(1)  max_features(sqrt) n_estimators(500)

. global rf2 min_samples_leaf(50)  max_features(sqrt) n_estimators(500)

. global rf3 min_samples_leaf(100)  max_features(sqrt) n_estimators(500)

. global grad1 n_estimators(500) n_iter_no_change(10)  

. global grad2 n_estimators(500)  

. global nnet1 hidden_layer_sizes(40 20 1 20 50) early_stopping 

. global nnet2 hidden_layer_sizes(30 30 30) early_stopping  

. 
. global pystring_reg0                                                         
>    || ///
>                                         m(ols)                               
>                            || ///
>                                         m(ols) xvars($X_simple)              
>            || ///
>                                         m(lassocv)                           
>                            || ///
>                                         m(ridgecv)                           
>                            || ///
>                                         m(lassocv)      xvars($X_cont)       
>            || ///
>                                         m(ridgecv)      xvars($X_cont)       
>            || ///
>                                         m(rf) opt($rf1)                      
>                    || ///
>                                         m(rf) opt($rf2)                      
>                    || ///
>                                         m(rf) opt($rf3)                      
>                    || ///
>                                         m(gradboost) opt($grad1)             
>            || ///
>                                         m(gradboost) opt($grad2)             
>            || ///
>                                         m(nnet) opt($nnet1)                  
>            || ///
>                                         m(nnet) opt($nnet2)                  
>            || //

. 
. global pystring_reg  $pystring_reg0 , type(reg) njobs($cores) 

.  
. global pystring_class0                                                       
>            || ///
>                                         m(logit)                             
>                            || ///
>                                         m(logit) xvars($X_simple)            
>            || ///
>                                         m(lassocv)                           
>                            || ///
>                                         m(ridgecv)                           
>                            || ///
>                                         m(lassocv)      xvars($X_cont)       
>            || ///
>                                         m(ridgecv)      xvars($X_cont)       
>            || ///
>                                         m(rf) opt($rf1)                      
>                    || ///
>                                         m(rf) opt($rf2)                      
>                    || ///
>                                         m(rf) opt($rf3)                      
>                    || ///
>                                         m(gradboost) opt($grad1)             
>            || ///
>                                         m(gradboost) opt($grad2)             
>            || ///
>                                         m(nnet) opt($nnet1)                  
>            || ///
>                                         m(nnet) opt($nnet2)                  
>            || //                   

.                                 
. global pystring_class $pystring_class0 , type(class) njobs($cores)

.                                         
. global R =1  

. global K=10 

. global L =13

.         
. *****************************************************************************
> *  
. *** ddml: estimation                                                         
>                                               ***
. *****************************************************************************
> *
. 
. if (`estimator'==1) {
. 
.         ddml init partial,  reps($R) kfolds($K)
.         ddml E[Y|X]: pystacked lnearn $X_expanded $pystring_reg
Learner Y1_pystacked added successfully.
.         ddml E[D|X]: pystacked gender_r $X_expanded $pystring_reg
Learner D1_pystacked added successfully.
.         ddml crossfit, shortstack poolstack
Cross-fitting E[y|X] equation: lnearn
Cross-fitting fold 1 2 3 4 5 6 7 8 9 10 ...completed cross-fitting...completed 
> short-stacking...completed pooled-stacking
Cross-fitting E[D|X] equation: gender_r
Cross-fitting fold 1 2 3 4 5 6 7 8 9 10 ...completed cross-fitting...completed 
> short-stacking...completed pooled-stacking
.         ddml estimate, robust


Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  st  1  Y1_pystacked  D1_pystacked    -0.083    (0.023)
  ss  1  [shortstack]          [ss]    -0.100    (0.017)
  ps  1   [poolstack]          [ps]    -0.099    (0.017)

Shortstack DDML model
y-E[y|X]  = y-Y_lnearn_ss_1                        Number of obs   =      4836
D-E[D|X]  = D-D_gender_r_ss_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1001301   .0167256    -5.99   0.000    -.1329117   -.0673485
       _cons |  -.0027803   .0063122    -0.44   0.660     -.015152    .0095913
------------------------------------------------------------------------------
Stacking final estimator: nnls1

.         
.         foreach mat in lnearn_mse gender_r_mse {
  2.                         ddml extract, show(mse)
  3.                         mat `mat' = r(`mat')
  4.                         mat list `mat'
  5.                                 preserve
  6.                                 svmat `mat'
  7.                                 keep `mat'*
  8.                                 keep if _n<=$L
  9.                                 gen stack_type = "conventional" if _n==1
 10.                                 replace stack_type = "pooled" if _n==2
 11.                                 replace stack_type = "short" if _n==3
 12.                                 gen model = "plm"
 13.                                 list if _n<=$L
 14.                                 save `folder'/`mat'_plm_mse, replace
 15.                                 restore 
 16.         }       

MSEs for gender_r:
                 rep   full smp      fold 1      fold 2      fold 3      fold 4
>       fold 5      fold 6      fold 7      fold 8      fold 9     fold 10 
    D1_pystacked   1      0.157       0.145       0.173       0.147       0.154
>        0.166       0.175       0.143       0.158       0.159       0.151  
   D_gender_r_ps   1      0.157       0.145       0.167       0.147       0.154
>        0.167       0.175       0.145       0.157       0.159       0.151  
   D_gender_r_ss   1      0.157       0.145       0.167       0.146       0.154
>        0.167       0.174       0.144       0.157       0.159       0.151  

MSEs for lnearn:
                 rep   full smp      fold 1      fold 2      fold 3      fold 4
>       fold 5      fold 6      fold 7      fold 8      fold 9     fold 10 
    Y1_pystacked   1      0.207       0.387       0.346       0.168       0.118
>        0.155       0.192       0.205       0.223       0.129       0.146  
     Y_lnearn_ps   1      0.195       0.389       0.233       0.168       0.119
>        0.155       0.190       0.202       0.223       0.129       0.146  
     Y_lnearn_ss   1      0.194       0.390       0.211       0.168       0.119
>        0.157       0.192       0.202       0.223       0.131       0.147  

lnearn_mse[3,12]
                      rep  full_sample        fold1        fold2        fold3
Y1_pystacked            1    .20689341    .38693118    .34636167    .16752947
 Y_lnearn_ps            1    .19546338    .38925811    .23326728    .16775271
 Y_lnearn_ss            1    .19397213    .38982455    .21124135    .16826411

                    fold4        fold5        fold6        fold7        fold8
Y1_pystacked    .11773206    .15493548    .19205275    .20532852    .22302314
 Y_lnearn_ps    .11854677    .15499738    .19007049    .20226062    .22314593
 Y_lnearn_ss    .11945048    .15717962    .19184479     .2019224    .22303701

                    fold9       fold10
Y1_pystacked    .12924505    .14608808
 Y_lnearn_ps    .12939959    .14632413
 Y_lnearn_ss    .13052189    .14684225
(4,823 observations deleted)
(12 missing values generated)
(1 real change made)
(1 real change made)

     +-----------------------------------------------------------------+
  1. | lnear~e1 | lnear~e2 | lnearn~3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        1 | .2068934 | .3869312 | .3463617 | .1675295 | .1177321 |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     | .1549355 | .1920528 | .2053285 | .2230231 | .1292451 | .1460881 |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |           conventional            |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  2. | lnear~e1 | lnear~e2 | lnearn~3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        1 | .1954634 | .3892581 | .2332673 | .1677527 | .1185468 |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     | .1549974 | .1900705 | .2022606 | .2231459 | .1293996 | .1463241 |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                 pooled            |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  3. | lnear~e1 | lnear~e2 | lnearn~3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        1 | .1939721 | .3898245 | .2112413 | .1682641 | .1194505 |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     | .1571796 | .1918448 | .2019224 |  .223037 | .1305219 | .1468422 |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                  short            |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  4. | lnear~e1 | lnear~e2 | lnearn~3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  5. | lnear~e1 | lnear~e2 | lnearn~3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  6. | lnear~e1 | lnear~e2 | lnearn~3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  7. | lnear~e1 | lnear~e2 | lnearn~3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  8. | lnear~e1 | lnear~e2 | lnearn~3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  9. | lnear~e1 | lnear~e2 | lnearn~3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 10. | lnear~e1 | lnear~e2 | lnearn~3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 11. | lnear~e1 | lnear~e2 | lnearn~3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 12. | lnear~e1 | lnear~e2 | lnearn~3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 13. | lnear~e1 | lnear~e2 | lnearn~3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+
(note: file out_58248/lnearn_mse_plm_mse.dta not found)
file out_58248/lnearn_mse_plm_mse.dta saved

MSEs for gender_r:
                 rep   full smp      fold 1      fold 2      fold 3      fold 4
>       fold 5      fold 6      fold 7      fold 8      fold 9     fold 10 
    D1_pystacked   1      0.157       0.145       0.173       0.147       0.154
>        0.166       0.175       0.143       0.158       0.159       0.151  
   D_gender_r_ps   1      0.157       0.145       0.167       0.147       0.154
>        0.167       0.175       0.145       0.157       0.159       0.151  
   D_gender_r_ss   1      0.157       0.145       0.167       0.146       0.154
>        0.167       0.174       0.144       0.157       0.159       0.151  

MSEs for lnearn:
                 rep   full smp      fold 1      fold 2      fold 3      fold 4
>       fold 5      fold 6      fold 7      fold 8      fold 9     fold 10 
    Y1_pystacked   1      0.207       0.387       0.346       0.168       0.118
>        0.155       0.192       0.205       0.223       0.129       0.146  
     Y_lnearn_ps   1      0.195       0.389       0.233       0.168       0.119
>        0.155       0.190       0.202       0.223       0.129       0.146  
     Y_lnearn_ss   1      0.194       0.390       0.211       0.168       0.119
>        0.157       0.192       0.202       0.223       0.131       0.147  

gender_r_mse[3,12]
                      rep  full_sample        fold1        fold2        fold3
D1_pystacked            1     .1571639    .14508543    .17301295    .14726859
D_gender_r~s            1     .1566527    .14504994    .16709605    .14684571
D_gender_r~s            1    .15659263    .14505272    .16743991     .1464092

                    fold4        fold5        fold6        fold7        fold8
D1_pystacked    .15407094    .16605564    .17523628    .14257233    .15757561
D_gender_r~s    .15402496    .16681977    .17463037    .14460514    .15690904
D_gender_r~s    .15395617    .16680506     .1743588    .14412541    .15729491

                    fold9       fold10
D1_pystacked    .15935304    .15140102
D_gender_r~s    .15923399    .15130547
D_gender_r~s    .15901903    .15145839
(4,823 observations deleted)
(12 missing values generated)
(1 real change made)
(1 real change made)

     +-----------------------------------------------------------------+
  1. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        1 | .1571639 | .1450854 | .1730129 | .1472686 | .1540709 |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     | .1660556 | .1752363 | .1425723 | .1575756 |  .159353 |  .151401 |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |           conventional            |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  2. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        1 | .1566527 | .1450499 |  .167096 | .1468457 |  .154025 |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     | .1668198 | .1746304 | .1446051 |  .156909 |  .159234 | .1513055 |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                 pooled            |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  3. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        1 | .1565926 | .1450527 | .1674399 | .1464092 | .1539562 |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     | .1668051 | .1743588 | .1441254 | .1572949 |  .159019 | .1514584 |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                  short            |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  4. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  5. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  6. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  7. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  8. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  9. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 10. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 11. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 12. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 13. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+
(note: file out_58248/gender_r_mse_plm_mse.dta not found)
file out_58248/gender_r_mse_plm_mse.dta saved
. 
.         cap drop mse_*
.         foreach var of varlist Y1_* {
  2.                  cap drop sqerr_`var'
  3.                  gen double sqerr_`var'=(lnearn-`var')^2
  4.                  sum sqerr_`var', meanonly
  5.                  gen double mse_`var'=r(mean) if _n ==1 
  6.         }
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
.         foreach var of varlist D1_* {
  2.                  cap drop sqerr_`var'
  3.                  gen double sqerr_`var'=(gender_r-`var')^2
  4.                  sum sqerr_`var', meanonly
  5.                  gen double mse_`var'=r(mean) if _n ==1 
  6.         }
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
.         preserve
.                 keep mse_*
.                 keep if _n==1
(4,835 observations deleted)
.                 save `folder'/plm_mse, replace
(note: file out_58248/plm_mse.dta not found)
file out_58248/plm_mse.dta saved
.         restore
.         cap drop mse_*
. 
.         ** initialize results file
.         regsave gender_r using `folder'/results.dta, ci addlabel(model,partia
> l,seed,`seed',final,init,learner,-99) replace
(note: file out_58248/results.dta not found)
file out_58248/results.dta saved
. 
.         foreach final in nnls1 singlebest ols avg {
  2. 
.                 ddml estimate, robust finalest(`final')
  3.         
.                         // regular stacking results
.                         ddml estimate, mname(m0) spec(st) replay  
  4.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,partial,seed,`seed',final,`final',learner,-1) append
  5.                         
.                         // shortstacking results
.                         ddml estimate, mname(m0) spec(ss) replay 
  6.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,partial,seed,`seed',final,`final',learner,-2) append
  7.                         
.                         // poolstacking results
.                         ddml estimate, mname(m0) spec(ps) replay  
  8.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,partial,seed,`seed',final,`final',learner,-3) append     
  9.                 
.                         // pystacked weights
.                         ddml extract, show(stweights)   
 10.                         foreach mat in Y1_pystacked_w_mn D1_pystacked_w_mn
>  {
 11.                                         ddml extract, show(stweights)   
 12.                                         mat `mat' = r(`mat')
 13.                                         mat list `mat'
 14.                                                 preserve
 15.                                                 svmat `mat'
 16.                                                 keep `mat'*
 17.                                                 list if _n<=4
 18.                                                 save `folder'/`mat'_`final
> '_regular, replace
 19.                                                 restore
 20.                         }       
 21.                         // shortstacked weights
.                         ddml extract, show(ssweights)
 22.                         foreach mat in Y_lnearn_ss D_gender_r_ss {
 23.                                         qui ddml extract, show(ssweights)
 24.                                         mat `mat' = r(`mat')
 25.                                         mat list `mat'
 26.                                                 preserve
 27.                                                 svmat `mat'
 28.                                                 keep `mat'*
 29.                                                 list if _n<=4
 30.                                                 save `folder'/`mat'_`final
> '_short, replace
 31.                                                 restore
 32.                         }       
 33.                         // poolstacked weights
. 
.                         foreach mat in Y_lnearn_ps D_gender_r_ps {
 34.                                         qui ddml extract, show(psweights)
 35.                                         mat `mat' = r(`mat')
 36.                                         mat list `mat'
 37.                                                 preserve
 38.                                                 svmat `mat'
 39.                                                 keep `mat'*
 40.                                                 list if _n<=4
 41.                                                 save `folder'/`mat'_`final
> '_pooled, replace
 42.                                                 restore
 43.                         }       
 44.         
.         }


Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  st  1  Y1_pystacked  D1_pystacked    -0.083    (0.023)
  ss  1  [shortstack]          [ss]    -0.100    (0.017)
  ps  1   [poolstack]          [ps]    -0.099    (0.017)

Shortstack DDML model
y-E[y|X]  = y-Y_lnearn_ss_1                        Number of obs   =      4836
D-E[D|X]  = D-D_gender_r_ss_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1001301   .0167256    -5.99   0.000    -.1329117   -.0673485
       _cons |  -.0027803   .0063122    -0.44   0.660     -.015152    .0095913
------------------------------------------------------------------------------
Stacking final estimator: nnls1



Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  st  1  Y1_pystacked  D1_pystacked    -0.083    (0.023)
  ss  1  [shortstack]          [ss]    -0.100    (0.017)
  ps  1   [poolstack]          [ps]    -0.099    (0.017)

Stacking DDML model
y-E[y|X]  = y-Y1_pystacked_1                       Number of obs   =      4836
D-E[D|X]  = D-D1_pystacked_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0828017   .0225405    -3.67   0.000    -.1269802   -.0386232
       _cons |   .0005179   .0065245     0.08   0.937    -.0122699    .0133058
------------------------------------------------------------------------------
Stacking final estimator: nnls1

file out_58248/results.dta saved


Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  ss  1  Y1_pystacked  D1_pystacked    -0.100    (0.017)
  ss  1  [shortstack]          [ss]    -0.100    (0.017)
  ps  1   [poolstack]          [ps]    -0.099    (0.017)

Shortstack DDML model
y-E[y|X]  = y-Y_lnearn_ss_1                        Number of obs   =      4836
D-E[D|X]  = D-D_gender_r_ss_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1001301   .0167256    -5.99   0.000    -.1329117   -.0673485
       _cons |  -.0027803   .0063122    -0.44   0.660     -.015152    .0095913
------------------------------------------------------------------------------
Stacking final estimator: nnls1

file out_58248/results.dta saved


Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  ps  1  Y1_pystacked  D1_pystacked    -0.099    (0.017)
  ss  1  [shortstack]          [ss]    -0.100    (0.017)
  ps  1   [poolstack]          [ps]    -0.099    (0.017)

Poolstack DDML model
y-E[y|X]  = y-Y_lnearn_ps_1                        Number of obs   =      4836
D-E[D|X]  = D-D_gender_r_ps_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0993121   .0169781    -5.85   0.000    -.1325886   -.0660357
       _cons |  -.0020034   .0063368    -0.32   0.752    -.0144232    .0104165
------------------------------------------------------------------------------
Stacking final estimator: nnls1

file out_58248/results.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: nnls1
               learner  mean_weight        rep_1
      ols            1    .08712594    .08712594
      ols            2    1.145e-16    1.145e-16
  lassocv            3    .24647955    .24647955
  ridgecv            4    1.669e-16    1.669e-16
  lassocv            5    8.901e-18    8.901e-18
  ridgecv            6    4.083e-17    4.083e-17
       rf            7    .42517333    .42517333
       rf            8    1.237e-17    1.237e-17
       rf            9    9.203e-17    9.203e-17
gradboost           10     .0152533     .0152533
gradboost           11     .1905987     .1905987
     nnet           12    .02021284    .02021284
     nnet           13    .01515635    .01515635

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: nnls1
               learner  mean_weight        rep_1
      ols            1    .02911728    .02911728
      ols            2    8.367e-17    8.367e-17
  lassocv            3    .02109865    .02109865
  ridgecv            4    .02802873    .02802873
  lassocv            5    .12590853    .12590853
  ridgecv            6    .22768634    .22768634
       rf            7    .39965009    .39965009
       rf            8    6.894e-17    6.894e-17
       rf            9    1.066e-16    1.066e-16
gradboost           10    .02223415    .02223415
gradboost           11    .10065799    .10065799
     nnet           12    .00425219    .00425219
     nnet           13    .04136605    .04136605

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: nnls1
               learner  mean_weight        rep_1
      ols            1    .08712594    .08712594
      ols            2    1.145e-16    1.145e-16
  lassocv            3    .24647955    .24647955
  ridgecv            4    1.669e-16    1.669e-16
  lassocv            5    8.901e-18    8.901e-18
  ridgecv            6    4.083e-17    4.083e-17
       rf            7    .42517333    .42517333
       rf            8    1.237e-17    1.237e-17
       rf            9    9.203e-17    9.203e-17
gradboost           10     .0152533     .0152533
gradboost           11     .1905987     .1905987
     nnet           12    .02021284    .02021284
     nnet           13    .01515635    .01515635

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: nnls1
               learner  mean_weight        rep_1
      ols            1    .02911728    .02911728
      ols            2    8.367e-17    8.367e-17
  lassocv            3    .02109865    .02109865
  ridgecv            4    .02802873    .02802873
  lassocv            5    .12590853    .12590853
  ridgecv            6    .22768634    .22768634
       rf            7    .39965009    .39965009
       rf            8    6.894e-17    6.894e-17
       rf            9    1.066e-16    1.066e-16
gradboost           10    .02223415    .02223415
gradboost           11    .10065799    .10065799
     nnet           12    .00425219    .00425219
     nnet           13    .04136605    .04136605

Y1_pystacked_w_mn[13,3]
               learner  mean_weight        rep_1
      ols            1    .02911728    .02911728
      ols            2    8.367e-17    8.367e-17
  lassocv            3    .02109865    .02109865
  ridgecv            4    .02802873    .02802873
  lassocv            5    .12590853    .12590853
  ridgecv            6    .22768634    .22768634
       rf            7    .39965009    .39965009
       rf            8    6.894e-17    6.894e-17
       rf            9    1.066e-16    1.066e-16
gradboost           10    .02223415    .02223415
gradboost           11    .10065799    .10065799
     nnet           12    .00425219    .00425219
     nnet           13    .04136605    .04136605

      +--------------------------------+
      | Y1_pys~1   Y1_pys~2   Y1_pys~3 |
      |--------------------------------|
   1. |        1   .0291173   .0291173 |
   2. |        2   8.37e-17   8.37e-17 |
   3. |        3   .0210986   .0210986 |
   4. |        4   .0280287   .0280287 |
      +--------------------------------+
(note: file out_58248/Y1_pystacked_w_mn_nnls1_regular.dta not found)
file out_58248/Y1_pystacked_w_mn_nnls1_regular.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: nnls1
               learner  mean_weight        rep_1
      ols            1    .08712594    .08712594
      ols            2    1.145e-16    1.145e-16
  lassocv            3    .24647955    .24647955
  ridgecv            4    1.669e-16    1.669e-16
  lassocv            5    8.901e-18    8.901e-18
  ridgecv            6    4.083e-17    4.083e-17
       rf            7    .42517333    .42517333
       rf            8    1.237e-17    1.237e-17
       rf            9    9.203e-17    9.203e-17
gradboost           10     .0152533     .0152533
gradboost           11     .1905987     .1905987
     nnet           12    .02021284    .02021284
     nnet           13    .01515635    .01515635

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: nnls1
               learner  mean_weight        rep_1
      ols            1    .02911728    .02911728
      ols            2    8.367e-17    8.367e-17
  lassocv            3    .02109865    .02109865
  ridgecv            4    .02802873    .02802873
  lassocv            5    .12590853    .12590853
  ridgecv            6    .22768634    .22768634
       rf            7    .39965009    .39965009
       rf            8    6.894e-17    6.894e-17
       rf            9    1.066e-16    1.066e-16
gradboost           10    .02223415    .02223415
gradboost           11    .10065799    .10065799
     nnet           12    .00425219    .00425219
     nnet           13    .04136605    .04136605

D1_pystacked_w_mn[13,3]
               learner  mean_weight        rep_1
      ols            1    .08712594    .08712594
      ols            2    1.145e-16    1.145e-16
  lassocv            3    .24647955    .24647955
  ridgecv            4    1.669e-16    1.669e-16
  lassocv            5    8.901e-18    8.901e-18
  ridgecv            6    4.083e-17    4.083e-17
       rf            7    .42517333    .42517333
       rf            8    1.237e-17    1.237e-17
       rf            9    9.203e-17    9.203e-17
gradboost           10     .0152533     .0152533
gradboost           11     .1905987     .1905987
     nnet           12    .02021284    .02021284
     nnet           13    .01515635    .01515635

      +--------------------------------+
      | D1_pys~1   D1_pys~2   D1_pys~3 |
      |--------------------------------|
   1. |        1   .0871259   .0871259 |
   2. |        2   1.15e-16   1.15e-16 |
   3. |        3   .2464795   .2464795 |
   4. |        4   1.67e-16   1.67e-16 |
      +--------------------------------+
(note: file out_58248/D1_pystacked_w_mn_nnls1_regular.dta not found)
file out_58248/D1_pystacked_w_mn_nnls1_regular.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: nnls1
               learner  mean_weight        rep_1
      ols            1     .0332601     .0332601
      ols            2            0            0
  lassocv            3    .29381423    .29381423
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7    .38628556    .38628556
       rf            8    7.266e-18    7.266e-18
       rf            9            0            0
gradboost           10            0            0
gradboost           11    .27491552    .27491552
     nnet           12    2.956e-16    2.956e-16
     nnet           13    .01172458    .01172458

short-stacked weights across resamples for lnearn
final stacking estimator: nnls1
               learner  mean_weight        rep_1
      ols            1    3.091e-17    3.091e-17
      ols            2            0            0
  lassocv            3    .11525086    .11525086
  ridgecv            4    .20874685    .20874685
  lassocv            5    2.138e-16    2.138e-16
  ridgecv            6    7.925e-16    7.925e-16
       rf            7    .41282463    .41282463
       rf            8    5.464e-16    5.464e-16
       rf            9            0            0
gradboost           10    .04938193    .04938193
gradboost           11     .1848083     .1848083
     nnet           12    1.756e-17    1.756e-17
     nnet           13    .02898744    .02898744

Y_lnearn_ss[13,3]
               learner  mean_weight        rep_1
      ols            1    3.091e-17    3.091e-17
      ols            2            0            0
  lassocv            3    .11525086    .11525086
  ridgecv            4    .20874685    .20874685
  lassocv            5    2.138e-16    2.138e-16
  ridgecv            6    7.925e-16    7.925e-16
       rf            7    .41282463    .41282463
       rf            8    5.464e-16    5.464e-16
       rf            9            0            0
gradboost           10    .04938193    .04938193
gradboost           11     .1848083     .1848083
     nnet           12    1.756e-17    1.756e-17
     nnet           13    .02898744    .02898744

      +--------------------------------------------+
      | Y_lnea~_1   Y_lne~s1   Y_lnea~2   Y_lnea~3 |
      |--------------------------------------------|
   1. | 2.5968625          1   3.09e-17   3.09e-17 |
   2. | 3.1248575          2          0          0 |
   3. | 2.8489745          3   .1152509   .1152509 |
   4. | 2.4998811          4   .2087469   .2087469 |
      +--------------------------------------------+
(note: file out_58248/Y_lnearn_ss_nnls1_short.dta not found)
file out_58248/Y_lnearn_ss_nnls1_short.dta saved

D_gender_r_ss[13,3]
               learner  mean_weight        rep_1
      ols            1     .0332601     .0332601
      ols            2            0            0
  lassocv            3    .29381423    .29381423
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7    .38628556    .38628556
       rf            8    7.266e-18    7.266e-18
       rf            9            0            0
gradboost           10            0            0
gradboost           11    .27491552    .27491552
     nnet           12    2.956e-16    2.956e-16
     nnet           13    .01172458    .01172458

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. |  .7235631          1   .0332601   .0332601 |
   2. | .42861215          2          0          0 |
   3. | .14879868          3   .2938142   .2938142 |
   4. | .26523175          4          0          0 |
      +--------------------------------------------+
(note: file out_58248/D_gender_r_ss_nnls1_short.dta not found)
file out_58248/D_gender_r_ss_nnls1_short.dta saved

Y_lnearn_ps[13,3]
               learner  mean_weight        rep_1
      ols            1            0            0
      ols            2            0            0
  lassocv            3    .19686617    .19686617
  ridgecv            4            0            0
  lassocv            5    4.820e-16    4.820e-16
  ridgecv            6    .19616413    .19616413
       rf            7    .44194277    .44194277
       rf            8    3.836e-16    3.836e-16
       rf            9            0            0
gradboost           10    3.555e-16    3.555e-16
gradboost           11    .12256877    .12256877
     nnet           12            0            0
     nnet           13    .04245816    .04245816

      +--------------------------------------------+
      | Y_lnea~_1   Y_lne~s1   Y_lnea~2   Y_lnea~3 |
      |--------------------------------------------|
   1. | 2.5919112          1          0          0 |
   2. | 3.1193507          2          0          0 |
   3. | 2.8619758          3   .1968662   .1968662 |
   4. | 2.4965502          4          0          0 |
      +--------------------------------------------+
(note: file out_58248/Y_lnearn_ps_nnls1_pooled.dta not found)
file out_58248/Y_lnearn_ps_nnls1_pooled.dta saved

D_gender_r_ps[13,3]
               learner  mean_weight        rep_1
      ols            1    .02951944    .02951944
      ols            2    2.860e-15    2.860e-15
  lassocv            3    .32476756    .32476756
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7    .42497468    .42497468
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11    .21195485    .21195485
     nnet           12            0            0
     nnet           13    .00878347    .00878347

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .72228958          1   .0295194   .0295194 |
   2. | .43418216          2   2.86e-15   2.86e-15 |
   3. | .15897518          3   .3247676   .3247676 |
   4. | .26767686          4          0          0 |
      +--------------------------------------------+
(note: file out_58248/D_gender_r_ps_nnls1_pooled.dta not found)
file out_58248/D_gender_r_ps_nnls1_pooled.dta saved


Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  st  1  Y1_pystacked  D1_pystacked    -0.088    (0.026)
  ss  1  [shortstack]          [ss]    -0.103    (0.017)
  ps  1   [poolstack]          [ps]    -0.103    (0.017)

Shortstack DDML model
y-E[y|X]  = y-Y_lnearn_ss_1                        Number of obs   =      4836
D-E[D|X]  = D-D_gender_r_ss_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1031861   .0165565    -6.23   0.000    -.1356362    -.070736
       _cons |  -.0038716   .0063873    -0.61   0.544    -.0163905    .0086473
------------------------------------------------------------------------------
Stacking final estimator: singlebest



Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  st  1  Y1_pystacked  D1_pystacked    -0.088    (0.026)
  ss  1  [shortstack]          [ss]    -0.103    (0.017)
  ps  1   [poolstack]          [ps]    -0.103    (0.017)

Stacking DDML model
y-E[y|X]  = y-Y1_pystacked_1                       Number of obs   =      4836
D-E[D|X]  = D-D1_pystacked_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0878081    .026354    -3.33   0.001     -.139461   -.0361552
       _cons |    .006557   .0083775     0.78   0.434    -.0098627    .0229767
------------------------------------------------------------------------------
Stacking final estimator: singlebest

file out_58248/results.dta saved


Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  ss  1  Y1_pystacked  D1_pystacked    -0.103    (0.017)
  ss  1  [shortstack]          [ss]    -0.103    (0.017)
  ps  1   [poolstack]          [ps]    -0.103    (0.017)

Shortstack DDML model
y-E[y|X]  = y-Y_lnearn_ss_1                        Number of obs   =      4836
D-E[D|X]  = D-D_gender_r_ss_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1031861   .0165565    -6.23   0.000    -.1356362    -.070736
       _cons |  -.0038716   .0063873    -0.61   0.544    -.0163905    .0086473
------------------------------------------------------------------------------
Stacking final estimator: singlebest

file out_58248/results.dta saved


Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  ps  1  Y1_pystacked  D1_pystacked    -0.103    (0.017)
  ss  1  [shortstack]          [ss]    -0.103    (0.017)
  ps  1   [poolstack]          [ps]    -0.103    (0.017)

Poolstack DDML model
y-E[y|X]  = y-Y_lnearn_ps_1                        Number of obs   =      4836
D-E[D|X]  = D-D_gender_r_ps_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1031861   .0165565    -6.23   0.000    -.1356362    -.070736
       _cons |  -.0038716   .0063873    -0.61   0.544    -.0163905    .0086473
------------------------------------------------------------------------------
Stacking final estimator: singlebest

file out_58248/results.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: singlebest
               learner  mean_weight        rep_1
      ols            1            0            0
      ols            2            0            0
  lassocv            3           .4           .4
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7           .6           .6
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: singlebest
               learner  mean_weight        rep_1
      ols            1            0            0
      ols            2            0            0
  lassocv            3            0            0
  ridgecv            4            0            0
  lassocv            5           .4           .4
  ridgecv            6           .2           .2
       rf            7           .4           .4
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: singlebest
               learner  mean_weight        rep_1
      ols            1            0            0
      ols            2            0            0
  lassocv            3           .4           .4
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7           .6           .6
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: singlebest
               learner  mean_weight        rep_1
      ols            1            0            0
      ols            2            0            0
  lassocv            3            0            0
  ridgecv            4            0            0
  lassocv            5           .4           .4
  ridgecv            6           .2           .2
       rf            7           .4           .4
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

Y1_pystacked_w_mn[13,3]
               learner  mean_weight        rep_1
      ols            1            0            0
      ols            2            0            0
  lassocv            3            0            0
  ridgecv            4            0            0
  lassocv            5           .4           .4
  ridgecv            6           .2           .2
       rf            7           .4           .4
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

      +--------------------------------+
      | Y1_pys~1   Y1_pys~2   Y1_pys~3 |
      |--------------------------------|
   1. |        1          0          0 |
   2. |        2          0          0 |
   3. |        3          0          0 |
   4. |        4          0          0 |
      +--------------------------------+
(note: file out_58248/Y1_pystacked_w_mn_singlebest_regular.dta not found)
file out_58248/Y1_pystacked_w_mn_singlebest_regular.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: singlebest
               learner  mean_weight        rep_1
      ols            1            0            0
      ols            2            0            0
  lassocv            3           .4           .4
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7           .6           .6
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: singlebest
               learner  mean_weight        rep_1
      ols            1            0            0
      ols            2            0            0
  lassocv            3            0            0
  ridgecv            4            0            0
  lassocv            5           .4           .4
  ridgecv            6           .2           .2
       rf            7           .4           .4
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

D1_pystacked_w_mn[13,3]
               learner  mean_weight        rep_1
      ols            1            0            0
      ols            2            0            0
  lassocv            3           .4           .4
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7           .6           .6
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

      +--------------------------------+
      | D1_pys~1   D1_pys~2   D1_pys~3 |
      |--------------------------------|
   1. |        1          0          0 |
   2. |        2          0          0 |
   3. |        3         .4         .4 |
   4. |        4          0          0 |
      +--------------------------------+
(note: file out_58248/D1_pystacked_w_mn_singlebest_regular.dta not found)
file out_58248/D1_pystacked_w_mn_singlebest_regular.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: singlebest
               learner  mean_weight        rep_1
      ols            1            0            0
      ols            2            0            0
  lassocv            3            0            0
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            1            1
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

short-stacked weights across resamples for lnearn
final stacking estimator: singlebest
               learner  mean_weight        rep_1
      ols            1            0            0
      ols            2            0            0
  lassocv            3            0            0
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            1            1
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

Y_lnearn_ss[13,3]
               learner  mean_weight        rep_1
      ols            1            0            0
      ols            2            0            0
  lassocv            3            0            0
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            1            1
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

      +--------------------------------------------+
      | Y_lnea~_1   Y_lne~s1   Y_lnea~2   Y_lnea~3 |
      |--------------------------------------------|
   1. | 2.5787296          1          0          0 |
   2. | 3.0427768          2          0          0 |
   3. |   2.85638          3          0          0 |
   4. | 2.5449724          4          0          0 |
      +--------------------------------------------+
(note: file out_58248/Y_lnearn_ss_singlebest_short.dta not found)
file out_58248/Y_lnearn_ss_singlebest_short.dta saved

D_gender_r_ss[13,3]
               learner  mean_weight        rep_1
      ols            1            0            0
      ols            2            0            0
  lassocv            3            0            0
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            1            1
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .76200002          1          0          0 |
   2. | .50800002          2          0          0 |
   3. |      .182          3          0          0 |
   4. | .19400001          4          0          0 |
      +--------------------------------------------+
(note: file out_58248/D_gender_r_ss_singlebest_short.dta not found)
file out_58248/D_gender_r_ss_singlebest_short.dta saved

Y_lnearn_ps[13,3]
               learner  mean_weight        rep_1
      ols            1            0            0
      ols            2            0            0
  lassocv            3            0            0
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            1            1
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

      +--------------------------------------------+
      | Y_lnea~_1   Y_lne~s1   Y_lnea~2   Y_lnea~3 |
      |--------------------------------------------|
   1. | 2.5787296          1          0          0 |
   2. | 3.0427768          2          0          0 |
   3. |   2.85638          3          0          0 |
   4. | 2.5449724          4          0          0 |
      +--------------------------------------------+
(note: file out_58248/Y_lnearn_ps_singlebest_pooled.dta not found)
file out_58248/Y_lnearn_ps_singlebest_pooled.dta saved

D_gender_r_ps[13,3]
               learner  mean_weight        rep_1
      ols            1            0            0
      ols            2            0            0
  lassocv            3            0            0
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            1            1
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .76200002          1          0          0 |
   2. | .50800002          2          0          0 |
   3. |      .182          3          0          0 |
   4. | .19400001          4          0          0 |
      +--------------------------------------------+
(note: file out_58248/D_gender_r_ps_singlebest_pooled.dta not found)
file out_58248/D_gender_r_ps_singlebest_pooled.dta saved


Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  st  1  Y1_pystacked  D1_pystacked    -0.711    (0.038)
  ss  1  [shortstack]          [ss]    -0.103    (0.017)
  ps  1   [poolstack]          [ps]    -0.103    (0.017)

Shortstack DDML model
y-E[y|X]  = y-Y_lnearn_ss_1                        Number of obs   =      4836
D-E[D|X]  = D-D_gender_r_ss_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1029717   .0166729    -6.18   0.000      -.13565   -.0702933
       _cons |  -.0384358   .0062572    -6.14   0.000    -.0506997   -.0261719
------------------------------------------------------------------------------
Stacking final estimator: ols



Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  st  1  Y1_pystacked  D1_pystacked    -0.711    (0.038)
  ss  1  [shortstack]          [ss]    -0.103    (0.017)
  ps  1   [poolstack]          [ps]    -0.103    (0.017)

Stacking DDML model
y-E[y|X]  = y-Y1_pystacked_1                       Number of obs   =      4836
D-E[D|X]  = D-D1_pystacked_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.7107652   .0378466   -18.78   0.000    -.7849433   -.6365871
       _cons |   .1813075   .0259754     6.98   0.000     .1303966    .2322185
------------------------------------------------------------------------------
Stacking final estimator: ols

(note: variable final was str3, now str10 to accommodate using data's values)
file out_58248/results.dta saved


Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  ss  1  Y1_pystacked  D1_pystacked    -0.103    (0.017)
  ss  1  [shortstack]          [ss]    -0.103    (0.017)
  ps  1   [poolstack]          [ps]    -0.103    (0.017)

Shortstack DDML model
y-E[y|X]  = y-Y_lnearn_ss_1                        Number of obs   =      4836
D-E[D|X]  = D-D_gender_r_ss_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1029717   .0166729    -6.18   0.000      -.13565   -.0702933
       _cons |  -.0384358   .0062572    -6.14   0.000    -.0506997   -.0261719
------------------------------------------------------------------------------
Stacking final estimator: ols

(note: variable final was str3, now str10 to accommodate using data's values)
file out_58248/results.dta saved


Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  ps  1  Y1_pystacked  D1_pystacked    -0.103    (0.017)
  ss  1  [shortstack]          [ss]    -0.103    (0.017)
  ps  1   [poolstack]          [ps]    -0.103    (0.017)

Poolstack DDML model
y-E[y|X]  = y-Y_lnearn_ps_1                        Number of obs   =      4836
D-E[D|X]  = D-D_gender_r_ps_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1030659   .0167574    -6.15   0.000    -.1359098    -.070222
       _cons |  -.0414021   .0062077    -6.67   0.000    -.0535689   -.0292352
------------------------------------------------------------------------------
Stacking final estimator: ols

(note: variable final was str3, now str10 to accommodate using data's values)
file out_58248/results.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: ols
               learner  mean_weight        rep_1
      ols            1    .06477618    .06477618
      ols            2    .17690024    .17690024
  lassocv            3    .48629405    .48629405
  ridgecv            4    .11389523    .11389523
  lassocv            5   -.31693345   -.31693345
  ridgecv            6   -.03367933   -.03367933
       rf            7    .53787477    .53787477
       rf            8    .58348245    .58348245
       rf            9   -.72626694   -.72626694
gradboost           10    .08049768    .08049768
gradboost           11    .10827777    .10827777
     nnet           12   -.50883637   -.50883637
     nnet           13    .00919066    .00919066

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: ols
               learner  mean_weight        rep_1
      ols            1    .01709288    .01709288
      ols            2   -.01549514   -.01549514
  lassocv            3   -.19567133   -.19567133
  ridgecv            4    .25352653    .25352653
  lassocv            5    .22739484    .22739484
  ridgecv            6    .18374543    .18374543
       rf            7    .51381849    .51381849
       rf            8    .50504171    .50504171
       rf            9   -.63038238   -.63038238
gradboost           10    .06666419    .06666419
gradboost           11    .04444819    .04444819
     nnet           12   -.00045635   -.00045635
     nnet           13    .03068977    .03068977

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: ols
               learner  mean_weight        rep_1
      ols            1    .06477618    .06477618
      ols            2    .17690024    .17690024
  lassocv            3    .48629405    .48629405
  ridgecv            4    .11389523    .11389523
  lassocv            5   -.31693345   -.31693345
  ridgecv            6   -.03367933   -.03367933
       rf            7    .53787477    .53787477
       rf            8    .58348245    .58348245
       rf            9   -.72626694   -.72626694
gradboost           10    .08049768    .08049768
gradboost           11    .10827777    .10827777
     nnet           12   -.50883637   -.50883637
     nnet           13    .00919066    .00919066

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: ols
               learner  mean_weight        rep_1
      ols            1    .01709288    .01709288
      ols            2   -.01549514   -.01549514
  lassocv            3   -.19567133   -.19567133
  ridgecv            4    .25352653    .25352653
  lassocv            5    .22739484    .22739484
  ridgecv            6    .18374543    .18374543
       rf            7    .51381849    .51381849
       rf            8    .50504171    .50504171
       rf            9   -.63038238   -.63038238
gradboost           10    .06666419    .06666419
gradboost           11    .04444819    .04444819
     nnet           12   -.00045635   -.00045635
     nnet           13    .03068977    .03068977

Y1_pystacked_w_mn[13,3]
               learner  mean_weight        rep_1
      ols            1    .01709288    .01709288
      ols            2   -.01549514   -.01549514
  lassocv            3   -.19567133   -.19567133
  ridgecv            4    .25352653    .25352653
  lassocv            5    .22739484    .22739484
  ridgecv            6    .18374543    .18374543
       rf            7    .51381849    .51381849
       rf            8    .50504171    .50504171
       rf            9   -.63038238   -.63038238
gradboost           10    .06666419    .06666419
gradboost           11    .04444819    .04444819
     nnet           12   -.00045635   -.00045635
     nnet           13    .03068977    .03068977

      +----------------------------------+
      | Y1_pys~1   Y1_pyst~2   Y1_pyst~3 |
      |----------------------------------|
   1. |        1    .0170929    .0170929 |
   2. |        2   -.0154951   -.0154951 |
   3. |        3   -.1956713   -.1956713 |
   4. |        4    .2535265    .2535265 |
      +----------------------------------+
(note: file out_58248/Y1_pystacked_w_mn_ols_regular.dta not found)
file out_58248/Y1_pystacked_w_mn_ols_regular.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: ols
               learner  mean_weight        rep_1
      ols            1    .06477618    .06477618
      ols            2    .17690024    .17690024
  lassocv            3    .48629405    .48629405
  ridgecv            4    .11389523    .11389523
  lassocv            5   -.31693345   -.31693345
  ridgecv            6   -.03367933   -.03367933
       rf            7    .53787477    .53787477
       rf            8    .58348245    .58348245
       rf            9   -.72626694   -.72626694
gradboost           10    .08049768    .08049768
gradboost           11    .10827777    .10827777
     nnet           12   -.50883637   -.50883637
     nnet           13    .00919066    .00919066

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: ols
               learner  mean_weight        rep_1
      ols            1    .01709288    .01709288
      ols            2   -.01549514   -.01549514
  lassocv            3   -.19567133   -.19567133
  ridgecv            4    .25352653    .25352653
  lassocv            5    .22739484    .22739484
  ridgecv            6    .18374543    .18374543
       rf            7    .51381849    .51381849
       rf            8    .50504171    .50504171
       rf            9   -.63038238   -.63038238
gradboost           10    .06666419    .06666419
gradboost           11    .04444819    .04444819
     nnet           12   -.00045635   -.00045635
     nnet           13    .03068977    .03068977

D1_pystacked_w_mn[13,3]
               learner  mean_weight        rep_1
      ols            1    .06477618    .06477618
      ols            2    .17690024    .17690024
  lassocv            3    .48629405    .48629405
  ridgecv            4    .11389523    .11389523
  lassocv            5   -.31693345   -.31693345
  ridgecv            6   -.03367933   -.03367933
       rf            7    .53787477    .53787477
       rf            8    .58348245    .58348245
       rf            9   -.72626694   -.72626694
gradboost           10    .08049768    .08049768
gradboost           11    .10827777    .10827777
     nnet           12   -.50883637   -.50883637
     nnet           13    .00919066    .00919066

      +--------------------------------+
      | D1_pys~1   D1_pys~2   D1_pys~3 |
      |--------------------------------|
   1. |        1   .0647762   .0647762 |
   2. |        2   .1769002   .1769002 |
   3. |        3   .4862941   .4862941 |
   4. |        4   .1138952   .1138952 |
      +--------------------------------+
(note: file out_58248/D1_pystacked_w_mn_ols_regular.dta not found)
file out_58248/D1_pystacked_w_mn_ols_regular.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: ols
               learner  mean_weight        rep_1
      ols            1    .09652853    .09652853
      ols            2    .15172399    .15172399
  lassocv            3    .69249714    .69249714
  ridgecv            4    .03426055    .03426055
  lassocv            5   -.57403216   -.57403216
  ridgecv            6    .05020466    .05020466
       rf            7    .50623451    .50623451
       rf            8    .53301507    .53301507
       rf            9   -.64940328   -.64940328
gradboost           10     .0421986     .0421986
gradboost           11    .19568292    .19568292
     nnet           12     .1062075     .1062075
     nnet           13    .00721849    .00721849

short-stacked weights across resamples for lnearn
final stacking estimator: ols
               learner  mean_weight        rep_1
      ols            1   -.02799478   -.02799478
      ols            2    .02050134    .02050134
  lassocv            3    .19962325    .19962325
  ridgecv            4   -.03322697   -.03322697
  lassocv            5   -.28299944   -.28299944
  ridgecv            6    .58743853    .58743853
       rf            7    .53815008    .53815008
       rf            8    .07381128    .07381128
       rf            9   -.31562121   -.31562121
gradboost           10    .17814755    .17814755
gradboost           11     .0608958     .0608958
     nnet           12    .00146434    .00146434
     nnet           13    .00828581    .00828581

Y_lnearn_ss[13,3]
               learner  mean_weight        rep_1
      ols            1   -.02799478   -.02799478
      ols            2    .02050134    .02050134
  lassocv            3    .19962325    .19962325
  ridgecv            4   -.03322697   -.03322697
  lassocv            5   -.28299944   -.28299944
  ridgecv            6    .58743853    .58743853
       rf            7    .53815008    .53815008
       rf            8    .07381128    .07381128
       rf            9   -.31562121   -.31562121
gradboost           10    .17814755    .17814755
gradboost           11     .0608958     .0608958
     nnet           12    .00146434    .00146434
     nnet           13    .00828581    .00828581

      +----------------------------------------------+
      | Y_lnea~_1   Y_lne~s1   Y_lnear~2   Y_lnear~3 |
      |----------------------------------------------|
   1. | 2.6160353          1   -.0279948   -.0279948 |
   2. | 3.1756669          2    .0205013    .0205013 |
   3. | 2.8717777          3    .1996232    .1996232 |
   4. | 2.5057088          4    -.033227    -.033227 |
      +----------------------------------------------+
(note: file out_58248/Y_lnearn_ss_ols_short.dta not found)
file out_58248/Y_lnearn_ss_ols_short.dta saved

D_gender_r_ss[13,3]
               learner  mean_weight        rep_1
      ols            1    .09652853    .09652853
      ols            2    .15172399    .15172399
  lassocv            3    .69249714    .69249714
  ridgecv            4    .03426055    .03426055
  lassocv            5   -.57403216   -.57403216
  ridgecv            6    .05020466    .05020466
       rf            7    .50623451    .50623451
       rf            8    .53301507    .53301507
       rf            9   -.64940328   -.64940328
gradboost           10     .0421986     .0421986
gradboost           11    .19568292    .19568292
     nnet           12     .1062075     .1062075
     nnet           13    .00721849    .00721849

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .82881395          1   .0965285   .0965285 |
   2. | .54232729          2    .151724    .151724 |
   3. |  .2172212          3   .6924971   .6924971 |
   4. | .28587419          4   .0342606   .0342606 |
      +--------------------------------------------+
(note: file out_58248/D_gender_r_ss_ols_short.dta not found)
file out_58248/D_gender_r_ss_ols_short.dta saved

Y_lnearn_ps[13,3]
               learner  mean_weight        rep_1
      ols            1   -.01408966   -.01408966
      ols            2    -.0163293    -.0163293
  lassocv            3    .04509878    .04509878
  ridgecv            4    .29644579    .29644579
  lassocv            5   -.06015606   -.06015606
  ridgecv            6    .19071391    .19071391
       rf            7     .5313427     .5313427
       rf            8    .50756188    .50756188
       rf            9   -.64332656   -.64332656
gradboost           10    .07780863    .07780863
gradboost           11    .05710047    .05710047
     nnet           12    .00550741    .00550741
     nnet           13    .03352003    .03352003

      +----------------------------------------------+
      | Y_lnea~_1   Y_lne~s1   Y_lnear~2   Y_lnear~3 |
      |----------------------------------------------|
   1. | 2.5838514          1   -.0140897   -.0140897 |
   2. | 3.1504409          2   -.0163293   -.0163293 |
   3. | 2.8884285          3    .0450988    .0450988 |
   4. | 2.5191142          4    .2964458    .2964458 |
      +----------------------------------------------+
(note: file out_58248/Y_lnearn_ps_ols_pooled.dta not found)
file out_58248/Y_lnearn_ps_ols_pooled.dta saved

D_gender_r_ps[13,3]
               learner  mean_weight        rep_1
      ols            1    .02126548    .02126548
      ols            2     .1856198     .1856198
  lassocv            3    .42948773    .42948773
  ridgecv            4    .10217204    .10217204
  lassocv            5   -.23870944   -.23870944
  ridgecv            6    .00722337    .00722337
       rf            7      .546081      .546081
       rf            8    .60477812    .60477812
       rf            9   -.75708008   -.75708008
gradboost           10    .08226925    .08226925
gradboost           11    .11721453    .11721453
     nnet           12    .02507558    .02507558
     nnet           13    .00520849    .00520849

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .79367375          1   .0212655   .0212655 |
   2. | .50403378          2   .1856198   .1856198 |
   3. | .18665086          3   .4294877   .4294877 |
   4. | .24081088          4    .102172    .102172 |
      +--------------------------------------------+
(note: file out_58248/D_gender_r_ps_ols_pooled.dta not found)
file out_58248/D_gender_r_ps_ols_pooled.dta saved


Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  st  1  Y1_pystacked  D1_pystacked    -0.093    (0.019)
  ss  1  [shortstack]          [ss]    -0.093    (0.019)
  ps  1   [poolstack]          [ps]    -0.093    (0.019)

Shortstack DDML model
y-E[y|X]  = y-Y_lnearn_ss_1                        Number of obs   =      4836
D-E[D|X]  = D-D_gender_r_ss_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |   -.092787   .0192442    -4.82   0.000    -.1305049    -.055069
       _cons |   .0008645   .0064601     0.13   0.894    -.0117971    .0135261
------------------------------------------------------------------------------
Stacking final estimator: avg



Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  st  1  Y1_pystacked  D1_pystacked    -0.093    (0.019)
  ss  1  [shortstack]          [ss]    -0.093    (0.019)
  ps  1   [poolstack]          [ps]    -0.093    (0.019)

Stacking DDML model
y-E[y|X]  = y-Y1_pystacked_1                       Number of obs   =      4836
D-E[D|X]  = D-D1_pystacked_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |   -.092787   .0192442    -4.82   0.000    -.1305049    -.055069
       _cons |   .0008645   .0064601     0.13   0.894    -.0117971    .0135261
------------------------------------------------------------------------------
Stacking final estimator: avg

(note: variable final was str3, now str10 to accommodate using data's values)
file out_58248/results.dta saved


Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  ss  1  Y1_pystacked  D1_pystacked    -0.093    (0.019)
  ss  1  [shortstack]          [ss]    -0.093    (0.019)
  ps  1   [poolstack]          [ps]    -0.093    (0.019)

Shortstack DDML model
y-E[y|X]  = y-Y_lnearn_ss_1                        Number of obs   =      4836
D-E[D|X]  = D-D_gender_r_ss_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |   -.092787   .0192442    -4.82   0.000    -.1305049    -.055069
       _cons |   .0008645   .0064601     0.13   0.894    -.0117971    .0135261
------------------------------------------------------------------------------
Stacking final estimator: avg

(note: variable final was str3, now str10 to accommodate using data's values)
file out_58248/results.dta saved


Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  ps  1  Y1_pystacked  D1_pystacked    -0.093    (0.019)
  ss  1  [shortstack]          [ss]    -0.093    (0.019)
  ps  1   [poolstack]          [ps]    -0.093    (0.019)

Poolstack DDML model
y-E[y|X]  = y-Y_lnearn_ps_1                        Number of obs   =      4836
D-E[D|X]  = D-D_gender_r_ps_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |   -.092787   .0192442    -4.82   0.000    -.1305049    -.055069
       _cons |   .0008645   .0064601     0.13   0.894    -.0117971    .0135261
------------------------------------------------------------------------------
Stacking final estimator: avg

(note: variable final was str3, now str10 to accommodate using data's values)
file out_58248/results.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: avg
               learner  mean_weight        rep_1
      ols            1    .07692308    .07692308
      ols            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: avg
               learner  mean_weight        rep_1
      ols            1    .07692308    .07692308
      ols            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: avg
               learner  mean_weight        rep_1
      ols            1    .07692308    .07692308
      ols            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: avg
               learner  mean_weight        rep_1
      ols            1    .07692308    .07692308
      ols            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

Y1_pystacked_w_mn[13,3]
               learner  mean_weight        rep_1
      ols            1    .07692308    .07692308
      ols            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

      +--------------------------------+
      | Y1_pys~1   Y1_pys~2   Y1_pys~3 |
      |--------------------------------|
   1. |        1   .0769231   .0769231 |
   2. |        2   .0769231   .0769231 |
   3. |        3   .0769231   .0769231 |
   4. |        4   .0769231   .0769231 |
      +--------------------------------+
(note: file out_58248/Y1_pystacked_w_mn_avg_regular.dta not found)
file out_58248/Y1_pystacked_w_mn_avg_regular.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: avg
               learner  mean_weight        rep_1
      ols            1    .07692308    .07692308
      ols            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: avg
               learner  mean_weight        rep_1
      ols            1    .07692308    .07692308
      ols            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

D1_pystacked_w_mn[13,3]
               learner  mean_weight        rep_1
      ols            1    .07692308    .07692308
      ols            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

      +--------------------------------+
      | D1_pys~1   D1_pys~2   D1_pys~3 |
      |--------------------------------|
   1. |        1   .0769231   .0769231 |
   2. |        2   .0769231   .0769231 |
   3. |        3   .0769231   .0769231 |
   4. |        4   .0769231   .0769231 |
      +--------------------------------+
(note: file out_58248/D1_pystacked_w_mn_avg_regular.dta not found)
file out_58248/D1_pystacked_w_mn_avg_regular.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: avg
               learner  mean_weight        rep_1
      ols            1    .07692308    .07692308
      ols            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

short-stacked weights across resamples for lnearn
final stacking estimator: avg
               learner  mean_weight        rep_1
      ols            1    .07692308    .07692308
      ols            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

Y_lnearn_ss[13,3]
               learner  mean_weight        rep_1
      ols            1    .07692308    .07692308
      ols            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

      +--------------------------------------------+
      | Y_lnea~_1   Y_lne~s1   Y_lnea~2   Y_lnea~3 |
      |--------------------------------------------|
   1. |  2.634673          1   .0769231   .0769231 |
   2. | 3.1122105          2   .0769231   .0769231 |
   3. | 2.8654285          3   .0769231   .0769231 |
   4. | 2.5275198          4   .0769231   .0769231 |
      +--------------------------------------------+
(note: file out_58248/Y_lnearn_ss_avg_short.dta not found)
file out_58248/Y_lnearn_ss_avg_short.dta saved

D_gender_r_ss[13,3]
               learner  mean_weight        rep_1
      ols            1    .07692308    .07692308
      ols            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. |  .6988641          1   .0769231   .0769231 |
   2. | .41998453          2   .0769231   .0769231 |
   3. | .17916551          3   .0769231   .0769231 |
   4. | .37871898          4   .0769231   .0769231 |
      +--------------------------------------------+
(note: file out_58248/D_gender_r_ss_avg_short.dta not found)
file out_58248/D_gender_r_ss_avg_short.dta saved

Y_lnearn_ps[13,3]
               learner  mean_weight        rep_1
      ols            1    .07692308    .07692308
      ols            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

      +--------------------------------------------+
      | Y_lnea~_1   Y_lne~s1   Y_lnea~2   Y_lnea~3 |
      |--------------------------------------------|
   1. |  2.634673          1   .0769231   .0769231 |
   2. | 3.1122105          2   .0769231   .0769231 |
   3. | 2.8654285          3   .0769231   .0769231 |
   4. | 2.5275198          4   .0769231   .0769231 |
      +--------------------------------------------+
(note: file out_58248/Y_lnearn_ps_avg_pooled.dta not found)
file out_58248/Y_lnearn_ps_avg_pooled.dta saved

D_gender_r_ps[13,3]
               learner  mean_weight        rep_1
      ols            1    .07692308    .07692308
      ols            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. |  .6988641          1   .0769231   .0769231 |
   2. | .41998453          2   .0769231   .0769231 |
   3. | .17916551          3   .0769231   .0769231 |
   4. | .37871898          4   .0769231   .0769231 |
      +--------------------------------------------+
(note: file out_58248/D_gender_r_ps_avg_pooled.dta not found)
file out_58248/D_gender_r_ps_avg_pooled.dta saved
. 
.         forvalues i = 1(1)$L {
  2.                         ddml estimate, y(Y1_pystacked_L`i'_1) ///
>                                                         d(D1_pystacked_L`i'_1
> ) robust
  3.                         regsave gender_r using `folder'/results.dta, ci //
> /
>                                                 addlabel(model,partial,seed,`
> seed',final,indiv,learner,`i') ///
>                                                 append
  4.         }

y-E[y|X]  = Y1_pystacked_L1_1                      Number of obs   =      4836
D-E[D|X]  = D1_pystacked_L1_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |   .0703647   .1070523     0.66   0.511     -.139454    .2801833
       _cons |   .0031543   .0072095     0.44   0.662     -.010976    .0172846
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_58248/results.dta saved

y-E[y|X]  = Y1_pystacked_L2_1                      Number of obs   =      4836
D-E[D|X]  = D1_pystacked_L2_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1216782    .015414    -7.89   0.000    -.1518892   -.0914673
       _cons |  -.0002658   .0068535    -0.04   0.969    -.0136984    .0131667
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_58248/results.dta saved

y-E[y|X]  = Y1_pystacked_L3_1                      Number of obs   =      4836
D-E[D|X]  = D1_pystacked_L3_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0979344   .0172754    -5.67   0.000    -.1317934   -.0640753
       _cons |   .0004939   .0064912     0.08   0.939    -.0122287    .0132164
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_58248/results.dta saved

y-E[y|X]  = Y1_pystacked_L4_1                      Number of obs   =      4836
D-E[D|X]  = D1_pystacked_L4_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0952055   .0168504    -5.65   0.000    -.1282316   -.0621793
       _cons |   .0000426   .0064263     0.01   0.995    -.0125528     .012638
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_58248/results.dta saved

y-E[y|X]  = Y1_pystacked_L5_1                      Number of obs   =      4836
D-E[D|X]  = D1_pystacked_L5_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |   .0081314   .0823968     0.10   0.921    -.1533635    .1696262
       _cons |   .0059476    .008305     0.72   0.474    -.0103299    .0222251
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_58248/results.dta saved

y-E[y|X]  = Y1_pystacked_L6_1                      Number of obs   =      4836
D-E[D|X]  = D1_pystacked_L6_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0169853    .062976    -0.27   0.787     -.140416    .1064453
       _cons |   .0018717   .0067686     0.28   0.782    -.0113945    .0151379
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_58248/results.dta saved

y-E[y|X]  = Y1_pystacked_L7_1                      Number of obs   =      4836
D-E[D|X]  = D1_pystacked_L7_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1031861   .0165565    -6.23   0.000    -.1356362    -.070736
       _cons |  -.0038716   .0063873    -0.61   0.544    -.0163905    .0086473
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_58248/results.dta saved

y-E[y|X]  = Y1_pystacked_L8_1                      Number of obs   =      4836
D-E[D|X]  = D1_pystacked_L8_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1110965   .0168911    -6.58   0.000    -.1442024   -.0779905
       _cons |  -.0002947    .006623    -0.04   0.965    -.0132756    .0126862
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_58248/results.dta saved

y-E[y|X]  = Y1_pystacked_L9_1                      Number of obs   =      4836
D-E[D|X]  = D1_pystacked_L9_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |   -.113966   .0167104    -6.82   0.000    -.1467177   -.0812142
       _cons |  -.0001978   .0067486    -0.03   0.977    -.0134247    .0130292
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_58248/results.dta saved

y-E[y|X]  = Y1_pystacked_L10_1                     Number of obs   =      4836
D-E[D|X]  = D1_pystacked_L10_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0844734   .0167884    -5.03   0.000    -.1173781   -.0515688
       _cons |  -.0014737   .0064394    -0.23   0.819    -.0140948    .0111474
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_58248/results.dta saved

y-E[y|X]  = Y1_pystacked_L11_1                     Number of obs   =      4836
D-E[D|X]  = D1_pystacked_L11_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0893818     .01683    -5.31   0.000     -.122368   -.0563955
       _cons |  -.0065287   .0065569    -1.00   0.319      -.01938    .0063226
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_58248/results.dta saved

y-E[y|X]  = Y1_pystacked_L12_1                     Number of obs   =      4836
D-E[D|X]  = D1_pystacked_L12_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1323006   .0167709    -7.89   0.000     -.165171   -.0994302
       _cons |   .0111203   .0079957     1.39   0.164     -.004551    .0267916
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_58248/results.dta saved

y-E[y|X]  = Y1_pystacked_L13_1                     Number of obs   =      4836
D-E[D|X]  = D1_pystacked_L13_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0089496    .043362    -0.21   0.836    -.0939375    .0760384
       _cons |   .0009256   .0078655     0.12   0.906    -.0144905    .0163416
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_58248/results.dta saved
. 
. }

.         
. *****************************************************************************
> *  
. *** interactive: estimation                                                  
>                                       ***
. *****************************************************************************
> *
.         
. if (`estimator'==2) {   
. 
.         ddml init interactive, kfolds($K) reps($R)
.         ddml E[Y|X,D]: pystacked lnearn $X_expanded $pystring_reg
.         ddml E[D|X]: pystacked gender_r $X_expanded $pystring_class
.         ddml crossfit, shortstack poolstack
.         ddml estimate, robust atet
. 
.         cap drop mse_*
.         foreach var of varlist Y1_pystacked0* {
  2.                  cap drop sqerr_`var'
  3.                  gen double sqerr_`var'=(lnearn-`var')^2 if gender_r==0
  4.                  sum sqerr_`var' if gender_r==0, meanonly
  5.                  gen double mse_`var'=r(mean) if _n ==1 
  6.         }
.         foreach var of varlist Y1_pystacked1* {
  2.                  cap drop sqerr_`var'
  3.                  gen double sqerr_`var'=(lnearn-`var')^2 if gender_r==1
  4.                  sum sqerr_`var' if gender_r==1, meanonly
  5.                  gen double mse_`var'=r(mean) if _n ==1 
  6.         }
.         foreach var of varlist D1_* {
  2.                  cap drop sqerr_`var'
  3.                  gen double sqerr_`var'=(gender_r-`var')^2
  4.                  sum sqerr_`var', meanonly
  5.                  gen double mse_`var'=r(mean) if _n ==1 
  6.         }
.         preserve
.                 keep mse_*
.                 keep if _n==1
.                 save `folder'/inter_mse, replace
.         restore
.         cap drop mse_*
.         
.         local mat gender_r_mse
.                         ddml extract, show(mse)
.                         mat `mat' = r(`mat')
.                         mat list `mat'
.                                 preserve
.                                 svmat `mat'
.                                 keep `mat'*
.                                 keep if _n<=$L
.                                 gen stack_type = "conventional" if _n==1
.                                 replace stack_type = "pooled" if _n==2
.                                 replace stack_type = "short" if _n==3
.                                 gen model = "interactive"
.                                 list if _n<=$L
.                                 save `folder'/`mat'_inter_gender_mse, replace
.                                 restore 
.                                 
.         local mat lnearn_mse
.                         ddml extract, show(mse)
.                         mat `mat' = r(`mat')
.                         mat list `mat'
.                                 preserve
.                                 svmat `mat'
.                                 keep `mat'*
.                                 keep if _n<=(2*$L)
.                                 gen stack_type = "conventional" if _n<=2
.                                 replace stack_type = "pooled" if _n>=3 & _n<=
> 4
.                                 replace stack_type = "short" if _n>4
.                                 gen model = "interactive"
.                                 list if _n<=(2*$L)
.                                 save `folder'/`mat'_inter_lnearn_mse, replace
.                                 restore 
.         
.         foreach final in nnls1 singlebest ols avg {
  2. 
.                 ddml estimate, robust finalest(`final') atet
  3.         
.                         // regular stacking results
.                         ddml estimate, mname(m0) spec(st) replay atet
  4.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,interactive,seed,`seed',final,`final',learner,-1) append
  5.                         
.                         // shortstacking results
.                         ddml estimate, mname(m0) spec(ss) replay atet
  6.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,interactive,seed,`seed',final,`final',learner,-2) append
  7.                         
.                         // poolstacking results
.                         ddml estimate, mname(m0) spec(ps) replay atet
  8.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,interactive,seed,`seed',final,`final',learner,-3) append
  9.                 
.                         // pystacked weights
.                         ddml extract, show(stweights)
 10.                         foreach mat in Y1_pystacked_w_mn D1_pystacked_w_mn
>  {
 11.                                         ddml extract, show(stweights)
 12.                                         mat `mat' = r(`mat')
 13.                                         mat list `mat'
 14.                                                 preserve
 15.                                                 svmat `mat'
 16.                                                 keep `mat'*
 17.                                                 list if _n<=8
 18.                                                 save `folder'/`mat'_`final
> '_regular_ia, replace
 19.                                                 restore
 20.                         }       
 21.                         // shortstacked weights
.                         ddml extract, show(ssweights)
 22.                         foreach mat in Y_lnearn_ss D_gender_r_ss {
 23.                                         ddml extract, show(ssweights)
 24.                                         mat `mat' = r(`mat')
 25.                                         mat list `mat'
 26.                                                 preserve
 27.                                                 svmat `mat'
 28.                                                 keep `mat'*
 29.                                                 list if _n<=8
 30.                                                 save `folder'/`mat'_`final
> '_short_ia, replace
 31.                                                 restore
 32.                         }       
 33.                         // poolstacked weights
.                         ddml extract, show(psweights)
 34.                         foreach mat in Y_lnearn_ps D_gender_r_ps {
 35.                                         ddml extract, show(psweights)
 36.                                         mat `mat' = r(`mat')
 37.                                         mat list `mat'
 38.                                                 preserve
 39.                                                 svmat `mat'
 40.                                                 keep `mat'*
 41.                                                 list if _n<=8
 42.                                                 save `folder'/`mat'_`final
> '_pooled_ia, replace
 43.                                                 restore
 44.                         }       
 45.         
.         }
. 
.         forvalues i = 1(1)$L {
  2.                         ddml estimate, y1(Y1_pystacked1_L`i'_1) y0(Y1_pyst
> acked0_L`i'_1) ///
>                                                         d(D1_pystacked_L`i'_1
> ) robust atet foldvar(m0_sample_1  )
  3.                         regsave gender_r using `folder'/results.dta, ci //
> /
>                                                 addlabel(model,interactive,se
> ed,`seed',final,indiv,learner,`i') ///
>                                                 append
  4.         }
. 
. }       

.         
. *****************************************************************************
> *  
. *** interactive NX: short-stacking                                           
>                                       ***
. *****************************************************************************
> *
. 
. if (`estimator'==3) {
. 
. gen one = 1     
. 
.         cap drop y0base*
.         cap drop dbase*
.         cap drop y1base*
. 
.         *** no cross-fitting
.         pystacked lnearn $X_expanded   $pystring_reg0  if gender_r == 0, type
> (reg) njobs($cores)  
.                 mat nxw_ia_y0 = e(weights)
.                 mat list nxw_ia_y0
.                                 preserve
.                                 svmat nxw_ia_y0
.                                 keep nxw_ia_y0*
.                                 save `folder'/nxw_ia_y0, replace
.                                 restore
.         predict y0base0, xb
.         predict y0base, base
. 
.         pystacked lnearn $X_expanded  $pystring_reg0 if gender_r == 1  , type
> (reg) njobs($cores)  
.                 mat nxw_ia_y1 = e(weights)
.                 mat list nxw_ia_y1
.                                 preserve
.                                 svmat nxw_ia_y1
.                                 keep nxw_ia_y1*
.                                 save `folder'/nxw_ia_y1, replace
.                                 restore
.         predict y1base0, xb
.         predict y1base, base
. 
.         pystacked gender_r $X_expanded $pystring_class  
.                 mat nxw_ia_d = e(weights)
.                 mat list nxw_ia_d
.                                 preserve
.                                 svmat nxw_ia_d
.                                 keep nxw_ia_d*
.                                 save `folder'/nxw_ia_d, replace
.                                 restore         
.         predict dbase0, pr
.         predict dbase, base pr
.         
.         forvalues i = 0(1)$L {
  2.                         _estimate_ate interactive, yname(lnearn) dname(gen
> der_r) ///
>                                                 y0(y0base`i') y1(y1base`i') d
> (dbase`i') ///
>                                                 atet foldid(one) robust model
> (interactive)
  3.                         regsave gender_r using `folder'/results.dta, ///
>                                                 ci addlabel(model,nxinter,see
> d,`seed',final,nx,learner,`i') append
  4.         }
.                 
. }

.         
. *****************************************************************************
> *  
. *** partial NX: short-stacking                                               
>                                       ***
. *****************************************************************************
> *
. 
. if (`estimator'==4) {
.         
. cap gen one = 1 
. 
.         cap drop Ybase* 
.         cap drop Dbase*
. 
.         *** no cross-fitting
.         pystacked lnearn $X_expanded $pystring_reg 
.                 mat nxw_y = e(weights)
.                 mat list nxw_y
.                                 preserve
.                                 svmat nxw_y
.                                 keep nxw_y*
.                                 save `folder'/nxw_y, replace
.                                 restore
.         predict Ybase0
.         predict Ybase, basexb
. 
.         pystacked gender_r $X_expanded $pystring_reg 
.                 mat nxw_d = e(weights)
.                 mat list nxw_d
.                                 preserve
.                                 svmat nxw_d
.                                 keep nxw_d*
.                                 save `folder'/nxw_d, replace
.                                 restore         
.         predict Dbase0
.         predict Dbase, basexb
. 
.         forvalues i = 0(1)$L {
  2.                 cap drop Ytil
  3.                 cap drop Dtil
  4.                 gen Ytil = lnearn - Ybase`i'
  5.                 gen Dtil = gender_r - Dbase`i'
  6.                 reg Ytil Dtil, robust
  7.                 regsave Dtil using `folder'/results.dta, ///
>                         ci addlabel(model,nxpartial,seed,`seed',final,nx,lear
> ner,`i') append
  8.         }
. 
. }

.         
. cap log close
