-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /cluster/home/kahrens/ddml_applied/GWG/Output/GWG_923_2.txt
  log type:  text
 opened on:  10 Dec 2023, 19:14:53

. 
. which ddml
/cluster/home/kahrens/ado/plus/d/ddml.ado
*! ddml v1.4.3
*! last edited: 17aug2023
*! authors: aa/ms

. which pystacked
/cluster/home/kahrens/ado/plus/p/pystacked.ado
*! pystacked v0.7.5
*! last edited: 7aug2023
*! authors: aa/ms

. 
. set seed `seed'

. local folder out_`seed'

. 
. use "../Data/gender_gap_ML_processed", clear

. 
. cap mkdir `folder'

. 
. *****************************************************************************
> ***
. ***  controls
. *****************************************************************************
> ***
. 
. // create squared age and tenure here
. gen age_r2 = age_r^2

. gen tenure2 = tenure^2
(2 missing values generated)

. 
. // no base categories
. global continuous                                                            
>                                                            ///
>         age_r                                                                
>                                                                    /// no mis
> sing
>         yrsqual         /* years of education (derived) */                   
>                                    /// 355 missing
>         /// leavedu             /* age when left education (derived) */      
>                            /// 1,081 missing
>         pvlit1          /* literacy score: plausible value 1 (also 2-10 avail
> ) */       /// no missing
>         pvnum1          /* numeracy score: plausible value 1 (also 2-10 avail
> ) */       /// no missing
>         tenure          /* tenure = years in work for current employer */    
>                    /// 2 missing
>                                                                              
>                                                                            //

. // add second order terms here
. global continuous $continuous age_r2 tenure2

. 
. global discrete0                                                             
>                                                            ///             
>         b_q01a          /* education, highest level attained */              
>                            /// no missing
>         b_q01b          /* area of study */                                  
>                                                    /// 434 missing
>         d_q06c          /* part of a larger organization */                  
>                                    /// 13 missing
>         d_q08a          /* management position */                            
>                                            /// no missing
>         d_q09           /* type of contract */                               
>                                            /// 12 missing
>         d_q10_t1        /* hours per week at this job or business */         
>                    /// 1 missing
>         d_q14           /* job satisfaction */                               
>                                            /// 1 missing
>         i_q08           /* health status */                                  
>                                                    /// 2 missing
>         j_q02a          /* living with a partner */                          
>                                            /// 899 missing
>         j_q03d1_c       /* age of youngest child */                          
>                                            /// 2,718 missing
>         j_q04c1_c       /* immigration: age */                               
>                                            /// 4,375 missing
>         j_q06b          /* mother's highest level of educ */                 
>                            /// 445 missing
>         j_q07b          /* father's highest level of educ */                 
>                            /// 515 missing
>         j_q03b          /* number of children*/                              
>                                            /// 1,856 missing
>         impar           /* immigration: parents */                           
>                                            /// 21 missing
>         imgen           /* immigration: generation */                        
>                                    /// 344 missing
>         nfe12jr         /* informal job-related educ in prev 12 months */    
>                    /// 116 missing
>         nfe12njr        /* informal non-job-related educ in prev 12 months */
>            /// 116 missing
>                                                                              
>                                                                            //
>                                                                              
>                                                          

. global personality                                                           
>                                                            ///
>         i_q04b          /* Learning strategies, Relate new ideas into real li
> fe */      /// 16 missing
>         i_q04d          /* Learning strategies, Like learning new things */  
>                    /// no missing
>         i_q04h          /* Learning strategies, Attribute something new */   
>                    /// 10 missing
>         i_q04j          /* Learning strategies, Deal with difficult things */
>            /// no missing
>         i_q04l          /* Learning strategies, Fit different ideas together 
> */         /// 5 missing
>         i_q04m          /* Learning strategies, Looking for additional info *
> /          /// 1 missing
>         i_q05f          /* Cultural engagement, Voluntary non-profit work */ 
>            /// no missing
>         i_q06a          /* Political efficacy, No influence on the government
>  */        /// 14 missing
>         i_q07a          /* Social trust, Trust only few people */            
>                            /// 4 missing
>         i_q07b          /* Social trust, Other people take advantage of you *
> /          /// 6 missing
>                                                                              
>                                                                            //

. global discrete $discrete0                                                   
>                                                    ///
>         new_reg_tl2     /* geographical region */                            
>                                            /// 2 missing
>         new_isco1c      /* occupation */                                     
>                                                    /// no missing
>         new_isic1c      /* industry */                                       
>                                                    // no missing

. 
. global X_simple                                                         ///
>         i.(b_q01a d_q10_t1 j_q03b)                              ///
>         c.($continuous)

. 
. global X_fullinteracted                                         ///
>         i.($discrete0 )                                                 ///
>         i.new_isco1c#i.new_isic1c#i.new_reg_tl2 ///
>         c.($continuous)                  

.         
. global X_cont                                                           ///
>         c.($continuous)##i.($discrete)

. 
. global X_expanded                                                       ///
>         i.($discrete)                                                   ///
>         c.($continuous)                                                 ///
>         c.age_r#i.($discrete)                                   ///
>         c.tenure#i.($discrete)

. 
.         
. 
. *****************************************************************************
> ***
. ***  estimation sample
. *****************************************************************************
> ***
. 
. gen byte touse=1

. markout touse lnearn $X_expanded

. keep if touse
(53 observations deleted)

. 
. 
. *****************************************************************************
> ***
. ***  learners
. *****************************************************************************
> ***
. 
. global cores = 5

. 
. global rf1 min_samples_leaf(1)  max_features(sqrt) n_estimators(500)

. global rf2 min_samples_leaf(50)  max_features(sqrt) n_estimators(500)

. global rf3 min_samples_leaf(100)  max_features(sqrt) n_estimators(500)

. global grad1 n_estimators(500) n_iter_no_change(10)  

. global grad2 n_estimators(500)  

. global nnet1 hidden_layer_sizes(40 20 1 20 50) early_stopping 

. global nnet2 hidden_layer_sizes(30 30 30) early_stopping  

. 
. global pystring_reg0                                                         
>    || ///
>                                         m(ols)                               
>                            || ///
>                                         m(ols) xvars($X_simple)              
>            || ///
>                                         m(lassocv)                           
>                            || ///
>                                         m(ridgecv)                           
>                            || ///
>                                         m(lassocv)      xvars($X_cont)       
>            || ///
>                                         m(ridgecv)      xvars($X_cont)       
>            || ///
>                                         m(rf) opt($rf1)                      
>                    || ///
>                                         m(rf) opt($rf2)                      
>                    || ///
>                                         m(rf) opt($rf3)                      
>                    || ///
>                                         m(gradboost) opt($grad1)             
>            || ///
>                                         m(gradboost) opt($grad2)             
>            || ///
>                                         m(nnet) opt($nnet1)                  
>            || ///
>                                         m(nnet) opt($nnet2)                  
>            || //

. 
. global pystring_reg  $pystring_reg0 , type(reg) njobs($cores) 

.  
. global pystring_class0                                                       
>            || ///
>                                         m(logit)                             
>                            || ///
>                                         m(logit) xvars($X_simple)            
>            || ///
>                                         m(lassocv)                           
>                            || ///
>                                         m(ridgecv)                           
>                            || ///
>                                         m(lassocv)      xvars($X_cont)       
>            || ///
>                                         m(ridgecv)      xvars($X_cont)       
>            || ///
>                                         m(rf) opt($rf1)                      
>                    || ///
>                                         m(rf) opt($rf2)                      
>                    || ///
>                                         m(rf) opt($rf3)                      
>                    || ///
>                                         m(gradboost) opt($grad1)             
>            || ///
>                                         m(gradboost) opt($grad2)             
>            || ///
>                                         m(nnet) opt($nnet1)                  
>            || ///
>                                         m(nnet) opt($nnet2)                  
>            || //                   

.                                 
. global pystring_class $pystring_class0 , type(class) njobs($cores)

.                                         
. global R =1  

. global K=10 

. global L =13

.         
. *****************************************************************************
> *  
. *** ddml: estimation                                                         
>                                               ***
. *****************************************************************************
> *
. 
. if (`estimator'==1) {
. 
.         ddml init partial,  reps($R) kfolds($K)
.         ddml E[Y|X]: pystacked lnearn $X_expanded $pystring_reg
.         ddml E[D|X]: pystacked gender_r $X_expanded $pystring_reg
.         ddml crossfit, shortstack poolstack
.         ddml estimate, robust
.         
.         foreach mat in lnearn_mse gender_r_mse {
  2.                         ddml extract, show(mse)
  3.                         mat `mat' = r(`mat')
  4.                         mat list `mat'
  5.                                 preserve
  6.                                 svmat `mat'
  7.                                 keep `mat'*
  8.                                 keep if _n<=$L
  9.                                 gen stack_type = "conventional" if _n==1
 10.                                 replace stack_type = "pooled" if _n==2
 11.                                 replace stack_type = "short" if _n==3
 12.                                 gen model = "plm"
 13.                                 list if _n<=$L
 14.                                 save `folder'/`mat'_plm_mse, replace
 15.                                 restore 
 16.         }       
. 
.         cap drop mse_*
.         foreach var of varlist Y1_* {
  2.                  cap drop sqerr_`var'
  3.                  gen double sqerr_`var'=(lnearn-`var')^2
  4.                  sum sqerr_`var', meanonly
  5.                  gen double mse_`var'=r(mean) if _n ==1 
  6.         }
.         foreach var of varlist D1_* {
  2.                  cap drop sqerr_`var'
  3.                  gen double sqerr_`var'=(gender_r-`var')^2
  4.                  sum sqerr_`var', meanonly
  5.                  gen double mse_`var'=r(mean) if _n ==1 
  6.         }
.         preserve
.                 keep mse_*
.                 keep if _n==1
.                 save `folder'/plm_mse, replace
.         restore
.         cap drop mse_*
. 
.         ** initialize results file
.         regsave gender_r using `folder'/results.dta, ci addlabel(model,partia
> l,seed,`seed',final,init,learner,-99) replace
. 
.         foreach final in nnls1 singlebest ols avg {
  2. 
.                 ddml estimate, robust finalest(`final')
  3.         
.                         // regular stacking results
.                         ddml estimate, mname(m0) spec(st) replay  
  4.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,partial,seed,`seed',final,`final',learner,-1) append
  5.                         
.                         // shortstacking results
.                         ddml estimate, mname(m0) spec(ss) replay 
  6.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,partial,seed,`seed',final,`final',learner,-2) append
  7.                         
.                         // poolstacking results
.                         ddml estimate, mname(m0) spec(ps) replay  
  8.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,partial,seed,`seed',final,`final',learner,-3) append     
  9.                 
.                         // pystacked weights
.                         ddml extract, show(stweights)   
 10.                         foreach mat in Y1_pystacked_w_mn D1_pystacked_w_mn
>  {
 11.                                         ddml extract, show(stweights)   
 12.                                         mat `mat' = r(`mat')
 13.                                         mat list `mat'
 14.                                                 preserve
 15.                                                 svmat `mat'
 16.                                                 keep `mat'*
 17.                                                 list if _n<=4
 18.                                                 save `folder'/`mat'_`final
> '_regular, replace
 19.                                                 restore
 20.                         }       
 21.                         // shortstacked weights
.                         ddml extract, show(ssweights)
 22.                         foreach mat in Y_lnearn_ss D_gender_r_ss {
 23.                                         qui ddml extract, show(ssweights)
 24.                                         mat `mat' = r(`mat')
 25.                                         mat list `mat'
 26.                                                 preserve
 27.                                                 svmat `mat'
 28.                                                 keep `mat'*
 29.                                                 list if _n<=4
 30.                                                 save `folder'/`mat'_`final
> '_short, replace
 31.                                                 restore
 32.                         }       
 33.                         // poolstacked weights
. 
.                         foreach mat in Y_lnearn_ps D_gender_r_ps {
 34.                                         qui ddml extract, show(psweights)
 35.                                         mat `mat' = r(`mat')
 36.                                         mat list `mat'
 37.                                                 preserve
 38.                                                 svmat `mat'
 39.                                                 keep `mat'*
 40.                                                 list if _n<=4
 41.                                                 save `folder'/`mat'_`final
> '_pooled, replace
 42.                                                 restore
 43.                         }       
 44.         
.         }
. 
.         forvalues i = 1(1)$L {
  2.                         ddml estimate, y(Y1_pystacked_L`i'_1) ///
>                                                         d(D1_pystacked_L`i'_1
> ) robust
  3.                         regsave gender_r using `folder'/results.dta, ci //
> /
>                                                 addlabel(model,partial,seed,`
> seed',final,indiv,learner,`i') ///
>                                                 append
  4.         }
. 
. }

.         
. *****************************************************************************
> *  
. *** interactive: estimation                                                  
>                                       ***
. *****************************************************************************
> *
.         
. if (`estimator'==2) {   
. 
.         ddml init interactive, kfolds($K) reps($R)
.         ddml E[Y|X,D]: pystacked lnearn $X_expanded $pystring_reg
Learner Y1_pystacked added successfully.
.         ddml E[D|X]: pystacked gender_r $X_expanded $pystring_class
Learner D1_pystacked added successfully.
.         ddml crossfit, shortstack poolstack
Cross-fitting E[y|X,D] equation: lnearn
Cross-fitting fold 1 2 3 4 5 6 7 8 9 10 ...completed cross-fitting...completed 
> short-stacking...completed pooled-stacking
Cross-fitting E[D|X] equation: gender_r
Cross-fitting fold 1 2 3 4 5 6 7 8 9 10 ...completed cross-fitting...completed 
> short-stacking...completed pooled-stacking
.         ddml estimate, robust atet


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.079    (0.022)
  ss  1  [shortstack]          [ss]          [ss]    -0.083    (0.021)
  ps  1   [poolstack]          [ps]          [ps]    -0.080    (0.022)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0828592   .0213658    -3.88   0.000    -.1247355    -.040983
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 5 propensity scores trimmed to lower limit .01.

. 
.         cap drop mse_*
.         foreach var of varlist Y1_pystacked0* {
  2.                  cap drop sqerr_`var'
  3.                  gen double sqerr_`var'=(lnearn-`var')^2 if gender_r==0
  4.                  sum sqerr_`var' if gender_r==0, meanonly
  5.                  gen double mse_`var'=r(mean) if _n ==1 
  6.         }
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
.         foreach var of varlist Y1_pystacked1* {
  2.                  cap drop sqerr_`var'
  3.                  gen double sqerr_`var'=(lnearn-`var')^2 if gender_r==1
  4.                  sum sqerr_`var' if gender_r==1, meanonly
  5.                  gen double mse_`var'=r(mean) if _n ==1 
  6.         }
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
.         foreach var of varlist D1_* {
  2.                  cap drop sqerr_`var'
  3.                  gen double sqerr_`var'=(gender_r-`var')^2
  4.                  sum sqerr_`var', meanonly
  5.                  gen double mse_`var'=r(mean) if _n ==1 
  6.         }
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
.         preserve
.                 keep mse_*
.                 keep if _n==1
(4,835 observations deleted)
.                 save `folder'/inter_mse, replace
(note: file out_923/inter_mse.dta not found)
file out_923/inter_mse.dta saved
.         restore
.         cap drop mse_*
.         
.         local mat gender_r_mse
.                         ddml extract, show(mse)

MSEs for gender_r:
                 rep   full smp      fold 1      fold 2      fold 3      fold 4
>       fold 5      fold 6      fold 7      fold 8      fold 9     fold 10 
    D1_pystacked   1      0.156       0.149       0.154       0.153       0.139
>        0.150       0.167       0.144       0.163       0.171       0.166  
   D_gender_r_ps   1      0.155       0.149       0.155       0.153       0.138
>        0.149       0.166       0.145       0.162       0.170       0.165  
   D_gender_r_ss   1      0.155       0.149       0.155       0.153       0.138
>        0.149       0.165       0.145       0.162       0.169       0.165  

MSEs for lnearn:
                D=  rep   full smp      fold 1      fold 2      fold 3      fol
> d 4      fold 5      fold 6      fold 7      fold 8      fold 9     fold 10 
    Y1_pystacked 0    1      0.226       0.164       0.151       0.561       0.
> 140       0.245       0.218       0.168       0.232       0.194       0.188  
    Y1_pystacked 1    1      0.173       0.135       0.240       0.139       0.
> 137       0.159       0.189       0.128       0.190       0.183       0.232  
     Y_lnearn_ps 0    1      8.304       8.392       8.042       8.432       8.
> 120       8.301       8.336       8.416       8.341       8.160       8.545  
     Y_lnearn_ps 1    1      7.496       7.591       7.516       7.349       7.
> 530       7.451       7.620       7.551       7.363       7.519       7.476  
     Y_lnearn_ss 0    1      0.224       0.164       0.150       0.561       0.
> 134       0.244       0.216       0.168       0.231       0.193       0.188  
     Y_lnearn_ss 1    1      0.172       0.133       0.239       0.138       0.
> 137       0.157       0.188       0.127       0.189       0.182       0.231  
.                         mat `mat' = r(`mat')
.                         mat list `mat'

gender_r_mse[3,12]
                      rep  full_sample        fold1        fold2        fold3
D1_pystacked            1    .15553764    .14922886    .15433067    .15304409
D_gender_r~s            1    .15515903    .14910445    .15489051    .15303084
D_gender_r~s            1    .15504961     .1491441    .15512276    .15341915

                    fold4        fold5        fold6        fold7        fold8
D1_pystacked    .13912276     .1496546    .16667738    .14441738    .16266324
D_gender_r~s    .13830856    .14879304    .16552745    .14453412    .16213738
D_gender_r~s    .13835297    .14875419     .1650187     .1454622    .16150842

                    fold9       fold10
D1_pystacked    .17072263    .16553433
D_gender_r~s    .16984211    .16544078
D_gender_r~s    .16859996    .16513206
.                                 preserve
.                                 svmat `mat'
.                                 keep `mat'*
.                                 keep if _n<=$L
(4,823 observations deleted)
.                                 gen stack_type = "conventional" if _n==1
(12 missing values generated)
.                                 replace stack_type = "pooled" if _n==2
(1 real change made)
.                                 replace stack_type = "short" if _n==3
(1 real change made)
.                                 gen model = "interactive"
.                                 list if _n<=$L

     +-----------------------------------------------------------------+
  1. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        1 | .1555376 | .1492289 | .1543307 | .1530441 | .1391228 |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     | .1496546 | .1666774 | .1444174 | .1626632 | .1707226 | .1655343 |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |          conventional          |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  2. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        1 |  .155159 | .1491044 | .1548905 | .1530308 | .1383086 |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |  .148793 | .1655274 | .1445341 | .1621374 | .1698421 | .1654408 |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                pooled          |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  3. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        1 | .1550496 | .1491441 | .1551228 | .1534192 |  .138353 |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     | .1487542 | .1650187 | .1454622 | .1615084 |    .1686 | .1651321 |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                 short          |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  4. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  5. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  6. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  7. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  8. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  9. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 10. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 11. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 12. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 13. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+
.                                 save `folder'/`mat'_inter_gender_mse, replace
(note: file out_923/gender_r_mse_inter_gender_mse.dta not found)
file out_923/gender_r_mse_inter_gender_mse.dta saved
.                                 restore 
.                                 
.         local mat lnearn_mse
.                         ddml extract, show(mse)

MSEs for gender_r:
                 rep   full smp      fold 1      fold 2      fold 3      fold 4
>       fold 5      fold 6      fold 7      fold 8      fold 9     fold 10 
    D1_pystacked   1      0.156       0.149       0.154       0.153       0.139
>        0.150       0.167       0.144       0.163       0.171       0.166  
   D_gender_r_ps   1      0.155       0.149       0.155       0.153       0.138
>        0.149       0.166       0.145       0.162       0.170       0.165  
   D_gender_r_ss   1      0.155       0.149       0.155       0.153       0.138
>        0.149       0.165       0.145       0.162       0.169       0.165  

MSEs for lnearn:
                D=  rep   full smp      fold 1      fold 2      fold 3      fol
> d 4      fold 5      fold 6      fold 7      fold 8      fold 9     fold 10 
    Y1_pystacked 0    1      0.226       0.164       0.151       0.561       0.
> 140       0.245       0.218       0.168       0.232       0.194       0.188  
    Y1_pystacked 1    1      0.173       0.135       0.240       0.139       0.
> 137       0.159       0.189       0.128       0.190       0.183       0.232  
     Y_lnearn_ps 0    1      8.304       8.392       8.042       8.432       8.
> 120       8.301       8.336       8.416       8.341       8.160       8.545  
     Y_lnearn_ps 1    1      7.496       7.591       7.516       7.349       7.
> 530       7.451       7.620       7.551       7.363       7.519       7.476  
     Y_lnearn_ss 0    1      0.224       0.164       0.150       0.561       0.
> 134       0.244       0.216       0.168       0.231       0.193       0.188  
     Y_lnearn_ss 1    1      0.172       0.133       0.239       0.138       0.
> 137       0.157       0.188       0.127       0.189       0.182       0.231  
.                         mat `mat' = r(`mat')
.                         mat list `mat'

lnearn_mse[6,13]
                    D=0/1          rep  full_sample        fold1        fold2
Y1_pystacked            0            1    .22573822    .16369897    .15144062
Y1_pystacked            1            1    .17319403    .13469095    .24047017
 Y_lnearn_ps            0            1    8.3044532    8.3919584    8.0417799
 Y_lnearn_ps            1            1    7.4962042    7.5914641    7.5162124
 Y_lnearn_ss            0            1    .22446655    .16352568    .14957626
 Y_lnearn_ss            1            1      .171984    .13321338    .23853336

                    fold3        fold4        fold5        fold6        fold7
Y1_pystacked    .56082519    .13957955    .24509844    .21760077    .16795488
Y1_pystacked    .13940983    .13729802    .15941997    .18863897    .12766546
 Y_lnearn_ps    8.4318912    8.1202399    8.3011524    8.3356945    8.4155915
 Y_lnearn_ps    7.3488652    7.5298212    7.4512173    7.6199239    7.5509173
 Y_lnearn_ss    .56051184    .13398987    .24437536    .21613845    .16797098
 Y_lnearn_ss    .13800614    .13664397    .15726143    .18828911    .12738374

                    fold8        fold9       fold10
Y1_pystacked      .232493    .19395966    .18824097
Y1_pystacked     .1904191    .18293988    .23153546
 Y_lnearn_ps    8.3412747    8.1595471    8.5451271
 Y_lnearn_ps    7.3627371    7.5194274    7.4759601
 Y_lnearn_ss    .23091937    .19348133    .18813463
 Y_lnearn_ss    .18850826    .18188428    .23078593
.                                 preserve
.                                 svmat `mat'
.                                 keep `mat'*
.                                 keep if _n<=(2*$L)
(4,810 observations deleted)
.                                 gen stack_type = "conventional" if _n<=2
(24 missing values generated)
.                                 replace stack_type = "pooled" if _n>=3 & _n<=
> 4
(2 real changes made)
.                                 replace stack_type = "short" if _n>4
(22 real changes made)
.                                 gen model = "interactive"
.                                 list if _n<=(2*$L)

     +-----------------------------------------------------------------+
  1. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        0 |        1 | .2257382 |  .163699 | .1514406 | .5608252 |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     | .1395795 | .2450984 | .2176008 | .1679549 |  .232493 | .1939597 |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |      .188241     |     conventional      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  2. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        1 |        1 |  .173194 |  .134691 | .2404702 | .1394098 |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |  .137298 |   .15942 |  .188639 | .1276655 | .1904191 | .1829399 |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |     .2315355     |     conventional      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  3. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        0 |        1 | 8.304453 | 8.391958 |  8.04178 | 8.431891 |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |  8.12024 | 8.301152 | 8.335694 | 8.415591 | 8.341274 | 8.159547 |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |     8.545127     |           pooled      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  4. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        1 |        1 | 7.496204 | 7.591464 | 7.516212 | 7.348865 |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     | 7.529821 | 7.451217 | 7.619924 | 7.550917 | 7.362737 | 7.519427 |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |      7.47596     |           pooled      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  5. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        0 |        1 | .2244665 | .1635257 | .1495763 | .5605118 |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     | .1339899 | .2443754 | .2161385 |  .167971 | .2309194 | .1934813 |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |     .1881346     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  6. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        1 |        1 |  .171984 | .1332134 | .2385334 | .1380061 |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |  .136644 | .1572614 | .1882891 | .1273837 | .1885083 | .1818843 |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |     .2307859     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  7. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  8. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  9. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 10. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 11. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 12. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 13. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 14. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 15. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 16. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 17. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 18. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 19. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 20. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 21. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 22. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 23. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 24. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 25. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 26. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+
.                                 save `folder'/`mat'_inter_lnearn_mse, replace
(note: file out_923/lnearn_mse_inter_lnearn_mse.dta not found)
file out_923/lnearn_mse_inter_lnearn_mse.dta saved
.                                 restore 
.         
.         foreach final in nnls1 singlebest ols avg {
  2. 
.                 ddml estimate, robust finalest(`final') atet
  3.         
.                         // regular stacking results
.                         ddml estimate, mname(m0) spec(st) replay atet
  4.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,interactive,seed,`seed',final,`final',learner,-1) append
  5.                         
.                         // shortstacking results
.                         ddml estimate, mname(m0) spec(ss) replay atet
  6.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,interactive,seed,`seed',final,`final',learner,-2) append
  7.                         
.                         // poolstacking results
.                         ddml estimate, mname(m0) spec(ps) replay atet
  8.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,interactive,seed,`seed',final,`final',learner,-3) append
  9.                 
.                         // pystacked weights
.                         ddml extract, show(stweights)
 10.                         foreach mat in Y1_pystacked_w_mn D1_pystacked_w_mn
>  {
 11.                                         ddml extract, show(stweights)
 12.                                         mat `mat' = r(`mat')
 13.                                         mat list `mat'
 14.                                                 preserve
 15.                                                 svmat `mat'
 16.                                                 keep `mat'*
 17.                                                 list if _n<=8
 18.                                                 save `folder'/`mat'_`final
> '_regular_ia, replace
 19.                                                 restore
 20.                         }       
 21.                         // shortstacked weights
.                         ddml extract, show(ssweights)
 22.                         foreach mat in Y_lnearn_ss D_gender_r_ss {
 23.                                         ddml extract, show(ssweights)
 24.                                         mat `mat' = r(`mat')
 25.                                         mat list `mat'
 26.                                                 preserve
 27.                                                 svmat `mat'
 28.                                                 keep `mat'*
 29.                                                 list if _n<=8
 30.                                                 save `folder'/`mat'_`final
> '_short_ia, replace
 31.                                                 restore
 32.                         }       
 33.                         // poolstacked weights
.                         ddml extract, show(psweights)
 34.                         foreach mat in Y_lnearn_ps D_gender_r_ps {
 35.                                         ddml extract, show(psweights)
 36.                                         mat `mat' = r(`mat')
 37.                                         mat list `mat'
 38.                                                 preserve
 39.                                                 svmat `mat'
 40.                                                 keep `mat'*
 41.                                                 list if _n<=8
 42.                                                 save `folder'/`mat'_`final
> '_pooled_ia, replace
 43.                                                 restore
 44.                         }       
 45.         
.         }


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.079    (0.022)
  ss  1  [shortstack]          [ss]          [ss]    -0.083    (0.021)
  ps  1   [poolstack]          [ps]          [ps]    -0.080    (0.022)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0828592   .0213658    -3.88   0.000    -.1247355    -.040983
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 5 propensity scores trimmed to lower limit .01.



Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.079    (0.022)
  ss  1  [shortstack]          [ss]          [ss]    -0.083    (0.021)
  ps  1   [poolstack]          [ps]          [ps]    -0.080    (0.022)

Stacking DDML model (ATET)
E[y|X,D=0]   = Y1_pystacked0_1                     Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1
E[D|X]       = D1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |   -.079313   .0224803    -3.53   0.000    -.1233735   -.0352524
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 7 propensity scores trimmed to lower limit .01.

(note: variable final was str5, now str10 to accommodate using data's values)
file out_923/results.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  ss  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.083    (0.021)
  ss  1  [shortstack]          [ss]          [ss]    -0.083    (0.021)
  ps  1   [poolstack]          [ps]          [ps]    -0.080    (0.022)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0828592   .0213658    -3.88   0.000    -.1247355    -.040983
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 5 propensity scores trimmed to lower limit .01.

(note: variable final was str5, now str10 to accommodate using data's values)
file out_923/results.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  ps  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.080    (0.022)
  ss  1  [shortstack]          [ss]          [ss]    -0.083    (0.021)
  ps  1   [poolstack]          [ps]          [ps]    -0.080    (0.022)

Poolstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ps0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ps1
E[D|X]       = D_gender_r_ps_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0801427   .0219183    -3.66   0.000    -.1231018   -.0371836
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 7 propensity scores trimmed to lower limit .01.

(note: variable final was str5, now str10 to accommodate using data's values)
file out_923/results.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .25435053    .25435053
    logit            2    2.976e-17    2.976e-17
  lassocv            3    .10568725    .10568725
  ridgecv            4    .05022926    .05022926
  lassocv            5     .0058065     .0058065
  ridgecv            6    .02078264    .02078264
       rf            7    .25588273    .25588273
       rf            8    1.280e-17    1.280e-17
       rf            9    7.653e-17    7.653e-17
gradboost           10    .02911864    .02911864
gradboost           11    .24868121    .24868121
     nnet           12    4.787e-17    4.787e-17
     nnet           13    .02946123    .02946123

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .02318991    .02318991
      ols            2            0    1.225e-16    1.225e-16
  lassocv            3            0    .13209109    .13209109
  ridgecv            4            0    .20505882    .20505882
  lassocv            5            0    7.074e-17    7.074e-17
  ridgecv            6            0    .00741951    .00741951
       rf            7            0     .4163518     .4163518
       rf            8            0    5.646e-17    5.646e-17
       rf            9            0    4.850e-17    4.850e-17
gradboost           10            0    .02902245    .02902245
gradboost           11            0    .16520101    .16520101
     nnet           12            0    .01598054    .01598054
     nnet           13            0    .00568487    .00568487
      ols            1            1    .00443979    .00443979
      ols            2            1    6.652e-17    6.652e-17
  lassocv            3            1    .08185675    .08185675
  ridgecv            4            1    .01766321    .01766321
  lassocv            5            1    .21740459    .21740459
  ridgecv            6            1    .05956235    .05956235
       rf            7            1    .49354859    .49354859
       rf            8            1    7.722e-17    7.722e-17
       rf            9            1    4.188e-17    4.188e-17
gradboost           10            1    .00618493    .00618493
gradboost           11            1    .07194436    .07194436
     nnet           12            1    .03085119    .03085119
     nnet           13            1    .01654424    .01654424

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .25435053    .25435053
    logit            2    2.976e-17    2.976e-17
  lassocv            3    .10568725    .10568725
  ridgecv            4    .05022926    .05022926
  lassocv            5     .0058065     .0058065
  ridgecv            6    .02078264    .02078264
       rf            7    .25588273    .25588273
       rf            8    1.280e-17    1.280e-17
       rf            9    7.653e-17    7.653e-17
gradboost           10    .02911864    .02911864
gradboost           11    .24868121    .24868121
     nnet           12    4.787e-17    4.787e-17
     nnet           13    .02946123    .02946123

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .02318991    .02318991
      ols            2            0    1.225e-16    1.225e-16
  lassocv            3            0    .13209109    .13209109
  ridgecv            4            0    .20505882    .20505882
  lassocv            5            0    7.074e-17    7.074e-17
  ridgecv            6            0    .00741951    .00741951
       rf            7            0     .4163518     .4163518
       rf            8            0    5.646e-17    5.646e-17
       rf            9            0    4.850e-17    4.850e-17
gradboost           10            0    .02902245    .02902245
gradboost           11            0    .16520101    .16520101
     nnet           12            0    .01598054    .01598054
     nnet           13            0    .00568487    .00568487
      ols            1            1    .00443979    .00443979
      ols            2            1    6.652e-17    6.652e-17
  lassocv            3            1    .08185675    .08185675
  ridgecv            4            1    .01766321    .01766321
  lassocv            5            1    .21740459    .21740459
  ridgecv            6            1    .05956235    .05956235
       rf            7            1    .49354859    .49354859
       rf            8            1    7.722e-17    7.722e-17
       rf            9            1    4.188e-17    4.188e-17
gradboost           10            1    .00618493    .00618493
gradboost           11            1    .07194436    .07194436
     nnet           12            1    .03085119    .03085119
     nnet           13            1    .01654424    .01654424

Y1_pystacked_w_mn[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .02318991    .02318991
      ols            2            0    1.225e-16    1.225e-16
  lassocv            3            0    .13209109    .13209109
  ridgecv            4            0    .20505882    .20505882
  lassocv            5            0    7.074e-17    7.074e-17
  ridgecv            6            0    .00741951    .00741951
       rf            7            0     .4163518     .4163518
       rf            8            0    5.646e-17    5.646e-17
       rf            9            0    4.850e-17    4.850e-17
gradboost           10            0    .02902245    .02902245
gradboost           11            0    .16520101    .16520101
     nnet           12            0    .01598054    .01598054
     nnet           13            0    .00568487    .00568487
      ols            1            1    .00443979    .00443979
      ols            2            1    6.652e-17    6.652e-17
  lassocv            3            1    .08185675    .08185675
  ridgecv            4            1    .01766321    .01766321
  lassocv            5            1    .21740459    .21740459
  ridgecv            6            1    .05956235    .05956235
       rf            7            1    .49354859    .49354859
       rf            8            1    7.722e-17    7.722e-17
       rf            9            1    4.188e-17    4.188e-17
gradboost           10            1    .00618493    .00618493
gradboost           11            1    .07194436    .07194436
     nnet           12            1    .03085119    .03085119
     nnet           13            1    .01654424    .01654424

      +-------------------------------------------+
      | Y1_pys~1   Y1_pys~2   Y1_pys~3   Y1_pys~4 |
      |-------------------------------------------|
   1. |        1          0   .0231899   .0231899 |
   2. |        2          0   1.23e-16   1.23e-16 |
   3. |        3          0   .1320911   .1320911 |
   4. |        4          0   .2050588   .2050588 |
   5. |        5          0   7.07e-17   7.07e-17 |
      |-------------------------------------------|
   6. |        6          0   .0074195   .0074195 |
   7. |        7          0   .4163518   .4163518 |
   8. |        8          0   5.65e-17   5.65e-17 |
      +-------------------------------------------+
(note: file out_923/Y1_pystacked_w_mn_nnls1_regular_ia.dta not found)
file out_923/Y1_pystacked_w_mn_nnls1_regular_ia.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .25435053    .25435053
    logit            2    2.976e-17    2.976e-17
  lassocv            3    .10568725    .10568725
  ridgecv            4    .05022926    .05022926
  lassocv            5     .0058065     .0058065
  ridgecv            6    .02078264    .02078264
       rf            7    .25588273    .25588273
       rf            8    1.280e-17    1.280e-17
       rf            9    7.653e-17    7.653e-17
gradboost           10    .02911864    .02911864
gradboost           11    .24868121    .24868121
     nnet           12    4.787e-17    4.787e-17
     nnet           13    .02946123    .02946123

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .02318991    .02318991
      ols            2            0    1.225e-16    1.225e-16
  lassocv            3            0    .13209109    .13209109
  ridgecv            4            0    .20505882    .20505882
  lassocv            5            0    7.074e-17    7.074e-17
  ridgecv            6            0    .00741951    .00741951
       rf            7            0     .4163518     .4163518
       rf            8            0    5.646e-17    5.646e-17
       rf            9            0    4.850e-17    4.850e-17
gradboost           10            0    .02902245    .02902245
gradboost           11            0    .16520101    .16520101
     nnet           12            0    .01598054    .01598054
     nnet           13            0    .00568487    .00568487
      ols            1            1    .00443979    .00443979
      ols            2            1    6.652e-17    6.652e-17
  lassocv            3            1    .08185675    .08185675
  ridgecv            4            1    .01766321    .01766321
  lassocv            5            1    .21740459    .21740459
  ridgecv            6            1    .05956235    .05956235
       rf            7            1    .49354859    .49354859
       rf            8            1    7.722e-17    7.722e-17
       rf            9            1    4.188e-17    4.188e-17
gradboost           10            1    .00618493    .00618493
gradboost           11            1    .07194436    .07194436
     nnet           12            1    .03085119    .03085119
     nnet           13            1    .01654424    .01654424

D1_pystacked_w_mn[13,3]
               learner  mean_weight        rep_1
    logit            1    .25435053    .25435053
    logit            2    2.976e-17    2.976e-17
  lassocv            3    .10568725    .10568725
  ridgecv            4    .05022926    .05022926
  lassocv            5     .0058065     .0058065
  ridgecv            6    .02078264    .02078264
       rf            7    .25588273    .25588273
       rf            8    1.280e-17    1.280e-17
       rf            9    7.653e-17    7.653e-17
gradboost           10    .02911864    .02911864
gradboost           11    .24868121    .24868121
     nnet           12    4.787e-17    4.787e-17
     nnet           13    .02946123    .02946123

      +--------------------------------+
      | D1_pys~1   D1_pys~2   D1_pys~3 |
      |--------------------------------|
   1. |        1   .2543505   .2543505 |
   2. |        2   2.98e-17   2.98e-17 |
   3. |        3   .1056872   .1056872 |
   4. |        4   .0502293   .0502293 |
   5. |        5   .0058065   .0058065 |
      |--------------------------------|
   6. |        6   .0207826   .0207826 |
   7. |        7   .2558827   .2558827 |
   8. |        8   1.28e-17   1.28e-17 |
      +--------------------------------+
(note: file out_923/D1_pystacked_w_mn_nnls1_regular_ia.dta not found)
file out_923/D1_pystacked_w_mn_nnls1_regular_ia.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1     .1579927     .1579927
    logit            2            0            0
  lassocv            3    .09690273    .09690273
  ridgecv            4    .13980729    .13980729
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7    .30331421    .30331421
       rf            8    3.341e-17    3.341e-17
       rf            9    8.385e-17    8.385e-17
gradboost           10    .03315897    .03315897
gradboost           11    .24809187    .24809187
     nnet           12    9.336e-17    9.336e-17
     nnet           13    .02073224    .02073224

short-stacked weights across resamples for lnearn
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .06111196    .06111196
      ols            2            0    2.367e-16    2.367e-16
  lassocv            3            0            0            0
  ridgecv            4            0    .13085316    .13085316
  lassocv            5            0    .12169093    .12169093
  ridgecv            6            0    4.519e-17    4.519e-17
       rf            7            0    .47841568    .47841568
       rf            8            0    1.072e-16    1.072e-16
       rf            9            0    8.785e-17    8.785e-17
gradboost           10            0     .0452285     .0452285
gradboost           11            0    .16269978    .16269978
     nnet           12            0    2.790e-17    2.790e-17
     nnet           13            0    9.904e-17    9.904e-17
      ols            1            1    .04661346    .04661346
      ols            2            1    5.305e-17    5.305e-17
  lassocv            3            1    .13850527    .13850527
  ridgecv            4            1    1.792e-17    1.792e-17
  lassocv            5            1    .26005322    .26005322
  ridgecv            6            1    7.905e-19    7.905e-19
       rf            7            1     .5012466     .5012466
       rf            8            1    2.863e-17    2.863e-17
       rf            9            1    3.290e-17    3.290e-17
gradboost           10            1    1.185e-17    1.185e-17
gradboost           11            1     .0446192     .0446192
     nnet           12            1    5.953e-18    5.953e-18
     nnet           13            1    .00896225    .00896225

short-stacked weights across resamples for gender_r
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1     .1579927     .1579927
    logit            2            0            0
  lassocv            3    .09690273    .09690273
  ridgecv            4    .13980729    .13980729
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7    .30331421    .30331421
       rf            8    3.341e-17    3.341e-17
       rf            9    8.385e-17    8.385e-17
gradboost           10    .03315897    .03315897
gradboost           11    .24809187    .24809187
     nnet           12    9.336e-17    9.336e-17
     nnet           13    .02073224    .02073224

short-stacked weights across resamples for lnearn
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .06111196    .06111196
      ols            2            0    2.367e-16    2.367e-16
  lassocv            3            0            0            0
  ridgecv            4            0    .13085316    .13085316
  lassocv            5            0    .12169093    .12169093
  ridgecv            6            0    4.519e-17    4.519e-17
       rf            7            0    .47841568    .47841568
       rf            8            0    1.072e-16    1.072e-16
       rf            9            0    8.785e-17    8.785e-17
gradboost           10            0     .0452285     .0452285
gradboost           11            0    .16269978    .16269978
     nnet           12            0    2.790e-17    2.790e-17
     nnet           13            0    9.904e-17    9.904e-17
      ols            1            1    .04661346    .04661346
      ols            2            1    5.305e-17    5.305e-17
  lassocv            3            1    .13850527    .13850527
  ridgecv            4            1    1.792e-17    1.792e-17
  lassocv            5            1    .26005322    .26005322
  ridgecv            6            1    7.905e-19    7.905e-19
       rf            7            1     .5012466     .5012466
       rf            8            1    2.863e-17    2.863e-17
       rf            9            1    3.290e-17    3.290e-17
gradboost           10            1    1.185e-17    1.185e-17
gradboost           11            1     .0446192     .0446192
     nnet           12            1    5.953e-18    5.953e-18
     nnet           13            1    .00896225    .00896225

Y_lnearn_ss[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .06111196    .06111196
      ols            2            0    2.367e-16    2.367e-16
  lassocv            3            0            0            0
  ridgecv            4            0    .13085316    .13085316
  lassocv            5            0    .12169093    .12169093
  ridgecv            6            0    4.519e-17    4.519e-17
       rf            7            0    .47841568    .47841568
       rf            8            0    1.072e-16    1.072e-16
       rf            9            0    8.785e-17    8.785e-17
gradboost           10            0     .0452285     .0452285
gradboost           11            0    .16269978    .16269978
     nnet           12            0    2.790e-17    2.790e-17
     nnet           13            0    9.904e-17    9.904e-17
      ols            1            1    .04661346    .04661346
      ols            2            1    5.305e-17    5.305e-17
  lassocv            3            1    .13850527    .13850527
  ridgecv            4            1    1.792e-17    1.792e-17
  lassocv            5            1    .26005322    .26005322
  ridgecv            6            1    7.905e-19    7.905e-19
       rf            7            1     .5012466     .5012466
       rf            8            1    2.863e-17    2.863e-17
       rf            9            1    3.290e-17    3.290e-17
gradboost           10            1    1.185e-17    1.185e-17
gradboost           11            1     .0446192     .0446192
     nnet           12            1    5.953e-18    5.953e-18
     nnet           13            1    .00896225    .00896225

      +-------------------------------------------------------------------+
      | Y_lne~1_1   Y_lne~0_1   Y_lne~s1   Y_lnea~2   Y_lnea~3   Y_lnea~4 |
      |-------------------------------------------------------------------|
   1. | 2.5399077   2.7395686          1          0    .061112    .061112 |
   2. | 3.0125154    3.277421          2          0   2.37e-16   2.37e-16 |
   3. | 2.8133173   2.9015644          3          0          0          0 |
   4. |  2.475115   2.6170015          4          0   .1308532   .1308532 |
   5. | 3.0782817   3.1303269          5          0   .1216909   .1216909 |
      |-------------------------------------------------------------------|
   6. | 2.5382969   2.6647252          6          0   4.52e-17   4.52e-17 |
   7. | 2.4438892   2.5811342          7          0   .4784157   .4784157 |
   8. | 2.6730205   2.7329779          8          0   1.07e-16   1.07e-16 |
      +-------------------------------------------------------------------+
(note: file out_923/Y_lnearn_ss_nnls1_short_ia.dta not found)
file out_923/Y_lnearn_ss_nnls1_short_ia.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1     .1579927     .1579927
    logit            2            0            0
  lassocv            3    .09690273    .09690273
  ridgecv            4    .13980729    .13980729
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7    .30331421    .30331421
       rf            8    3.341e-17    3.341e-17
       rf            9    8.385e-17    8.385e-17
gradboost           10    .03315897    .03315897
gradboost           11    .24809187    .24809187
     nnet           12    9.336e-17    9.336e-17
     nnet           13    .02073224    .02073224

short-stacked weights across resamples for lnearn
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .06111196    .06111196
      ols            2            0    2.367e-16    2.367e-16
  lassocv            3            0            0            0
  ridgecv            4            0    .13085316    .13085316
  lassocv            5            0    .12169093    .12169093
  ridgecv            6            0    4.519e-17    4.519e-17
       rf            7            0    .47841568    .47841568
       rf            8            0    1.072e-16    1.072e-16
       rf            9            0    8.785e-17    8.785e-17
gradboost           10            0     .0452285     .0452285
gradboost           11            0    .16269978    .16269978
     nnet           12            0    2.790e-17    2.790e-17
     nnet           13            0    9.904e-17    9.904e-17
      ols            1            1    .04661346    .04661346
      ols            2            1    5.305e-17    5.305e-17
  lassocv            3            1    .13850527    .13850527
  ridgecv            4            1    1.792e-17    1.792e-17
  lassocv            5            1    .26005322    .26005322
  ridgecv            6            1    7.905e-19    7.905e-19
       rf            7            1     .5012466     .5012466
       rf            8            1    2.863e-17    2.863e-17
       rf            9            1    3.290e-17    3.290e-17
gradboost           10            1    1.185e-17    1.185e-17
gradboost           11            1     .0446192     .0446192
     nnet           12            1    5.953e-18    5.953e-18
     nnet           13            1    .00896225    .00896225

D_gender_r_ss[13,3]
               learner  mean_weight        rep_1
    logit            1     .1579927     .1579927
    logit            2            0            0
  lassocv            3    .09690273    .09690273
  ridgecv            4    .13980729    .13980729
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7    .30331421    .30331421
       rf            8    3.341e-17    3.341e-17
       rf            9    8.385e-17    8.385e-17
gradboost           10    .03315897    .03315897
gradboost           11    .24809187    .24809187
     nnet           12    9.336e-17    9.336e-17
     nnet           13    .02073224    .02073224

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .75966605          1   .1579927   .1579927 |
   2. | .40057309          2          0          0 |
   3. | .09377459          3   .0969027   .0969027 |
   4. | .18897504          4   .1398073   .1398073 |
   5. | .47611459          5          0          0 |
      |--------------------------------------------|
   6. | .85599841          6          0          0 |
   7. |  .7937194          7   .3033142   .3033142 |
   8. |  .8368697          8   3.34e-17   3.34e-17 |
      +--------------------------------------------+
(note: file out_923/D_gender_r_ss_nnls1_short_ia.dta not found)
file out_923/D_gender_r_ss_nnls1_short_ia.dta saved

pool-stacked weights across resamples for gender_r
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .26848161    .26848161
    logit            2    9.474e-17    9.474e-17
  lassocv            3    .11604087    .11604087
  ridgecv            4    .06260273    .06260273
  lassocv            5    5.528e-17    5.528e-17
  ridgecv            6    8.490e-17    8.490e-17
       rf            7     .2725315     .2725315
       rf            8            0            0
       rf            9    5.150e-17    5.150e-17
gradboost           10    7.904e-17    7.904e-17
gradboost           11    .26083157    .26083157
     nnet           12    2.289e-16    2.289e-16
     nnet           13    .01951173    .01951173

pool-stacked weights across resamples for lnearn
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .01542845    .01542845
      ols            2            0    5.532e-16    5.532e-16
  lassocv            3            0    .12322997    .12322997
  ridgecv            4            0    .23887625    .23887625
  lassocv            5            0    4.348e-16    4.348e-16
  ridgecv            6            0    2.010e-15    2.010e-15
       rf            7            0    .44474416    .44474416
       rf            8            0    1.130e-15    1.130e-15
       rf            9            0    1.622e-15    1.622e-15
gradboost           10            0            0            0
gradboost           11            0    .17772117    .17772117
     nnet           12            0    3.460e-15    3.460e-15
     nnet           13            0    2.604e-16    2.604e-16
      ols            1            1    .00292327    .00292327
      ols            2            1            0            0
  lassocv            3            1     .0786187     .0786187
  ridgecv            4            1    .06503827    .06503827
  lassocv            5            1    .21821893    .21821893
  ridgecv            6            1    .02519302    .02519302
       rf            7            1    .51181816    .51181816
       rf            8            1    8.492e-18    8.492e-18
       rf            9            1    1.234e-15    1.234e-15
gradboost           10            1            0            0
gradboost           11            1    .08468355    .08468355
     nnet           12            1            0            0
     nnet           13            1     .0135061     .0135061

pool-stacked weights across resamples for gender_r
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .26848161    .26848161
    logit            2    9.474e-17    9.474e-17
  lassocv            3    .11604087    .11604087
  ridgecv            4    .06260273    .06260273
  lassocv            5    5.528e-17    5.528e-17
  ridgecv            6    8.490e-17    8.490e-17
       rf            7     .2725315     .2725315
       rf            8            0            0
       rf            9    5.150e-17    5.150e-17
gradboost           10    7.904e-17    7.904e-17
gradboost           11    .26083157    .26083157
     nnet           12    2.289e-16    2.289e-16
     nnet           13    .01951173    .01951173

pool-stacked weights across resamples for lnearn
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .01542845    .01542845
      ols            2            0    5.532e-16    5.532e-16
  lassocv            3            0    .12322997    .12322997
  ridgecv            4            0    .23887625    .23887625
  lassocv            5            0    4.348e-16    4.348e-16
  ridgecv            6            0    2.010e-15    2.010e-15
       rf            7            0    .44474416    .44474416
       rf            8            0    1.130e-15    1.130e-15
       rf            9            0    1.622e-15    1.622e-15
gradboost           10            0            0            0
gradboost           11            0    .17772117    .17772117
     nnet           12            0    3.460e-15    3.460e-15
     nnet           13            0    2.604e-16    2.604e-16
      ols            1            1    .00292327    .00292327
      ols            2            1            0            0
  lassocv            3            1     .0786187     .0786187
  ridgecv            4            1    .06503827    .06503827
  lassocv            5            1    .21821893    .21821893
  ridgecv            6            1    .02519302    .02519302
       rf            7            1    .51181816    .51181816
       rf            8            1    8.492e-18    8.492e-18
       rf            9            1    1.234e-15    1.234e-15
gradboost           10            1            0            0
gradboost           11            1    .08468355    .08468355
     nnet           12            1            0            0
     nnet           13            1     .0135061     .0135061

Y_lnearn_ps[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .01542845    .01542845
      ols            2            0    5.532e-16    5.532e-16
  lassocv            3            0    .12322997    .12322997
  ridgecv            4            0    .23887625    .23887625
  lassocv            5            0    4.348e-16    4.348e-16
  ridgecv            6            0    2.010e-15    2.010e-15
       rf            7            0    .44474416    .44474416
       rf            8            0    1.130e-15    1.130e-15
       rf            9            0    1.622e-15    1.622e-15
gradboost           10            0            0            0
gradboost           11            0    .17772117    .17772117
     nnet           12            0    3.460e-15    3.460e-15
     nnet           13            0    2.604e-16    2.604e-16
      ols            1            1    .00292327    .00292327
      ols            2            1            0            0
  lassocv            3            1     .0786187     .0786187
  ridgecv            4            1    .06503827    .06503827
  lassocv            5            1    .21821893    .21821893
  ridgecv            6            1    .02519302    .02519302
       rf            7            1    .51181816    .51181816
       rf            8            1    8.492e-18    8.492e-18
       rf            9            1    1.234e-15    1.234e-15
gradboost           10            1            0            0
gradboost           11            1    .08468355    .08468355
     nnet           12            1            0            0
     nnet           13            1     .0135061     .0135061

      +-------------------------------------------------------------------+
      | Y_lne~1_1   Y_lne~0_1   Y_lne~s1   Y_lnea~2   Y_lnea~3   Y_lnea~4 |
      |-------------------------------------------------------------------|
   1. | 2.5484276   2.7360937          1          0   .0154284   .0154284 |
   2. | 3.0084644   3.2646836          2          0   5.53e-16   5.53e-16 |
   3. | 2.8029241   2.9053826          3          0     .12323     .12323 |
   4. | 2.4697251   2.6126104          4          0   .2388763   .2388763 |
   5. | 3.0810573   3.1400948          5          0   4.35e-16   4.35e-16 |
      |-------------------------------------------------------------------|
   6. | 2.5332467   2.6670462          6          0   2.01e-15   2.01e-15 |
   7. |  2.413195   2.6113286          7          0   .4447442   .4447442 |
   8. | 2.6520788   2.7171135          8          0   1.13e-15   1.13e-15 |
      +-------------------------------------------------------------------+
(note: file out_923/Y_lnearn_ps_nnls1_pooled_ia.dta not found)
file out_923/Y_lnearn_ps_nnls1_pooled_ia.dta saved

pool-stacked weights across resamples for gender_r
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .26848161    .26848161
    logit            2    9.474e-17    9.474e-17
  lassocv            3    .11604087    .11604087
  ridgecv            4    .06260273    .06260273
  lassocv            5    5.528e-17    5.528e-17
  ridgecv            6    8.490e-17    8.490e-17
       rf            7     .2725315     .2725315
       rf            8            0            0
       rf            9    5.150e-17    5.150e-17
gradboost           10    7.904e-17    7.904e-17
gradboost           11    .26083157    .26083157
     nnet           12    2.289e-16    2.289e-16
     nnet           13    .01951173    .01951173

pool-stacked weights across resamples for lnearn
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .01542845    .01542845
      ols            2            0    5.532e-16    5.532e-16
  lassocv            3            0    .12322997    .12322997
  ridgecv            4            0    .23887625    .23887625
  lassocv            5            0    4.348e-16    4.348e-16
  ridgecv            6            0    2.010e-15    2.010e-15
       rf            7            0    .44474416    .44474416
       rf            8            0    1.130e-15    1.130e-15
       rf            9            0    1.622e-15    1.622e-15
gradboost           10            0            0            0
gradboost           11            0    .17772117    .17772117
     nnet           12            0    3.460e-15    3.460e-15
     nnet           13            0    2.604e-16    2.604e-16
      ols            1            1    .00292327    .00292327
      ols            2            1            0            0
  lassocv            3            1     .0786187     .0786187
  ridgecv            4            1    .06503827    .06503827
  lassocv            5            1    .21821893    .21821893
  ridgecv            6            1    .02519302    .02519302
       rf            7            1    .51181816    .51181816
       rf            8            1    8.492e-18    8.492e-18
       rf            9            1    1.234e-15    1.234e-15
gradboost           10            1            0            0
gradboost           11            1    .08468355    .08468355
     nnet           12            1            0            0
     nnet           13            1     .0135061     .0135061

D_gender_r_ps[13,3]
               learner  mean_weight        rep_1
    logit            1    .26848161    .26848161
    logit            2    9.474e-17    9.474e-17
  lassocv            3    .11604087    .11604087
  ridgecv            4    .06260273    .06260273
  lassocv            5    5.528e-17    5.528e-17
  ridgecv            6    8.490e-17    8.490e-17
       rf            7     .2725315     .2725315
       rf            8            0            0
       rf            9    5.150e-17    5.150e-17
gradboost           10    7.904e-17    7.904e-17
gradboost           11    .26083157    .26083157
     nnet           12    2.289e-16    2.289e-16
     nnet           13    .01951173    .01951173

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .75065524          1   .2684816   .2684816 |
   2. | .38383661          2   9.47e-17   9.47e-17 |
   3. |  .0923243          3   .1160409   .1160409 |
   4. | .18313078          4   .0626027   .0626027 |
   5. | .47859655          5   5.53e-17   5.53e-17 |
      |--------------------------------------------|
   6. | .85967596          6   8.49e-17   8.49e-17 |
   7. | .81383651          7   .2725315   .2725315 |
   8. | .85326078          8          0          0 |
      +--------------------------------------------+
(note: file out_923/D_gender_r_ps_nnls1_pooled_ia.dta not found)
file out_923/D_gender_r_ps_nnls1_pooled_ia.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.075    (0.030)
  ss  1  [shortstack]          [ss]          [ss]    -0.089    (0.019)
  ps  1   [poolstack]          [ps]          [ps]    -0.065    (0.031)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0889917   .0185273    -4.80   0.000    -.1253045   -.0526788
------------------------------------------------------------------------------
Stacking final estimator: singlebest



Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.075    (0.030)
  ss  1  [shortstack]          [ss]          [ss]    -0.089    (0.019)
  ps  1   [poolstack]          [ps]          [ps]    -0.065    (0.031)

Stacking DDML model (ATET)
E[y|X,D=0]   = Y1_pystacked0_1                     Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1
E[D|X]       = D1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0745597   .0297063    -2.51   0.012    -.1327829   -.0163365
------------------------------------------------------------------------------
Stacking final estimator: singlebest
Warning: 85 propensity scores trimmed to lower limit .01.
Warning: 17 propensity scores trimmed to upper limit .99.
Warning: . resamples had propensity scores trimmed to upper limit .99.

file out_923/results.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  ss  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.089    (0.019)
  ss  1  [shortstack]          [ss]          [ss]    -0.089    (0.019)
  ps  1   [poolstack]          [ps]          [ps]    -0.065    (0.031)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0889917   .0185273    -4.80   0.000    -.1253045   -.0526788
------------------------------------------------------------------------------
Stacking final estimator: singlebest

file out_923/results.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  ps  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.065    (0.031)
  ss  1  [shortstack]          [ss]          [ss]    -0.089    (0.019)
  ps  1   [poolstack]          [ps]          [ps]    -0.065    (0.031)

Poolstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ps0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ps1
E[D|X]       = D_gender_r_ps_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0652778   .0314785    -2.07   0.038    -.1269746    -.003581
------------------------------------------------------------------------------
Stacking final estimator: singlebest
Warning: 102 propensity scores trimmed to lower limit .01.
Warning: 21 propensity scores trimmed to upper limit .99.
Warning: . resamples had propensity scores trimmed to upper limit .99.

file out_923/results.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3           .7           .7
  ridgecv            4            0            0
  lassocv            5           .1           .1
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10           .2           .2
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1           .1           .1
  ridgecv            4            1            0            0
  lassocv            5            1           .1           .1
  ridgecv            6            1            0            0
       rf            7            1           .8           .8
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3           .7           .7
  ridgecv            4            0            0
  lassocv            5           .1           .1
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10           .2           .2
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1           .1           .1
  ridgecv            4            1            0            0
  lassocv            5            1           .1           .1
  ridgecv            6            1            0            0
       rf            7            1           .8           .8
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

Y1_pystacked_w_mn[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1           .1           .1
  ridgecv            4            1            0            0
  lassocv            5            1           .1           .1
  ridgecv            6            1            0            0
       rf            7            1           .8           .8
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

      +-------------------------------------------+
      | Y1_pys~1   Y1_pys~2   Y1_pys~3   Y1_pys~4 |
      |-------------------------------------------|
   1. |        1          0          0          0 |
   2. |        2          0          0          0 |
   3. |        3          0          0          0 |
   4. |        4          0          0          0 |
   5. |        5          0          0          0 |
      |-------------------------------------------|
   6. |        6          0          0          0 |
   7. |        7          0          1          1 |
   8. |        8          0          0          0 |
      +-------------------------------------------+
(note: file out_923/Y1_pystacked_w_mn_singlebest_regular_ia.dta not found)
file out_923/Y1_pystacked_w_mn_singlebest_regular_ia.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3           .7           .7
  ridgecv            4            0            0
  lassocv            5           .1           .1
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10           .2           .2
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1           .1           .1
  ridgecv            4            1            0            0
  lassocv            5            1           .1           .1
  ridgecv            6            1            0            0
       rf            7            1           .8           .8
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

D1_pystacked_w_mn[13,3]
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3           .7           .7
  ridgecv            4            0            0
  lassocv            5           .1           .1
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10           .2           .2
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

      +--------------------------------+
      | D1_pys~1   D1_pys~2   D1_pys~3 |
      |--------------------------------|
   1. |        1          0          0 |
   2. |        2          0          0 |
   3. |        3         .7         .7 |
   4. |        4          0          0 |
   5. |        5         .1         .1 |
      |--------------------------------|
   6. |        6          0          0 |
   7. |        7          0          0 |
   8. |        8          0          0 |
      +--------------------------------+
(note: file out_923/D1_pystacked_w_mn_singlebest_regular_ia.dta not found)
file out_923/D1_pystacked_w_mn_singlebest_regular_ia.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3            0            0
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            1            1
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

short-stacked weights across resamples for lnearn
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

short-stacked weights across resamples for gender_r
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3            0            0
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            1            1
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

short-stacked weights across resamples for lnearn
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

Y_lnearn_ss[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

      +-------------------------------------------------------------------+
      | Y_lne~1_1   Y_lne~0_1   Y_lne~s1   Y_lnea~2   Y_lnea~3   Y_lnea~4 |
      |-------------------------------------------------------------------|
   1. | 2.5380211   2.7976632          1          0          0          0 |
   2. | 2.9416361   3.2323666          2          0          0          0 |
   3. |  2.897661   2.9088264          3          0          0          0 |
   4. | 2.4971538   2.6453459          4          0          0          0 |
   5. | 3.0338829   3.1256461          5          0          0          0 |
      |-------------------------------------------------------------------|
   6. | 2.4665527   2.6547542          6          0          0          0 |
   7. | 2.4847815   2.8359649          7          0          1          1 |
   8. | 2.6914895   2.8125668          8          0          0          0 |
      +-------------------------------------------------------------------+
(note: file out_923/Y_lnearn_ss_singlebest_short_ia.dta not found)
file out_923/Y_lnearn_ss_singlebest_short_ia.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3            0            0
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            1            1
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

short-stacked weights across resamples for lnearn
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

D_gender_r_ss[13,3]
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3            0            0
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            1            1
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .83313161          1          0          0 |
   2. | .54619795          2          0          0 |
   3. | .11888732          3          0          0 |
   4. | .22929426          4          0          0 |
   5. | .42443505          5          0          0 |
      |--------------------------------------------|
   6. | .88516158          6          0          0 |
   7. |  .8311832          7          0          0 |
   8. | .76999259          8          0          0 |
      +--------------------------------------------+
(note: file out_923/D_gender_r_ss_singlebest_short_ia.dta not found)
file out_923/D_gender_r_ss_singlebest_short_ia.dta saved

pool-stacked weights across resamples for gender_r
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3            1            1
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

pool-stacked weights across resamples for lnearn
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

pool-stacked weights across resamples for gender_r
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3            1            1
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

pool-stacked weights across resamples for lnearn
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

Y_lnearn_ps[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

      +-------------------------------------------------------------------+
      | Y_lne~1_1   Y_lne~0_1   Y_lne~s1   Y_lnea~2   Y_lnea~3   Y_lnea~4 |
      |-------------------------------------------------------------------|
   1. | 2.5380211   2.7976632          1          0          0          0 |
   2. | 2.9416361   3.2323666          2          0          0          0 |
   3. |  2.897661   2.9088264          3          0          0          0 |
   4. | 2.4971538   2.6453459          4          0          0          0 |
   5. | 3.0338829   3.1256461          5          0          0          0 |
      |-------------------------------------------------------------------|
   6. | 2.4665527   2.6547542          6          0          0          0 |
   7. | 2.4847815   2.8359649          7          0          1          1 |
   8. | 2.6914895   2.8125668          8          0          0          0 |
      +-------------------------------------------------------------------+
(note: file out_923/Y_lnearn_ps_singlebest_pooled_ia.dta not found)
file out_923/Y_lnearn_ps_singlebest_pooled_ia.dta saved

pool-stacked weights across resamples for gender_r
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3            1            1
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

pool-stacked weights across resamples for lnearn
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

D_gender_r_ps[13,3]
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3            1            1
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .70281583          1          0          0 |
   2. | .31032693          2          0          0 |
   3. |  .0442751          3          1          1 |
   4. | .20730293          4          0          0 |
   5. | .57000428          5          0          0 |
      |--------------------------------------------|
   6. | .84310764          6          0          0 |
   7. | .81734771          7          0          0 |
   8. | .72774345          8          0          0 |
      +--------------------------------------------+
(note: file out_923/D_gender_r_ps_singlebest_pooled_ia.dta not found)
file out_923/D_gender_r_ps_singlebest_pooled_ia.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.681    (0.344)
  ss  1  [shortstack]          [ss]          [ss]    -0.023    (0.082)
  ps  1   [poolstack]          [ps]          [ps]     0.083    (0.078)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0229736   .0816051    -0.28   0.778    -.1829166    .1369695
------------------------------------------------------------------------------
Stacking final estimator: ols
Warning: 6 propensity scores trimmed to lower limit .01.
Warning: 265 propensity scores trimmed to upper limit .99.
Warning: . resamples had propensity scores trimmed to upper limit .99.



Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.681    (0.344)
  ss  1  [shortstack]          [ss]          [ss]    -0.023    (0.082)
  ps  1   [poolstack]          [ps]          [ps]     0.083    (0.078)

Stacking DDML model (ATET)
E[y|X,D=0]   = Y1_pystacked0_1                     Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1
E[D|X]       = D1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |   -.681342   .3437941    -1.98   0.047    -1.355166   -.0075178
------------------------------------------------------------------------------
Stacking final estimator: ols
Warning: 3445 propensity scores trimmed to lower limit .01.
Warning: 501 propensity scores trimmed to upper limit .99.
Warning: . resamples had propensity scores trimmed to upper limit .99.

(note: variable final was str3, now str10 to accommodate using data's values)
file out_923/results.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  ss  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.023    (0.082)
  ss  1  [shortstack]          [ss]          [ss]    -0.023    (0.082)
  ps  1   [poolstack]          [ps]          [ps]     0.083    (0.078)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0229736   .0816051    -0.28   0.778    -.1829166    .1369695
------------------------------------------------------------------------------
Stacking final estimator: ols
Warning: 6 propensity scores trimmed to lower limit .01.
Warning: 265 propensity scores trimmed to upper limit .99.
Warning: . resamples had propensity scores trimmed to upper limit .99.

(note: variable final was str3, now str10 to accommodate using data's values)
file out_923/results.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  ps  1  Y1_pystacked  Y1_pystacked  D1_pystacked     0.083    (0.078)
  ss  1  [shortstack]          [ss]          [ss]    -0.023    (0.082)
  ps  1   [poolstack]          [ps]          [ps]     0.083    (0.078)

Poolstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ps0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ps1
E[D|X]       = D_gender_r_ps_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |   .0826815   .0779567     1.06   0.289    -.0701107    .2354738
------------------------------------------------------------------------------
Stacking final estimator: ols
Warning: 46 propensity scores trimmed to lower limit .01.
Warning: 123 propensity scores trimmed to upper limit .99.
Warning: . resamples had propensity scores trimmed to upper limit .99.

(note: variable final was str3, now str10 to accommodate using data's values)
file out_923/results.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .22093037    .22093037
    logit            2    .07174122    .07174122
  lassocv            3    .29414548    .29414548
  ridgecv            4      .126005      .126005
  lassocv            5   -.16431604   -.16431604
  ridgecv            6   -.03819047   -.03819047
       rf            7    .36183029    .36183029
       rf            8    .15190897    .15190897
       rf            9   -.23253443   -.23253443
gradboost           10    .05923929    .05923929
gradboost           11    .19770755    .19770755
     nnet           12   -.98693023   -.98693023
     nnet           13     .0254365     .0254365

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .02316468    .02316468
      ols            2            0   -.04550523   -.04550523
  lassocv            3            0    .01449461    .01449461
  ridgecv            4            0    .57598256    .57598256
  lassocv            5            0   -.04744565   -.04744565
  ridgecv            6            0   -.11445056   -.11445056
       rf            7            0    .63392395    .63392395
       rf            8            0   -.22403998   -.22403998
       rf            9            0    .15408929    .15408929
gradboost           10            0    .06350299    .06350299
gradboost           11            0    .10108143    .10108143
     nnet           12            0    -.9994099    -.9994099
     nnet           13            0   -.01050482   -.01050482
      ols            1            1   -.00581561   -.00581561
      ols            2            1   -.02434039   -.02434039
  lassocv            3            1   -.17412401   -.17412401
  ridgecv            4            1    .29384316    .29384316
  lassocv            5            1    .39718998    .39718998
  ridgecv            6            1   -.06333721   -.06333721
       rf            7            1    .53173961    .53173961
       rf            8            1    .38025644    .38025644
       rf            9            1   -.28241015   -.28241015
gradboost           10            1   -.06091179   -.06091179
gradboost           11            1    .06159098    .06159098
     nnet           12            1   -.16769785   -.16769785
     nnet           13            1    .00581667    .00581667

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .22093037    .22093037
    logit            2    .07174122    .07174122
  lassocv            3    .29414548    .29414548
  ridgecv            4      .126005      .126005
  lassocv            5   -.16431604   -.16431604
  ridgecv            6   -.03819047   -.03819047
       rf            7    .36183029    .36183029
       rf            8    .15190897    .15190897
       rf            9   -.23253443   -.23253443
gradboost           10    .05923929    .05923929
gradboost           11    .19770755    .19770755
     nnet           12   -.98693023   -.98693023
     nnet           13     .0254365     .0254365

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .02316468    .02316468
      ols            2            0   -.04550523   -.04550523
  lassocv            3            0    .01449461    .01449461
  ridgecv            4            0    .57598256    .57598256
  lassocv            5            0   -.04744565   -.04744565
  ridgecv            6            0   -.11445056   -.11445056
       rf            7            0    .63392395    .63392395
       rf            8            0   -.22403998   -.22403998
       rf            9            0    .15408929    .15408929
gradboost           10            0    .06350299    .06350299
gradboost           11            0    .10108143    .10108143
     nnet           12            0    -.9994099    -.9994099
     nnet           13            0   -.01050482   -.01050482
      ols            1            1   -.00581561   -.00581561
      ols            2            1   -.02434039   -.02434039
  lassocv            3            1   -.17412401   -.17412401
  ridgecv            4            1    .29384316    .29384316
  lassocv            5            1    .39718998    .39718998
  ridgecv            6            1   -.06333721   -.06333721
       rf            7            1    .53173961    .53173961
       rf            8            1    .38025644    .38025644
       rf            9            1   -.28241015   -.28241015
gradboost           10            1   -.06091179   -.06091179
gradboost           11            1    .06159098    .06159098
     nnet           12            1   -.16769785   -.16769785
     nnet           13            1    .00581667    .00581667

Y1_pystacked_w_mn[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .02316468    .02316468
      ols            2            0   -.04550523   -.04550523
  lassocv            3            0    .01449461    .01449461
  ridgecv            4            0    .57598256    .57598256
  lassocv            5            0   -.04744565   -.04744565
  ridgecv            6            0   -.11445056   -.11445056
       rf            7            0    .63392395    .63392395
       rf            8            0   -.22403998   -.22403998
       rf            9            0    .15408929    .15408929
gradboost           10            0    .06350299    .06350299
gradboost           11            0    .10108143    .10108143
     nnet           12            0    -.9994099    -.9994099
     nnet           13            0   -.01050482   -.01050482
      ols            1            1   -.00581561   -.00581561
      ols            2            1   -.02434039   -.02434039
  lassocv            3            1   -.17412401   -.17412401
  ridgecv            4            1    .29384316    .29384316
  lassocv            5            1    .39718998    .39718998
  ridgecv            6            1   -.06333721   -.06333721
       rf            7            1    .53173961    .53173961
       rf            8            1    .38025644    .38025644
       rf            9            1   -.28241015   -.28241015
gradboost           10            1   -.06091179   -.06091179
gradboost           11            1    .06159098    .06159098
     nnet           12            1   -.16769785   -.16769785
     nnet           13            1    .00581667    .00581667

      +---------------------------------------------+
      | Y1_pys~1   Y1_pys~2   Y1_pyst~3   Y1_pyst~4 |
      |---------------------------------------------|
   1. |        1          0    .0231647    .0231647 |
   2. |        2          0   -.0455052   -.0455052 |
   3. |        3          0    .0144946    .0144946 |
   4. |        4          0    .5759826    .5759826 |
   5. |        5          0   -.0474456   -.0474456 |
      |---------------------------------------------|
   6. |        6          0   -.1144506   -.1144506 |
   7. |        7          0    .6339239    .6339239 |
   8. |        8          0     -.22404     -.22404 |
      +---------------------------------------------+
(note: file out_923/Y1_pystacked_w_mn_ols_regular_ia.dta not found)
file out_923/Y1_pystacked_w_mn_ols_regular_ia.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .22093037    .22093037
    logit            2    .07174122    .07174122
  lassocv            3    .29414548    .29414548
  ridgecv            4      .126005      .126005
  lassocv            5   -.16431604   -.16431604
  ridgecv            6   -.03819047   -.03819047
       rf            7    .36183029    .36183029
       rf            8    .15190897    .15190897
       rf            9   -.23253443   -.23253443
gradboost           10    .05923929    .05923929
gradboost           11    .19770755    .19770755
     nnet           12   -.98693023   -.98693023
     nnet           13     .0254365     .0254365

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .02316468    .02316468
      ols            2            0   -.04550523   -.04550523
  lassocv            3            0    .01449461    .01449461
  ridgecv            4            0    .57598256    .57598256
  lassocv            5            0   -.04744565   -.04744565
  ridgecv            6            0   -.11445056   -.11445056
       rf            7            0    .63392395    .63392395
       rf            8            0   -.22403998   -.22403998
       rf            9            0    .15408929    .15408929
gradboost           10            0    .06350299    .06350299
gradboost           11            0    .10108143    .10108143
     nnet           12            0    -.9994099    -.9994099
     nnet           13            0   -.01050482   -.01050482
      ols            1            1   -.00581561   -.00581561
      ols            2            1   -.02434039   -.02434039
  lassocv            3            1   -.17412401   -.17412401
  ridgecv            4            1    .29384316    .29384316
  lassocv            5            1    .39718998    .39718998
  ridgecv            6            1   -.06333721   -.06333721
       rf            7            1    .53173961    .53173961
       rf            8            1    .38025644    .38025644
       rf            9            1   -.28241015   -.28241015
gradboost           10            1   -.06091179   -.06091179
gradboost           11            1    .06159098    .06159098
     nnet           12            1   -.16769785   -.16769785
     nnet           13            1    .00581667    .00581667

D1_pystacked_w_mn[13,3]
               learner  mean_weight        rep_1
    logit            1    .22093037    .22093037
    logit            2    .07174122    .07174122
  lassocv            3    .29414548    .29414548
  ridgecv            4      .126005      .126005
  lassocv            5   -.16431604   -.16431604
  ridgecv            6   -.03819047   -.03819047
       rf            7    .36183029    .36183029
       rf            8    .15190897    .15190897
       rf            9   -.23253443   -.23253443
gradboost           10    .05923929    .05923929
gradboost           11    .19770755    .19770755
     nnet           12   -.98693023   -.98693023
     nnet           13     .0254365     .0254365

      +----------------------------------+
      | D1_pys~1   D1_pyst~2   D1_pyst~3 |
      |----------------------------------|
   1. |        1    .2209304    .2209304 |
   2. |        2    .0717412    .0717412 |
   3. |        3    .2941455    .2941455 |
   4. |        4     .126005     .126005 |
   5. |        5    -.164316    -.164316 |
      |----------------------------------|
   6. |        6   -.0381905   -.0381905 |
   7. |        7    .3618303    .3618303 |
   8. |        8     .151909     .151909 |
      +----------------------------------+
(note: file out_923/D1_pystacked_w_mn_ols_regular_ia.dta not found)
file out_923/D1_pystacked_w_mn_ols_regular_ia.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .13850584    .13850584
    logit            2    .06581002    .06581002
  lassocv            3    .11608185    .11608185
  ridgecv            4    .21571675    .21571675
  lassocv            5   -.16304899   -.16304899
  ridgecv            6    .07946416    .07946416
       rf            7    .44391531    .44391531
       rf            8    .13107311    .13107311
       rf            9   -.31875928   -.31875928
gradboost           10    .15864057    .15864057
gradboost           11    .15464672    .15464672
     nnet           12    .03884203    .03884203
     nnet           13    .01479704    .01479704

short-stacked weights across resamples for lnearn
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .09218088    .09218088
      ols            2            0   -.04146573   -.04146573
  lassocv            3            0   -.25214026   -.25214026
  ridgecv            4            0    .69283852    .69283852
  lassocv            5            0    .17372826    .17372826
  ridgecv            6            0   -.25366381   -.25366381
       rf            7            0    .72915686    .72915686
       rf            8            0    .16642854    .16642854
       rf            9            0    -.4600521    -.4600521
gradboost           10            0    .12196076    .12196076
gradboost           11            0    .04930274    .04930274
     nnet           12            0   -.02824578   -.02824578
     nnet           13            0   -.01524129   -.01524129
      ols            1            1     .0391679     .0391679
      ols            2            1   -.02279015   -.02279015
  lassocv            3            1    .08518654    .08518654
  ridgecv            4            1    .11432844    .11432844
  lassocv            5            1    .31662469    .31662469
  ridgecv            6            1   -.05033216   -.05033216
       rf            7            1    .62973304    .62973304
       rf            8            1    .03080417    .03080417
       rf            9            1   -.02688953   -.02688953
gradboost           10            1   -.08592169   -.08592169
gradboost           11            1    .02031668    .02031668
     nnet           12            1    .04560004    .04560004
     nnet           13            1    .00274656    .00274656

short-stacked weights across resamples for gender_r
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .13850584    .13850584
    logit            2    .06581002    .06581002
  lassocv            3    .11608185    .11608185
  ridgecv            4    .21571675    .21571675
  lassocv            5   -.16304899   -.16304899
  ridgecv            6    .07946416    .07946416
       rf            7    .44391531    .44391531
       rf            8    .13107311    .13107311
       rf            9   -.31875928   -.31875928
gradboost           10    .15864057    .15864057
gradboost           11    .15464672    .15464672
     nnet           12    .03884203    .03884203
     nnet           13    .01479704    .01479704

short-stacked weights across resamples for lnearn
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .09218088    .09218088
      ols            2            0   -.04146573   -.04146573
  lassocv            3            0   -.25214026   -.25214026
  ridgecv            4            0    .69283852    .69283852
  lassocv            5            0    .17372826    .17372826
  ridgecv            6            0   -.25366381   -.25366381
       rf            7            0    .72915686    .72915686
       rf            8            0    .16642854    .16642854
       rf            9            0    -.4600521    -.4600521
gradboost           10            0    .12196076    .12196076
gradboost           11            0    .04930274    .04930274
     nnet           12            0   -.02824578   -.02824578
     nnet           13            0   -.01524129   -.01524129
      ols            1            1     .0391679     .0391679
      ols            2            1   -.02279015   -.02279015
  lassocv            3            1    .08518654    .08518654
  ridgecv            4            1    .11432844    .11432844
  lassocv            5            1    .31662469    .31662469
  ridgecv            6            1   -.05033216   -.05033216
       rf            7            1    .62973304    .62973304
       rf            8            1    .03080417    .03080417
       rf            9            1   -.02688953   -.02688953
gradboost           10            1   -.08592169   -.08592169
gradboost           11            1    .02031668    .02031668
     nnet           12            1    .04560004    .04560004
     nnet           13            1    .00274656    .00274656

Y_lnearn_ss[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .09218088    .09218088
      ols            2            0   -.04146573   -.04146573
  lassocv            3            0   -.25214026   -.25214026
  ridgecv            4            0    .69283852    .69283852
  lassocv            5            0    .17372826    .17372826
  ridgecv            6            0   -.25366381   -.25366381
       rf            7            0    .72915686    .72915686
       rf            8            0    .16642854    .16642854
       rf            9            0    -.4600521    -.4600521
gradboost           10            0    .12196076    .12196076
gradboost           11            0    .04930274    .04930274
     nnet           12            0   -.02824578   -.02824578
     nnet           13            0   -.01524129   -.01524129
      ols            1            1     .0391679     .0391679
      ols            2            1   -.02279015   -.02279015
  lassocv            3            1    .08518654    .08518654
  ridgecv            4            1    .11432844    .11432844
  lassocv            5            1    .31662469    .31662469
  ridgecv            6            1   -.05033216   -.05033216
       rf            7            1    .62973304    .62973304
       rf            8            1    .03080417    .03080417
       rf            9            1   -.02688953   -.02688953
gradboost           10            1   -.08592169   -.08592169
gradboost           11            1    .02031668    .02031668
     nnet           12            1    .04560004    .04560004
     nnet           13            1    .00274656    .00274656

      +---------------------------------------------------------------------+
      | Y_lne~1_1   Y_lne~0_1   Y_lne~s1   Y_lnea~2   Y_lnear~3   Y_lnear~4 |
      |---------------------------------------------------------------------|
   1. |  2.783194    2.650642          1          0    .0921809    .0921809 |
   2. | 3.2869851   3.2152412          2          0   -.0414657   -.0414657 |
   3. | 3.1019297   2.8161509          3          0   -.2521403   -.2521403 |
   4. | 2.7127959   2.5316288          4          0    .6928385    .6928385 |
   5. | 3.3523565   3.0663303          5          0    .1737283    .1737283 |
      |---------------------------------------------------------------------|
   6. | 2.7985876   2.5698049          6          0   -.2536638   -.2536638 |
   7. | 2.6542751   2.5250647          7          0    .7291569    .7291569 |
   8. | 2.9489721   2.6291305          8          0    .1664285    .1664285 |
      +---------------------------------------------------------------------+
(note: file out_923/Y_lnearn_ss_ols_short_ia.dta not found)
file out_923/Y_lnearn_ss_ols_short_ia.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .13850584    .13850584
    logit            2    .06581002    .06581002
  lassocv            3    .11608185    .11608185
  ridgecv            4    .21571675    .21571675
  lassocv            5   -.16304899   -.16304899
  ridgecv            6    .07946416    .07946416
       rf            7    .44391531    .44391531
       rf            8    .13107311    .13107311
       rf            9   -.31875928   -.31875928
gradboost           10    .15864057    .15864057
gradboost           11    .15464672    .15464672
     nnet           12    .03884203    .03884203
     nnet           13    .01479704    .01479704

short-stacked weights across resamples for lnearn
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .09218088    .09218088
      ols            2            0   -.04146573   -.04146573
  lassocv            3            0   -.25214026   -.25214026
  ridgecv            4            0    .69283852    .69283852
  lassocv            5            0    .17372826    .17372826
  ridgecv            6            0   -.25366381   -.25366381
       rf            7            0    .72915686    .72915686
       rf            8            0    .16642854    .16642854
       rf            9            0    -.4600521    -.4600521
gradboost           10            0    .12196076    .12196076
gradboost           11            0    .04930274    .04930274
     nnet           12            0   -.02824578   -.02824578
     nnet           13            0   -.01524129   -.01524129
      ols            1            1     .0391679     .0391679
      ols            2            1   -.02279015   -.02279015
  lassocv            3            1    .08518654    .08518654
  ridgecv            4            1    .11432844    .11432844
  lassocv            5            1    .31662469    .31662469
  ridgecv            6            1   -.05033216   -.05033216
       rf            7            1    .62973304    .62973304
       rf            8            1    .03080417    .03080417
       rf            9            1   -.02688953   -.02688953
gradboost           10            1   -.08592169   -.08592169
gradboost           11            1    .02031668    .02031668
     nnet           12            1    .04560004    .04560004
     nnet           13            1    .00274656    .00274656

D_gender_r_ss[13,3]
               learner  mean_weight        rep_1
    logit            1    .13850584    .13850584
    logit            2    .06581002    .06581002
  lassocv            3    .11608185    .11608185
  ridgecv            4    .21571675    .21571675
  lassocv            5   -.16304899   -.16304899
  ridgecv            6    .07946416    .07946416
       rf            7    .44391531    .44391531
       rf            8    .13107311    .13107311
       rf            9   -.31875928   -.31875928
gradboost           10    .15864057    .15864057
gradboost           11    .15464672    .15464672
     nnet           12    .03884203    .03884203
     nnet           13    .01479704    .01479704

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .80335699          1   .1385058   .1385058 |
   2. | .47525826          2     .06581     .06581 |
   3. | .11618078          3   .1160818   .1160818 |
   4. | .17672993          4   .2157167   .2157167 |
   5. | .49817408          5   -.163049   -.163049 |
      |--------------------------------------------|
   6. | .92726233          6   .0794642   .0794642 |
   7. | .85032261          7   .4439153   .4439153 |
   8. | .87159129          8   .1310731   .1310731 |
      +--------------------------------------------+
(note: file out_923/D_gender_r_ss_ols_short_ia.dta not found)
file out_923/D_gender_r_ss_ols_short_ia.dta saved

pool-stacked weights across resamples for gender_r
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .23146519    .23146519
    logit            2    .07244678    .07244678
  lassocv            3    .13893313    .13893313
  ridgecv            4    .12336783    .12336783
  lassocv            5   -.03670491   -.03670491
  ridgecv            6   -.02670392   -.02670392
       rf            7    .36872584    .36872584
       rf            8     .1565415     .1565415
       rf            9    -.2380255    -.2380255
gradboost           10    .06151186    .06151186
gradboost           11    .19952304    .19952304
     nnet           12   -.03530757   -.03530757
     nnet           13    .02201393    .02201393

pool-stacked weights across resamples for lnearn
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .01711077    .01711077
      ols            2            0   -.04787389   -.04787389
  lassocv            3            0    .05786351    .05786351
  ridgecv            4            0    .51478368    .51478368
  lassocv            5            0   -.07481209   -.07481209
  ridgecv            6            0    -.0729899    -.0729899
       rf            7            0    .65444472    .65444472
       rf            8            0   -.17359134   -.17359134
       rf            9            0    .10283998    .10283998
gradboost           10            0    .05693158    .05693158
gradboost           11            0    .09860595    .09860595
     nnet           12            0    .00086841    .00086841
     nnet           13            0   -.01374668   -.01374668
      ols            1            1     .0008895     .0008895
      ols            2            1   -.02283756   -.02283756
  lassocv            3            1   -.10026601   -.10026601
  ridgecv            4            1    .31582289    .31582289
  lassocv            5            1    .29371761    .29371761
  ridgecv            6            1   -.06249668   -.06249668
       rf            7            1    .54132018    .54132018
       rf            8            1     .3884768     .3884768
       rf            9            1   -.28790508   -.28790508
gradboost           10            1   -.05493411   -.05493411
gradboost           11            1    .05930842    .05930842
     nnet           12            1     .0159891     .0159891
     nnet           13            1    .00798814    .00798814

pool-stacked weights across resamples for gender_r
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .23146519    .23146519
    logit            2    .07244678    .07244678
  lassocv            3    .13893313    .13893313
  ridgecv            4    .12336783    .12336783
  lassocv            5   -.03670491   -.03670491
  ridgecv            6   -.02670392   -.02670392
       rf            7    .36872584    .36872584
       rf            8     .1565415     .1565415
       rf            9    -.2380255    -.2380255
gradboost           10    .06151186    .06151186
gradboost           11    .19952304    .19952304
     nnet           12   -.03530757   -.03530757
     nnet           13    .02201393    .02201393

pool-stacked weights across resamples for lnearn
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .01711077    .01711077
      ols            2            0   -.04787389   -.04787389
  lassocv            3            0    .05786351    .05786351
  ridgecv            4            0    .51478368    .51478368
  lassocv            5            0   -.07481209   -.07481209
  ridgecv            6            0    -.0729899    -.0729899
       rf            7            0    .65444472    .65444472
       rf            8            0   -.17359134   -.17359134
       rf            9            0    .10283998    .10283998
gradboost           10            0    .05693158    .05693158
gradboost           11            0    .09860595    .09860595
     nnet           12            0    .00086841    .00086841
     nnet           13            0   -.01374668   -.01374668
      ols            1            1     .0008895     .0008895
      ols            2            1   -.02283756   -.02283756
  lassocv            3            1   -.10026601   -.10026601
  ridgecv            4            1    .31582289    .31582289
  lassocv            5            1    .29371761    .29371761
  ridgecv            6            1   -.06249668   -.06249668
       rf            7            1    .54132018    .54132018
       rf            8            1     .3884768     .3884768
       rf            9            1   -.28790508   -.28790508
gradboost           10            1   -.05493411   -.05493411
gradboost           11            1    .05930842    .05930842
     nnet           12            1     .0159891     .0159891
     nnet           13            1    .00798814    .00798814

Y_lnearn_ps[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .01711077    .01711077
      ols            2            0   -.04787389   -.04787389
  lassocv            3            0    .05786351    .05786351
  ridgecv            4            0    .51478368    .51478368
  lassocv            5            0   -.07481209   -.07481209
  ridgecv            6            0    -.0729899    -.0729899
       rf            7            0    .65444472    .65444472
       rf            8            0   -.17359134   -.17359134
       rf            9            0    .10283998    .10283998
gradboost           10            0    .05693158    .05693158
gradboost           11            0    .09860595    .09860595
     nnet           12            0    .00086841    .00086841
     nnet           13            0   -.01374668   -.01374668
      ols            1            1     .0008895     .0008895
      ols            2            1   -.02283756   -.02283756
  lassocv            3            1   -.10026601   -.10026601
  ridgecv            4            1    .31582289    .31582289
  lassocv            5            1    .29371761    .29371761
  ridgecv            6            1   -.06249668   -.06249668
       rf            7            1    .54132018    .54132018
       rf            8            1     .3884768     .3884768
       rf            9            1   -.28790508   -.28790508
gradboost           10            1   -.05493411   -.05493411
gradboost           11            1    .05930842    .05930842
     nnet           12            1     .0159891     .0159891
     nnet           13            1    .00798814    .00798814

      +---------------------------------------------------------------------+
      | Y_lne~1_1   Y_lne~0_1   Y_lne~s1   Y_lnea~2   Y_lnear~3   Y_lnear~4 |
      |---------------------------------------------------------------------|
   1. | 2.7814779     3.07367          1          0    .0171108    .0171108 |
   2. |  3.264805   3.6259833          2          0   -.0478739   -.0478739 |
   3. | 3.0707695   3.2425493          3          0    .0578635    .0578635 |
   4. | 2.7046076   2.9273931          4          0    .5147837    .5147837 |
   5. | 3.3738041   3.5089598          5          0   -.0748121   -.0748121 |
      |---------------------------------------------------------------------|
   6. | 2.7838259   2.9833072          6          0   -.0729899   -.0729899 |
   7. | 2.6222355   2.9780757          7          0    .6544447    .6544447 |
   8. | 2.9172617   3.0397391          8          0   -.1735913   -.1735913 |
      +---------------------------------------------------------------------+
(note: file out_923/Y_lnearn_ps_ols_pooled_ia.dta not found)
file out_923/Y_lnearn_ps_ols_pooled_ia.dta saved

pool-stacked weights across resamples for gender_r
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .23146519    .23146519
    logit            2    .07244678    .07244678
  lassocv            3    .13893313    .13893313
  ridgecv            4    .12336783    .12336783
  lassocv            5   -.03670491   -.03670491
  ridgecv            6   -.02670392   -.02670392
       rf            7    .36872584    .36872584
       rf            8     .1565415     .1565415
       rf            9    -.2380255    -.2380255
gradboost           10    .06151186    .06151186
gradboost           11    .19952304    .19952304
     nnet           12   -.03530757   -.03530757
     nnet           13    .02201393    .02201393

pool-stacked weights across resamples for lnearn
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .01711077    .01711077
      ols            2            0   -.04787389   -.04787389
  lassocv            3            0    .05786351    .05786351
  ridgecv            4            0    .51478368    .51478368
  lassocv            5            0   -.07481209   -.07481209
  ridgecv            6            0    -.0729899    -.0729899
       rf            7            0    .65444472    .65444472
       rf            8            0   -.17359134   -.17359134
       rf            9            0    .10283998    .10283998
gradboost           10            0    .05693158    .05693158
gradboost           11            0    .09860595    .09860595
     nnet           12            0    .00086841    .00086841
     nnet           13            0   -.01374668   -.01374668
      ols            1            1     .0008895     .0008895
      ols            2            1   -.02283756   -.02283756
  lassocv            3            1   -.10026601   -.10026601
  ridgecv            4            1    .31582289    .31582289
  lassocv            5            1    .29371761    .29371761
  ridgecv            6            1   -.06249668   -.06249668
       rf            7            1    .54132018    .54132018
       rf            8            1     .3884768     .3884768
       rf            9            1   -.28790508   -.28790508
gradboost           10            1   -.05493411   -.05493411
gradboost           11            1    .05930842    .05930842
     nnet           12            1     .0159891     .0159891
     nnet           13            1    .00798814    .00798814

D_gender_r_ps[13,3]
               learner  mean_weight        rep_1
    logit            1    .23146519    .23146519
    logit            2    .07244678    .07244678
  lassocv            3    .13893313    .13893313
  ridgecv            4    .12336783    .12336783
  lassocv            5   -.03670491   -.03670491
  ridgecv            6   -.02670392   -.02670392
       rf            7    .36872584    .36872584
       rf            8     .1565415     .1565415
       rf            9    -.2380255    -.2380255
gradboost           10    .06151186    .06151186
gradboost           11    .19952304    .19952304
     nnet           12   -.03530757   -.03530757
     nnet           13    .02201393    .02201393

      +----------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gende~2   D_gende~3 |
      |----------------------------------------------|
   1. | .75599315          1    .2314652    .2314652 |
   2. | .41595548          2    .0724468    .0724468 |
   3. | .08751436          3    .1389331    .1389331 |
   4. |  .1556946          4    .1233678    .1233678 |
   5. | .48166926          5   -.0367049   -.0367049 |
      |----------------------------------------------|
   6. | .90487414          6   -.0267039   -.0267039 |
   7. | .84843437          7    .3687258    .3687258 |
   8. | .87118867          8    .1565415    .1565415 |
      +----------------------------------------------+
(note: file out_923/D_gender_r_ps_ols_pooled_ia.dta not found)
file out_923/D_gender_r_ps_ols_pooled_ia.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.101    (0.016)
  ss  1  [shortstack]          [ss]          [ss]    -0.101    (0.016)
  ps  1   [poolstack]          [ps]          [ps]    -0.101    (0.016)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1009374   .0163305    -6.18   0.000    -.1329445   -.0689303
------------------------------------------------------------------------------
Stacking final estimator: avg



Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.101    (0.016)
  ss  1  [shortstack]          [ss]          [ss]    -0.101    (0.016)
  ps  1   [poolstack]          [ps]          [ps]    -0.101    (0.016)

Stacking DDML model (ATET)
E[y|X,D=0]   = Y1_pystacked0_1                     Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1
E[D|X]       = D1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1009374   .0163305    -6.18   0.000    -.1329445   -.0689303
------------------------------------------------------------------------------
Stacking final estimator: avg

(note: variable final was str3, now str10 to accommodate using data's values)
file out_923/results.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  ss  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.101    (0.016)
  ss  1  [shortstack]          [ss]          [ss]    -0.101    (0.016)
  ps  1   [poolstack]          [ps]          [ps]    -0.101    (0.016)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1009374   .0163305    -6.18   0.000    -.1329445   -.0689303
------------------------------------------------------------------------------
Stacking final estimator: avg

(note: variable final was str3, now str10 to accommodate using data's values)
file out_923/results.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  ps  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.101    (0.016)
  ss  1  [shortstack]          [ss]          [ss]    -0.101    (0.016)
  ps  1   [poolstack]          [ps]          [ps]    -0.101    (0.016)

Poolstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ps0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ps1
E[D|X]       = D_gender_r_ps_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1009374   .0163305    -6.18   0.000    -.1329445   -.0689303
------------------------------------------------------------------------------
Stacking final estimator: avg

(note: variable final was str3, now str10 to accommodate using data's values)
file out_923/results.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

Y1_pystacked_w_mn[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

      +-------------------------------------------+
      | Y1_pys~1   Y1_pys~2   Y1_pys~3   Y1_pys~4 |
      |-------------------------------------------|
   1. |        1          0   .0769231   .0769231 |
   2. |        2          0   .0769231   .0769231 |
   3. |        3          0   .0769231   .0769231 |
   4. |        4          0   .0769231   .0769231 |
   5. |        5          0   .0769231   .0769231 |
      |-------------------------------------------|
   6. |        6          0   .0769231   .0769231 |
   7. |        7          0   .0769231   .0769231 |
   8. |        8          0   .0769231   .0769231 |
      +-------------------------------------------+
(note: file out_923/Y1_pystacked_w_mn_avg_regular_ia.dta not found)
file out_923/Y1_pystacked_w_mn_avg_regular_ia.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

D1_pystacked_w_mn[13,3]
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

      +--------------------------------+
      | D1_pys~1   D1_pys~2   D1_pys~3 |
      |--------------------------------|
   1. |        1   .0769231   .0769231 |
   2. |        2   .0769231   .0769231 |
   3. |        3   .0769231   .0769231 |
   4. |        4   .0769231   .0769231 |
   5. |        5   .0769231   .0769231 |
      |--------------------------------|
   6. |        6   .0769231   .0769231 |
   7. |        7   .0769231   .0769231 |
   8. |        8   .0769231   .0769231 |
      +--------------------------------+
(note: file out_923/D1_pystacked_w_mn_avg_regular_ia.dta not found)
file out_923/D1_pystacked_w_mn_avg_regular_ia.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

short-stacked weights across resamples for lnearn
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

short-stacked weights across resamples for gender_r
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

short-stacked weights across resamples for lnearn
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

Y_lnearn_ss[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

      +-------------------------------------------------------------------+
      | Y_lne~1_1   Y_lne~0_1   Y_lne~s1   Y_lnea~2   Y_lnea~3   Y_lnea~4 |
      |-------------------------------------------------------------------|
   1. | 2.6012568   2.7773339          1          0   .0769231   .0769231 |
   2. | 3.0684542   3.2201567          2          0   .0769231   .0769231 |
   3. | 2.6868488   2.8443182          3          0   .0769231   .0769231 |
   4. | 2.4555743   2.6123568          4          0   .0769231   .0769231 |
   5. | 3.0757958   3.1185081          5          0   .0769231   .0769231 |
      |-------------------------------------------------------------------|
   6. | 2.5911444    2.674483          6          0   .0769231   .0769231 |
   7. | 2.4347493   2.4600966          7          0   .0769231   .0769231 |
   8. | 2.7300184   2.7964416          8          0   .0769231   .0769231 |
      +-------------------------------------------------------------------+
(note: file out_923/Y_lnearn_ss_avg_short_ia.dta not found)
file out_923/Y_lnearn_ss_avg_short_ia.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

short-stacked weights across resamples for lnearn
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

D_gender_r_ss[13,3]
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .73679005          1   .0769231   .0769231 |
   2. | .42389489          2   .0769231   .0769231 |
   3. | .17014988          3   .0769231   .0769231 |
   4. | .30710256          4   .0769231   .0769231 |
   5. |  .5179018          5   .0769231   .0769231 |
      |--------------------------------------------|
   6. | .80254982          6   .0769231   .0769231 |
   7. | .75475445          7   .0769231   .0769231 |
   8. | .75645766          8   .0769231   .0769231 |
      +--------------------------------------------+
(note: file out_923/D_gender_r_ss_avg_short_ia.dta not found)
file out_923/D_gender_r_ss_avg_short_ia.dta saved

pool-stacked weights across resamples for gender_r
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

pool-stacked weights across resamples for lnearn
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

pool-stacked weights across resamples for gender_r
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

pool-stacked weights across resamples for lnearn
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

Y_lnearn_ps[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

      +-------------------------------------------------------------------+
      | Y_lne~1_1   Y_lne~0_1   Y_lne~s1   Y_lnea~2   Y_lnea~3   Y_lnea~4 |
      |-------------------------------------------------------------------|
   1. | 2.6012568   2.7773339          1          0   .0769231   .0769231 |
   2. | 3.0684542   3.2201567          2          0   .0769231   .0769231 |
   3. | 2.6868488   2.8443182          3          0   .0769231   .0769231 |
   4. | 2.4555743   2.6123568          4          0   .0769231   .0769231 |
   5. | 3.0757958   3.1185081          5          0   .0769231   .0769231 |
      |-------------------------------------------------------------------|
   6. | 2.5911444    2.674483          6          0   .0769231   .0769231 |
   7. | 2.4347493   2.4600966          7          0   .0769231   .0769231 |
   8. | 2.7300184   2.7964416          8          0   .0769231   .0769231 |
      +-------------------------------------------------------------------+
(note: file out_923/Y_lnearn_ps_avg_pooled_ia.dta not found)
file out_923/Y_lnearn_ps_avg_pooled_ia.dta saved

pool-stacked weights across resamples for gender_r
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

pool-stacked weights across resamples for lnearn
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

D_gender_r_ps[13,3]
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .73679005          1   .0769231   .0769231 |
   2. | .42389489          2   .0769231   .0769231 |
   3. | .17014988          3   .0769231   .0769231 |
   4. | .30710256          4   .0769231   .0769231 |
   5. |  .5179018          5   .0769231   .0769231 |
      |--------------------------------------------|
   6. | .80254982          6   .0769231   .0769231 |
   7. | .75475445          7   .0769231   .0769231 |
   8. | .75645766          8   .0769231   .0769231 |
      +--------------------------------------------+
(note: file out_923/D_gender_r_ps_avg_pooled_ia.dta not found)
file out_923/D_gender_r_ps_avg_pooled_ia.dta saved
. 
.         forvalues i = 1(1)$L {
  2.                         ddml estimate, y1(Y1_pystacked1_L`i'_1) y0(Y1_pyst
> acked0_L`i'_1) ///
>                                                         d(D1_pystacked_L`i'_1
> ) robust atet foldvar(m0_sample_1  )
  3.                         regsave gender_r using `folder'/results.dta, ci //
> /
>                                                 addlabel(model,interactive,se
> ed,`seed',final,indiv,learner,`i') ///
>                                                 append
  4.         }

E[y|X,D=0]   = Y1_pystacked0_L1_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L1_1
E[D|X]       = D1_pystacked_L1_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0657918   .0622584    -1.06   0.291     -.187816    .0562324
------------------------------------------------------------------------------
Warning: 145 propensity scores trimmed to lower limit ..
Warning: 41 propensity scores trimmed to upper limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_923/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L2_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L2_1
E[D|X]       = D1_pystacked_L2_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1203164   .0163374    -7.36   0.000    -.1523371   -.0882958
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_923/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L3_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L3_1
E[D|X]       = D1_pystacked_L3_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0589513    .034173    -1.73   0.085    -.1259291    .0080266
------------------------------------------------------------------------------
Warning: 102 propensity scores trimmed to lower limit ..
Warning: 21 propensity scores trimmed to upper limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_923/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L4_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L4_1
E[D|X]       = D1_pystacked_L4_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0828591   .0708472    -1.17   0.242    -.2217169    .0559988
------------------------------------------------------------------------------
Warning: 110 propensity scores trimmed to lower limit ..
Warning: 36 propensity scores trimmed to upper limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_923/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L5_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L5_1
E[D|X]       = D1_pystacked_L5_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0837321   .0435542    -1.92   0.055    -.1690967    .0016325
------------------------------------------------------------------------------
Warning: 109 propensity scores trimmed to lower limit ..
Warning: 24 propensity scores trimmed to upper limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_923/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L6_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L6_1
E[D|X]       = D1_pystacked_L6_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0959639   .1068865    -0.90   0.369    -.3054575    .1135298
------------------------------------------------------------------------------
Warning: 88 propensity scores trimmed to lower limit ..
Warning: 20 propensity scores trimmed to upper limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_923/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L7_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L7_1
E[D|X]       = D1_pystacked_L7_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0813002   .0187244    -4.34   0.000    -.1179994    -.044601
------------------------------------------------------------------------------
Warning: 5 propensity scores trimmed to lower limit ..
Warning: 1 propensity scores trimmed to upper limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_923/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L8_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L8_1
E[D|X]       = D1_pystacked_L8_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1037038   .0155559    -6.67   0.000    -.1341928   -.0732147
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_923/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L9_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L9_1
E[D|X]       = D1_pystacked_L9_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1091638   .0149821    -7.29   0.000    -.1385282   -.0797994
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_923/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L10_1                 Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L10_1
E[D|X]       = D1_pystacked_L10_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0785751   .0185765    -4.23   0.000    -.1149843   -.0421658
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_923/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L11_1                 Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L11_1
E[D|X]       = D1_pystacked_L11_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0471095   .0384196    -1.23   0.220    -.1224105    .0281915
------------------------------------------------------------------------------
Warning: 84 propensity scores trimmed to lower limit ..
Warning: 22 propensity scores trimmed to upper limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_923/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L12_1                 Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L12_1
E[D|X]       = D1_pystacked_L12_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1213392   .0373238    -3.25   0.001    -.1944924   -.0481859
------------------------------------------------------------------------------
Warning: 10 propensity scores trimmed to upper limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_923/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L13_1                 Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L13_1
E[D|X]       = D1_pystacked_L13_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1638185   .2036687    -0.80   0.421    -.5630019    .2353649
------------------------------------------------------------------------------
Warning: 181 propensity scores trimmed to lower limit ..
Warning: 165 propensity scores trimmed to upper limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_923/results.dta saved
. 
. }       

.         
. *****************************************************************************
> *  
. *** interactive NX: short-stacking                                           
>                                       ***
. *****************************************************************************
> *
. 
. if (`estimator'==3) {
. 
. gen one = 1     
. 
.         cap drop y0base*
.         cap drop dbase*
.         cap drop y1base*
. 
.         *** no cross-fitting
.         pystacked lnearn $X_expanded   $pystring_reg0  if gender_r == 0, type
> (reg) njobs($cores)  
.                 mat nxw_ia_y0 = e(weights)
.                 mat list nxw_ia_y0
.                                 preserve
.                                 svmat nxw_ia_y0
.                                 keep nxw_ia_y0*
.                                 save `folder'/nxw_ia_y0, replace
.                                 restore
.         predict y0base0, xb
.         predict y0base, base
. 
.         pystacked lnearn $X_expanded  $pystring_reg0 if gender_r == 1  , type
> (reg) njobs($cores)  
.                 mat nxw_ia_y1 = e(weights)
.                 mat list nxw_ia_y1
.                                 preserve
.                                 svmat nxw_ia_y1
.                                 keep nxw_ia_y1*
.                                 save `folder'/nxw_ia_y1, replace
.                                 restore
.         predict y1base0, xb
.         predict y1base, base
. 
.         pystacked gender_r $X_expanded $pystring_class  
.                 mat nxw_ia_d = e(weights)
.                 mat list nxw_ia_d
.                                 preserve
.                                 svmat nxw_ia_d
.                                 keep nxw_ia_d*
.                                 save `folder'/nxw_ia_d, replace
.                                 restore         
.         predict dbase0, pr
.         predict dbase, base pr
.         
.         forvalues i = 0(1)$L {
  2.                         _estimate_ate interactive, yname(lnearn) dname(gen
> der_r) ///
>                                                 y0(y0base`i') y1(y1base`i') d
> (dbase`i') ///
>                                                 atet foldid(one) robust model
> (interactive)
  3.                         regsave gender_r using `folder'/results.dta, ///
>                                                 ci addlabel(model,nxinter,see
> d,`seed',final,nx,learner,`i') append
  4.         }
.                 
. }

.         
. *****************************************************************************
> *  
. *** partial NX: short-stacking                                               
>                                       ***
. *****************************************************************************
> *
. 
. if (`estimator'==4) {
.         
. cap gen one = 1 
. 
.         cap drop Ybase* 
.         cap drop Dbase*
. 
.         *** no cross-fitting
.         pystacked lnearn $X_expanded $pystring_reg 
.                 mat nxw_y = e(weights)
.                 mat list nxw_y
.                                 preserve
.                                 svmat nxw_y
.                                 keep nxw_y*
.                                 save `folder'/nxw_y, replace
.                                 restore
.         predict Ybase0
.         predict Ybase, basexb
. 
.         pystacked gender_r $X_expanded $pystring_reg 
.                 mat nxw_d = e(weights)
.                 mat list nxw_d
.                                 preserve
.                                 svmat nxw_d
.                                 keep nxw_d*
.                                 save `folder'/nxw_d, replace
.                                 restore         
.         predict Dbase0
.         predict Dbase, basexb
. 
.         forvalues i = 0(1)$L {
  2.                 cap drop Ytil
  3.                 cap drop Dtil
  4.                 gen Ytil = lnearn - Ybase`i'
  5.                 gen Dtil = gender_r - Dbase`i'
  6.                 reg Ytil Dtil, robust
  7.                 regsave Dtil using `folder'/results.dta, ///
>                         ci addlabel(model,nxpartial,seed,`seed',final,nx,lear
> ner,`i') append
  8.         }
. 
. }

.         
. cap log close
