-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /cluster/home/kahrens/ddml_applied/GWG/Output/GWG_53356_1.txt
  log type:  text
 opened on:  10 Dec 2023, 19:14:52

. 
. which ddml
/cluster/home/kahrens/ado/plus/d/ddml.ado
*! ddml v1.4.3
*! last edited: 17aug2023
*! authors: aa/ms

. which pystacked
/cluster/home/kahrens/ado/plus/p/pystacked.ado
*! pystacked v0.7.5
*! last edited: 7aug2023
*! authors: aa/ms

. 
. set seed `seed'

. local folder out_`seed'

. 
. use "../Data/gender_gap_ML_processed", clear

. 
. cap mkdir `folder'

. 
. *****************************************************************************
> ***
. ***  controls
. *****************************************************************************
> ***
. 
. // create squared age and tenure here
. gen age_r2 = age_r^2

. gen tenure2 = tenure^2
(2 missing values generated)

. 
. // no base categories
. global continuous                                                            
>                                                            ///
>         age_r                                                                
>                                                                    /// no mis
> sing
>         yrsqual         /* years of education (derived) */                   
>                                    /// 355 missing
>         /// leavedu             /* age when left education (derived) */      
>                            /// 1,081 missing
>         pvlit1          /* literacy score: plausible value 1 (also 2-10 avail
> ) */       /// no missing
>         pvnum1          /* numeracy score: plausible value 1 (also 2-10 avail
> ) */       /// no missing
>         tenure          /* tenure = years in work for current employer */    
>                    /// 2 missing
>                                                                              
>                                                                            //

. // add second order terms here
. global continuous $continuous age_r2 tenure2

. 
. global discrete0                                                             
>                                                            ///             
>         b_q01a          /* education, highest level attained */              
>                            /// no missing
>         b_q01b          /* area of study */                                  
>                                                    /// 434 missing
>         d_q06c          /* part of a larger organization */                  
>                                    /// 13 missing
>         d_q08a          /* management position */                            
>                                            /// no missing
>         d_q09           /* type of contract */                               
>                                            /// 12 missing
>         d_q10_t1        /* hours per week at this job or business */         
>                    /// 1 missing
>         d_q14           /* job satisfaction */                               
>                                            /// 1 missing
>         i_q08           /* health status */                                  
>                                                    /// 2 missing
>         j_q02a          /* living with a partner */                          
>                                            /// 899 missing
>         j_q03d1_c       /* age of youngest child */                          
>                                            /// 2,718 missing
>         j_q04c1_c       /* immigration: age */                               
>                                            /// 4,375 missing
>         j_q06b          /* mother's highest level of educ */                 
>                            /// 445 missing
>         j_q07b          /* father's highest level of educ */                 
>                            /// 515 missing
>         j_q03b          /* number of children*/                              
>                                            /// 1,856 missing
>         impar           /* immigration: parents */                           
>                                            /// 21 missing
>         imgen           /* immigration: generation */                        
>                                    /// 344 missing
>         nfe12jr         /* informal job-related educ in prev 12 months */    
>                    /// 116 missing
>         nfe12njr        /* informal non-job-related educ in prev 12 months */
>            /// 116 missing
>                                                                              
>                                                                            //
>                                                                              
>                                                          

. global personality                                                           
>                                                            ///
>         i_q04b          /* Learning strategies, Relate new ideas into real li
> fe */      /// 16 missing
>         i_q04d          /* Learning strategies, Like learning new things */  
>                    /// no missing
>         i_q04h          /* Learning strategies, Attribute something new */   
>                    /// 10 missing
>         i_q04j          /* Learning strategies, Deal with difficult things */
>            /// no missing
>         i_q04l          /* Learning strategies, Fit different ideas together 
> */         /// 5 missing
>         i_q04m          /* Learning strategies, Looking for additional info *
> /          /// 1 missing
>         i_q05f          /* Cultural engagement, Voluntary non-profit work */ 
>            /// no missing
>         i_q06a          /* Political efficacy, No influence on the government
>  */        /// 14 missing
>         i_q07a          /* Social trust, Trust only few people */            
>                            /// 4 missing
>         i_q07b          /* Social trust, Other people take advantage of you *
> /          /// 6 missing
>                                                                              
>                                                                            //

. global discrete $discrete0                                                   
>                                                    ///
>         new_reg_tl2     /* geographical region */                            
>                                            /// 2 missing
>         new_isco1c      /* occupation */                                     
>                                                    /// no missing
>         new_isic1c      /* industry */                                       
>                                                    // no missing

. 
. global X_simple                                                         ///
>         i.(b_q01a d_q10_t1 j_q03b)                              ///
>         c.($continuous)

. 
. global X_fullinteracted                                         ///
>         i.($discrete0 )                                                 ///
>         i.new_isco1c#i.new_isic1c#i.new_reg_tl2 ///
>         c.($continuous)                  

.         
. global X_cont                                                           ///
>         c.($continuous)##i.($discrete)

. 
. global X_expanded                                                       ///
>         i.($discrete)                                                   ///
>         c.($continuous)                                                 ///
>         c.age_r#i.($discrete)                                   ///
>         c.tenure#i.($discrete)

. 
.         
. 
. *****************************************************************************
> ***
. ***  estimation sample
. *****************************************************************************
> ***
. 
. gen byte touse=1

. markout touse lnearn $X_expanded

. keep if touse
(53 observations deleted)

. 
. 
. *****************************************************************************
> ***
. ***  learners
. *****************************************************************************
> ***
. 
. global cores = 5

. 
. global rf1 min_samples_leaf(1)  max_features(sqrt) n_estimators(500)

. global rf2 min_samples_leaf(50)  max_features(sqrt) n_estimators(500)

. global rf3 min_samples_leaf(100)  max_features(sqrt) n_estimators(500)

. global grad1 n_estimators(500) n_iter_no_change(10)  

. global grad2 n_estimators(500)  

. global nnet1 hidden_layer_sizes(40 20 1 20 50) early_stopping 

. global nnet2 hidden_layer_sizes(30 30 30) early_stopping  

. 
. global pystring_reg0                                                         
>    || ///
>                                         m(ols)                               
>                            || ///
>                                         m(ols) xvars($X_simple)              
>            || ///
>                                         m(lassocv)                           
>                            || ///
>                                         m(ridgecv)                           
>                            || ///
>                                         m(lassocv)      xvars($X_cont)       
>            || ///
>                                         m(ridgecv)      xvars($X_cont)       
>            || ///
>                                         m(rf) opt($rf1)                      
>                    || ///
>                                         m(rf) opt($rf2)                      
>                    || ///
>                                         m(rf) opt($rf3)                      
>                    || ///
>                                         m(gradboost) opt($grad1)             
>            || ///
>                                         m(gradboost) opt($grad2)             
>            || ///
>                                         m(nnet) opt($nnet1)                  
>            || ///
>                                         m(nnet) opt($nnet2)                  
>            || //

. 
. global pystring_reg  $pystring_reg0 , type(reg) njobs($cores) 

.  
. global pystring_class0                                                       
>            || ///
>                                         m(logit)                             
>                            || ///
>                                         m(logit) xvars($X_simple)            
>            || ///
>                                         m(lassocv)                           
>                            || ///
>                                         m(ridgecv)                           
>                            || ///
>                                         m(lassocv)      xvars($X_cont)       
>            || ///
>                                         m(ridgecv)      xvars($X_cont)       
>            || ///
>                                         m(rf) opt($rf1)                      
>                    || ///
>                                         m(rf) opt($rf2)                      
>                    || ///
>                                         m(rf) opt($rf3)                      
>                    || ///
>                                         m(gradboost) opt($grad1)             
>            || ///
>                                         m(gradboost) opt($grad2)             
>            || ///
>                                         m(nnet) opt($nnet1)                  
>            || ///
>                                         m(nnet) opt($nnet2)                  
>            || //                   

.                                 
. global pystring_class $pystring_class0 , type(class) njobs($cores)

.                                         
. global R =1  

. global K=10 

. global L =13

.         
. *****************************************************************************
> *  
. *** ddml: estimation                                                         
>                                               ***
. *****************************************************************************
> *
. 
. if (`estimator'==1) {
. 
.         ddml init partial,  reps($R) kfolds($K)
.         ddml E[Y|X]: pystacked lnearn $X_expanded $pystring_reg
Learner Y1_pystacked added successfully.
.         ddml E[D|X]: pystacked gender_r $X_expanded $pystring_reg
Learner D1_pystacked added successfully.
.         ddml crossfit, shortstack poolstack
Cross-fitting E[y|X] equation: lnearn
Cross-fitting fold 1 2 3 4 5 6 7 8 9 10 ...completed cross-fitting...completed 
> short-stacking...completed pooled-stacking
Cross-fitting E[D|X] equation: gender_r
Cross-fitting fold 1 2 3 4 5 6 7 8 9 10 ...completed cross-fitting...completed 
> short-stacking...completed pooled-stacking
.         ddml estimate, robust


Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  st  1  Y1_pystacked  D1_pystacked    -0.101    (0.017)
  ss  1  [shortstack]          [ss]    -0.101    (0.017)
  ps  1   [poolstack]          [ps]    -0.101    (0.017)

Shortstack DDML model
y-E[y|X]  = y-Y_lnearn_ss_1                        Number of obs   =      4836
D-E[D|X]  = D-D_gender_r_ss_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1006843   .0166507    -6.05   0.000    -.1333191   -.0680495
       _cons |  -.0025033   .0062801    -0.40   0.690    -.0148121    .0098056
------------------------------------------------------------------------------
Stacking final estimator: nnls1

.         
.         foreach mat in lnearn_mse gender_r_mse {
  2.                         ddml extract, show(mse)
  3.                         mat `mat' = r(`mat')
  4.                         mat list `mat'
  5.                                 preserve
  6.                                 svmat `mat'
  7.                                 keep `mat'*
  8.                                 keep if _n<=$L
  9.                                 gen stack_type = "conventional" if _n==1
 10.                                 replace stack_type = "pooled" if _n==2
 11.                                 replace stack_type = "short" if _n==3
 12.                                 gen model = "plm"
 13.                                 list if _n<=$L
 14.                                 save `folder'/`mat'_plm_mse, replace
 15.                                 restore 
 16.         }       

MSEs for gender_r:
                 rep   full smp      fold 1      fold 2      fold 3      fold 4
>       fold 5      fold 6      fold 7      fold 8      fold 9     fold 10 
    D1_pystacked   1      0.156       0.153       0.151       0.163       0.153
>        0.159       0.162       0.164       0.149       0.150       0.159  
   D_gender_r_ps   1      0.156       0.153       0.150       0.162       0.153
>        0.159       0.163       0.164       0.149       0.150       0.158  
   D_gender_r_ss   1      0.156       0.153       0.150       0.162       0.152
>        0.158       0.162       0.165       0.148       0.150       0.157  

MSEs for lnearn:
                 rep   full smp      fold 1      fold 2      fold 3      fold 4
>       fold 5      fold 6      fold 7      fold 8      fold 9     fold 10 
    Y1_pystacked   1      0.193       0.131       0.132       0.136       0.367
>        0.170       0.245       0.176       0.217       0.152       0.209  
     Y_lnearn_ps   1      0.193       0.132       0.133       0.131       0.368
>        0.169       0.243       0.174       0.217       0.151       0.210  
     Y_lnearn_ss   1      0.192       0.131       0.131       0.132       0.367
>        0.168       0.243       0.173       0.215       0.151       0.208  

lnearn_mse[3,12]
                      rep  full_sample        fold1        fold2        fold3
Y1_pystacked            1    .19346263    .13140864    .13201536    .13611695
 Y_lnearn_ps            1    .19310242    .13247944    .13300369    .13143445
 Y_lnearn_ss            1    .19197529    .13097935    .13135991    .13225636

                    fold4        fold5        fold6        fold7        fold8
Y1_pystacked    .36744699    .16983714    .24475677    .17587875    .21658856
 Y_lnearn_ps    .36832603    .16912419    .24333335    .17439792    .21733896
 Y_lnearn_ss    .36725551    .16812955    .24311624    .17342375    .21469344

                    fold9       fold10
Y1_pystacked    .15170876    .20877547
 Y_lnearn_ps     .1512212    .21026619
 Y_lnearn_ss    .15072522     .2077168
(4,823 observations deleted)
(12 missing values generated)
(1 real change made)
(1 real change made)

     +-----------------------------------------------------------------+
  1. | lnear~e1 | lnear~e2 | lnearn~3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        1 | .1934626 | .1314086 | .1320154 |  .136117 |  .367447 |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     | .1698371 | .2447568 | .1758787 | .2165886 | .1517088 | .2087755 |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |           conventional            |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  2. | lnear~e1 | lnear~e2 | lnearn~3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        1 | .1931024 | .1324794 | .1330037 | .1314345 |  .368326 |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     | .1691242 | .2433334 | .1743979 |  .217339 | .1512212 | .2102662 |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                 pooled            |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  3. | lnear~e1 | lnear~e2 | lnearn~3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        1 | .1919753 | .1309794 | .1313599 | .1322564 | .3672555 |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     | .1681295 | .2431162 | .1734238 | .2146934 | .1507252 | .2077168 |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                  short            |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  4. | lnear~e1 | lnear~e2 | lnearn~3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  5. | lnear~e1 | lnear~e2 | lnearn~3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  6. | lnear~e1 | lnear~e2 | lnearn~3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  7. | lnear~e1 | lnear~e2 | lnearn~3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  8. | lnear~e1 | lnear~e2 | lnearn~3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  9. | lnear~e1 | lnear~e2 | lnearn~3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 10. | lnear~e1 | lnear~e2 | lnearn~3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 11. | lnear~e1 | lnear~e2 | lnearn~3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 12. | lnear~e1 | lnear~e2 | lnearn~3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 13. | lnear~e1 | lnear~e2 | lnearn~3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+
(note: file out_53356/lnearn_mse_plm_mse.dta not found)
file out_53356/lnearn_mse_plm_mse.dta saved

MSEs for gender_r:
                 rep   full smp      fold 1      fold 2      fold 3      fold 4
>       fold 5      fold 6      fold 7      fold 8      fold 9     fold 10 
    D1_pystacked   1      0.156       0.153       0.151       0.163       0.153
>        0.159       0.162       0.164       0.149       0.150       0.159  
   D_gender_r_ps   1      0.156       0.153       0.150       0.162       0.153
>        0.159       0.163       0.164       0.149       0.150       0.158  
   D_gender_r_ss   1      0.156       0.153       0.150       0.162       0.152
>        0.158       0.162       0.165       0.148       0.150       0.157  

MSEs for lnearn:
                 rep   full smp      fold 1      fold 2      fold 3      fold 4
>       fold 5      fold 6      fold 7      fold 8      fold 9     fold 10 
    Y1_pystacked   1      0.193       0.131       0.132       0.136       0.367
>        0.170       0.245       0.176       0.217       0.152       0.209  
     Y_lnearn_ps   1      0.193       0.132       0.133       0.131       0.368
>        0.169       0.243       0.174       0.217       0.151       0.210  
     Y_lnearn_ss   1      0.192       0.131       0.131       0.132       0.367
>        0.168       0.243       0.173       0.215       0.151       0.208  

gender_r_mse[3,12]
                      rep  full_sample        fold1        fold2        fold3
D1_pystacked            1    .15606769    .15265025    .15075617     .1625345
D_gender_r~s            1    .15617014     .1529648    .15016521    .16244543
D_gender_r~s            1    .15570009    .15257122    .15023429    .16182764

                    fold4        fold5        fold6        fold7        fold8
D1_pystacked    .15251239    .15857931    .16202562     .1642016    .14884413
D_gender_r~s    .15264463    .15899841    .16252745    .16421511    .14934216
D_gender_r~s    .15244407    .15792489    .16157034    .16515226     .1484139

                    fold9       fold10
D1_pystacked    .14985484    .15872181
D_gender_r~s    .15021046    .15819314
D_gender_r~s    .14991445    .15695114
(4,823 observations deleted)
(12 missing values generated)
(1 real change made)
(1 real change made)

     +-----------------------------------------------------------------+
  1. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        1 | .1560677 | .1526503 | .1507562 | .1625345 | .1525124 |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     | .1585793 | .1620256 | .1642016 | .1488441 | .1498548 | .1587218 |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |           conventional            |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  2. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        1 | .1561701 | .1529648 | .1501652 | .1624454 | .1526446 |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     | .1589984 | .1625275 | .1642151 | .1493422 | .1502105 | .1581931 |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                 pooled            |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  3. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        1 | .1557001 | .1525712 | .1502343 | .1618276 | .1524441 |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     | .1579249 | .1615703 | .1651523 | .1484139 | .1499144 | .1569511 |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                  short            |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  4. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  5. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  6. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  7. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  8. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  9. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 10. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 11. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 12. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 13. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+
(note: file out_53356/gender_r_mse_plm_mse.dta not found)
file out_53356/gender_r_mse_plm_mse.dta saved
. 
.         cap drop mse_*
.         foreach var of varlist Y1_* {
  2.                  cap drop sqerr_`var'
  3.                  gen double sqerr_`var'=(lnearn-`var')^2
  4.                  sum sqerr_`var', meanonly
  5.                  gen double mse_`var'=r(mean) if _n ==1 
  6.         }
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
.         foreach var of varlist D1_* {
  2.                  cap drop sqerr_`var'
  3.                  gen double sqerr_`var'=(gender_r-`var')^2
  4.                  sum sqerr_`var', meanonly
  5.                  gen double mse_`var'=r(mean) if _n ==1 
  6.         }
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
.         preserve
.                 keep mse_*
.                 keep if _n==1
(4,835 observations deleted)
.                 save `folder'/plm_mse, replace
(note: file out_53356/plm_mse.dta not found)
file out_53356/plm_mse.dta saved
.         restore
.         cap drop mse_*
. 
.         ** initialize results file
.         regsave gender_r using `folder'/results.dta, ci addlabel(model,partia
> l,seed,`seed',final,init,learner,-99) replace
(note: file out_53356/results.dta not found)
file out_53356/results.dta saved
. 
.         foreach final in nnls1 singlebest ols avg {
  2. 
.                 ddml estimate, robust finalest(`final')
  3.         
.                         // regular stacking results
.                         ddml estimate, mname(m0) spec(st) replay  
  4.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,partial,seed,`seed',final,`final',learner,-1) append
  5.                         
.                         // shortstacking results
.                         ddml estimate, mname(m0) spec(ss) replay 
  6.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,partial,seed,`seed',final,`final',learner,-2) append
  7.                         
.                         // poolstacking results
.                         ddml estimate, mname(m0) spec(ps) replay  
  8.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,partial,seed,`seed',final,`final',learner,-3) append     
  9.                 
.                         // pystacked weights
.                         ddml extract, show(stweights)   
 10.                         foreach mat in Y1_pystacked_w_mn D1_pystacked_w_mn
>  {
 11.                                         ddml extract, show(stweights)   
 12.                                         mat `mat' = r(`mat')
 13.                                         mat list `mat'
 14.                                                 preserve
 15.                                                 svmat `mat'
 16.                                                 keep `mat'*
 17.                                                 list if _n<=4
 18.                                                 save `folder'/`mat'_`final
> '_regular, replace
 19.                                                 restore
 20.                         }       
 21.                         // shortstacked weights
.                         ddml extract, show(ssweights)
 22.                         foreach mat in Y_lnearn_ss D_gender_r_ss {
 23.                                         qui ddml extract, show(ssweights)
 24.                                         mat `mat' = r(`mat')
 25.                                         mat list `mat'
 26.                                                 preserve
 27.                                                 svmat `mat'
 28.                                                 keep `mat'*
 29.                                                 list if _n<=4
 30.                                                 save `folder'/`mat'_`final
> '_short, replace
 31.                                                 restore
 32.                         }       
 33.                         // poolstacked weights
. 
.                         foreach mat in Y_lnearn_ps D_gender_r_ps {
 34.                                         qui ddml extract, show(psweights)
 35.                                         mat `mat' = r(`mat')
 36.                                         mat list `mat'
 37.                                                 preserve
 38.                                                 svmat `mat'
 39.                                                 keep `mat'*
 40.                                                 list if _n<=4
 41.                                                 save `folder'/`mat'_`final
> '_pooled, replace
 42.                                                 restore
 43.                         }       
 44.         
.         }


Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  st  1  Y1_pystacked  D1_pystacked    -0.101    (0.017)
  ss  1  [shortstack]          [ss]    -0.101    (0.017)
  ps  1   [poolstack]          [ps]    -0.101    (0.017)

Shortstack DDML model
y-E[y|X]  = y-Y_lnearn_ss_1                        Number of obs   =      4836
D-E[D|X]  = D-D_gender_r_ss_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1006843   .0166507    -6.05   0.000    -.1333191   -.0680495
       _cons |  -.0025033   .0062801    -0.40   0.690    -.0148121    .0098056
------------------------------------------------------------------------------
Stacking final estimator: nnls1



Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  st  1  Y1_pystacked  D1_pystacked    -0.101    (0.017)
  ss  1  [shortstack]          [ss]    -0.101    (0.017)
  ps  1   [poolstack]          [ps]    -0.101    (0.017)

Stacking DDML model
y-E[y|X]  = y-Y1_pystacked_1                       Number of obs   =      4836
D-E[D|X]  = D-D1_pystacked_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1005368   .0166933    -6.02   0.000     -.133255   -.0678186
       _cons |  -.0023233   .0063056    -0.37   0.713     -.014682    .0100353
------------------------------------------------------------------------------
Stacking final estimator: nnls1

file out_53356/results.dta saved


Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  ss  1  Y1_pystacked  D1_pystacked    -0.101    (0.017)
  ss  1  [shortstack]          [ss]    -0.101    (0.017)
  ps  1   [poolstack]          [ps]    -0.101    (0.017)

Shortstack DDML model
y-E[y|X]  = y-Y_lnearn_ss_1                        Number of obs   =      4836
D-E[D|X]  = D-D_gender_r_ss_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1006843   .0166507    -6.05   0.000    -.1333191   -.0680495
       _cons |  -.0025033   .0062801    -0.40   0.690    -.0148121    .0098056
------------------------------------------------------------------------------
Stacking final estimator: nnls1

file out_53356/results.dta saved


Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  ps  1  Y1_pystacked  D1_pystacked    -0.101    (0.017)
  ss  1  [shortstack]          [ss]    -0.101    (0.017)
  ps  1   [poolstack]          [ps]    -0.101    (0.017)

Poolstack DDML model
y-E[y|X]  = y-Y_lnearn_ps_1                        Number of obs   =      4836
D-E[D|X]  = D-D_gender_r_ps_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1010774   .0167003    -6.05   0.000    -.1338094   -.0683454
       _cons |  -.0020626   .0062976    -0.33   0.743    -.0144057    .0102806
------------------------------------------------------------------------------
Stacking final estimator: nnls1

file out_53356/results.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: nnls1
               learner  mean_weight        rep_1
      ols            1    .08434032    .08434032
      ols            2    1.431e-16    1.431e-16
  lassocv            3    .27260138    .27260138
  ridgecv            4    3.674e-17    3.674e-17
  lassocv            5    6.607e-17    6.607e-17
  ridgecv            6    .00504663    .00504663
       rf            7    .41378263    .41378263
       rf            8    1.032e-16    1.032e-16
       rf            9    1.033e-16    1.033e-16
gradboost           10     .0204351     .0204351
gradboost           11    .18667786    .18667786
     nnet           12    2.259e-16    2.259e-16
     nnet           13    .01711607    .01711607

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: nnls1
               learner  mean_weight        rep_1
      ols            1    .00829463    .00829463
      ols            2    1.188e-16    1.188e-16
  lassocv            3    .00836916    .00836916
  ridgecv            4    .07268551    .07268551
  lassocv            5    .13847323    .13847323
  ridgecv            6    .17412498    .17412498
       rf            7    .36940765    .36940765
       rf            8    3.312e-17    3.312e-17
       rf            9    7.594e-17    7.594e-17
gradboost           10    .07097975    .07097975
gradboost           11    .10984148    .10984148
     nnet           12    .02544613    .02544613
     nnet           13    .02237749    .02237749

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: nnls1
               learner  mean_weight        rep_1
      ols            1    .08434032    .08434032
      ols            2    1.431e-16    1.431e-16
  lassocv            3    .27260138    .27260138
  ridgecv            4    3.674e-17    3.674e-17
  lassocv            5    6.607e-17    6.607e-17
  ridgecv            6    .00504663    .00504663
       rf            7    .41378263    .41378263
       rf            8    1.032e-16    1.032e-16
       rf            9    1.033e-16    1.033e-16
gradboost           10     .0204351     .0204351
gradboost           11    .18667786    .18667786
     nnet           12    2.259e-16    2.259e-16
     nnet           13    .01711607    .01711607

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: nnls1
               learner  mean_weight        rep_1
      ols            1    .00829463    .00829463
      ols            2    1.188e-16    1.188e-16
  lassocv            3    .00836916    .00836916
  ridgecv            4    .07268551    .07268551
  lassocv            5    .13847323    .13847323
  ridgecv            6    .17412498    .17412498
       rf            7    .36940765    .36940765
       rf            8    3.312e-17    3.312e-17
       rf            9    7.594e-17    7.594e-17
gradboost           10    .07097975    .07097975
gradboost           11    .10984148    .10984148
     nnet           12    .02544613    .02544613
     nnet           13    .02237749    .02237749

Y1_pystacked_w_mn[13,3]
               learner  mean_weight        rep_1
      ols            1    .00829463    .00829463
      ols            2    1.188e-16    1.188e-16
  lassocv            3    .00836916    .00836916
  ridgecv            4    .07268551    .07268551
  lassocv            5    .13847323    .13847323
  ridgecv            6    .17412498    .17412498
       rf            7    .36940765    .36940765
       rf            8    3.312e-17    3.312e-17
       rf            9    7.594e-17    7.594e-17
gradboost           10    .07097975    .07097975
gradboost           11    .10984148    .10984148
     nnet           12    .02544613    .02544613
     nnet           13    .02237749    .02237749

      +--------------------------------+
      | Y1_pys~1   Y1_pys~2   Y1_pys~3 |
      |--------------------------------|
   1. |        1   .0082946   .0082946 |
   2. |        2   1.19e-16   1.19e-16 |
   3. |        3   .0083692   .0083692 |
   4. |        4   .0726855   .0726855 |
      +--------------------------------+
(note: file out_53356/Y1_pystacked_w_mn_nnls1_regular.dta not found)
file out_53356/Y1_pystacked_w_mn_nnls1_regular.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: nnls1
               learner  mean_weight        rep_1
      ols            1    .08434032    .08434032
      ols            2    1.431e-16    1.431e-16
  lassocv            3    .27260138    .27260138
  ridgecv            4    3.674e-17    3.674e-17
  lassocv            5    6.607e-17    6.607e-17
  ridgecv            6    .00504663    .00504663
       rf            7    .41378263    .41378263
       rf            8    1.032e-16    1.032e-16
       rf            9    1.033e-16    1.033e-16
gradboost           10     .0204351     .0204351
gradboost           11    .18667786    .18667786
     nnet           12    2.259e-16    2.259e-16
     nnet           13    .01711607    .01711607

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: nnls1
               learner  mean_weight        rep_1
      ols            1    .00829463    .00829463
      ols            2    1.188e-16    1.188e-16
  lassocv            3    .00836916    .00836916
  ridgecv            4    .07268551    .07268551
  lassocv            5    .13847323    .13847323
  ridgecv            6    .17412498    .17412498
       rf            7    .36940765    .36940765
       rf            8    3.312e-17    3.312e-17
       rf            9    7.594e-17    7.594e-17
gradboost           10    .07097975    .07097975
gradboost           11    .10984148    .10984148
     nnet           12    .02544613    .02544613
     nnet           13    .02237749    .02237749

D1_pystacked_w_mn[13,3]
               learner  mean_weight        rep_1
      ols            1    .08434032    .08434032
      ols            2    1.431e-16    1.431e-16
  lassocv            3    .27260138    .27260138
  ridgecv            4    3.674e-17    3.674e-17
  lassocv            5    6.607e-17    6.607e-17
  ridgecv            6    .00504663    .00504663
       rf            7    .41378263    .41378263
       rf            8    1.032e-16    1.032e-16
       rf            9    1.033e-16    1.033e-16
gradboost           10     .0204351     .0204351
gradboost           11    .18667786    .18667786
     nnet           12    2.259e-16    2.259e-16
     nnet           13    .01711607    .01711607

      +--------------------------------+
      | D1_pys~1   D1_pys~2   D1_pys~3 |
      |--------------------------------|
   1. |        1   .0843403   .0843403 |
   2. |        2   1.43e-16   1.43e-16 |
   3. |        3   .2726014   .2726014 |
   4. |        4   3.67e-17   3.67e-17 |
      +--------------------------------+
(note: file out_53356/D1_pystacked_w_mn_nnls1_regular.dta not found)
file out_53356/D1_pystacked_w_mn_nnls1_regular.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: nnls1
               learner  mean_weight        rep_1
      ols            1    .17648703    .17648703
      ols            2            0            0
  lassocv            3    .10490358    .10490358
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7     .4363173     .4363173
       rf            8    1.038e-16    1.038e-16
       rf            9            0            0
gradboost           10    6.442e-17    6.442e-17
gradboost           11    .27640158    .27640158
     nnet           12    1.123e-16    1.123e-16
     nnet           13    .00589051    .00589051

short-stacked weights across resamples for lnearn
final stacking estimator: nnls1
               learner  mean_weight        rep_1
      ols            1            0            0
      ols            2            0            0
  lassocv            3    2.043e-16    2.043e-16
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6    .43234911    .43234911
       rf            7    .34214901    .34214901
       rf            8            0            0
       rf            9    1.427e-16    1.427e-16
gradboost           10    8.793e-18    8.793e-18
gradboost           11    .22550188    .22550188
     nnet           12            0            0
     nnet           13            0            0

Y_lnearn_ss[13,3]
               learner  mean_weight        rep_1
      ols            1            0            0
      ols            2            0            0
  lassocv            3    2.043e-16    2.043e-16
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6    .43234911    .43234911
       rf            7    .34214901    .34214901
       rf            8            0            0
       rf            9    1.427e-16    1.427e-16
gradboost           10    8.793e-18    8.793e-18
gradboost           11    .22550188    .22550188
     nnet           12            0            0
     nnet           13            0            0

      +--------------------------------------------+
      | Y_lnea~_1   Y_lne~s1   Y_lnea~2   Y_lnea~3 |
      |--------------------------------------------|
   1. | 2.6384626          1          0          0 |
   2. | 3.1411878          2          0          0 |
   3. | 2.7940887          3   2.04e-16   2.04e-16 |
   4. | 2.5096968          4          0          0 |
      +--------------------------------------------+
(note: file out_53356/Y_lnearn_ss_nnls1_short.dta not found)
file out_53356/Y_lnearn_ss_nnls1_short.dta saved

D_gender_r_ss[13,3]
               learner  mean_weight        rep_1
      ols            1    .17648703    .17648703
      ols            2            0            0
  lassocv            3    .10490358    .10490358
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7     .4363173     .4363173
       rf            8    1.038e-16    1.038e-16
       rf            9            0            0
gradboost           10    6.442e-17    6.442e-17
gradboost           11    .27640158    .27640158
     nnet           12    1.123e-16    1.123e-16
     nnet           13    .00589051    .00589051

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .72447381          1    .176487    .176487 |
   2. | .45163045          2          0          0 |
   3. | .11226375          3   .1049036   .1049036 |
   4. | .23528184          4          0          0 |
      +--------------------------------------------+
(note: file out_53356/D_gender_r_ss_nnls1_short.dta not found)
file out_53356/D_gender_r_ss_nnls1_short.dta saved

Y_lnearn_ps[13,3]
               learner  mean_weight        rep_1
      ols            1    .01366338    .01366338
      ols            2    2.651e-15    2.651e-15
  lassocv            3    .12042952    .12042952
  ridgecv            4     .1526048     .1526048
  lassocv            5    7.993e-16    7.993e-16
  ridgecv            6     .0778665     .0778665
       rf            7    .40026506    .40026506
       rf            8    3.199e-15    3.199e-15
       rf            9    3.963e-15    3.963e-15
gradboost           10    .07996828    .07996828
gradboost           11    .12960282    .12960282
     nnet           12    3.122e-15    3.122e-15
     nnet           13    .02559965    .02559965

      +--------------------------------------------+
      | Y_lnea~_1   Y_lne~s1   Y_lnea~2   Y_lnea~3 |
      |--------------------------------------------|
   1. | 2.6081655          1   .0136634   .0136634 |
   2. | 3.1256865          2   2.65e-15   2.65e-15 |
   3. | 2.8070776          3   .1204295   .1204295 |
   4. | 2.5236722          4   .1526048   .1526048 |
      +--------------------------------------------+
(note: file out_53356/Y_lnearn_ps_nnls1_pooled.dta not found)
file out_53356/Y_lnearn_ps_nnls1_pooled.dta saved

D_gender_r_ps[13,3]
               learner  mean_weight        rep_1
      ols            1    .03483112    .03483112
      ols            2            0            0
  lassocv            3    .33831514    .33831514
  ridgecv            4    4.187e-16    4.187e-16
  lassocv            5    8.814e-16    8.814e-16
  ridgecv            6    1.784e-16    1.784e-16
       rf            7      .408044      .408044
       rf            8    8.036e-16    8.036e-16
       rf            9    9.669e-16    9.669e-16
gradboost           10    2.534e-16    2.534e-16
gradboost           11    .20838778    .20838778
     nnet           12    2.392e-15    2.392e-15
     nnet           13    .01042195    .01042195

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .72137205          1   .0348311   .0348311 |
   2. | .44684717          2          0          0 |
   3. | .13131431          3   .3383151   .3383151 |
   4. | .24916894          4   4.19e-16   4.19e-16 |
      +--------------------------------------------+
(note: file out_53356/D_gender_r_ps_nnls1_pooled.dta not found)
file out_53356/D_gender_r_ps_nnls1_pooled.dta saved


Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  st  1  Y1_pystacked  D1_pystacked    -0.099    (0.017)
  ss  1  [shortstack]          [ss]    -0.097    (0.016)
  ps  1   [poolstack]          [ps]    -0.104    (0.017)

Shortstack DDML model
y-E[y|X]  = y-Y_lnearn_ss_1                        Number of obs   =      4836
D-E[D|X]  = D-D_gender_r_ss_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0969697   .0164233    -5.90   0.000    -.1291587   -.0647806
       _cons |  -.0008437   .0063718    -0.13   0.895    -.0133322    .0116447
------------------------------------------------------------------------------
Stacking final estimator: singlebest



Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  st  1  Y1_pystacked  D1_pystacked    -0.099    (0.017)
  ss  1  [shortstack]          [ss]    -0.097    (0.016)
  ps  1   [poolstack]          [ps]    -0.104    (0.017)

Stacking DDML model
y-E[y|X]  = y-Y1_pystacked_1                       Number of obs   =      4836
D-E[D|X]  = D-D1_pystacked_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0985543   .0167505    -5.88   0.000    -.1313847   -.0657238
       _cons |  -.0007915   .0064375    -0.12   0.902    -.0134088    .0118258
------------------------------------------------------------------------------
Stacking final estimator: singlebest

file out_53356/results.dta saved


Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  ss  1  Y1_pystacked  D1_pystacked    -0.097    (0.016)
  ss  1  [shortstack]          [ss]    -0.097    (0.016)
  ps  1   [poolstack]          [ps]    -0.104    (0.017)

Shortstack DDML model
y-E[y|X]  = y-Y_lnearn_ss_1                        Number of obs   =      4836
D-E[D|X]  = D-D_gender_r_ss_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0969697   .0164233    -5.90   0.000    -.1291587   -.0647806
       _cons |  -.0008437   .0063718    -0.13   0.895    -.0133322    .0116447
------------------------------------------------------------------------------
Stacking final estimator: singlebest

file out_53356/results.dta saved


Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  ps  1  Y1_pystacked  D1_pystacked    -0.104    (0.017)
  ss  1  [shortstack]          [ss]    -0.097    (0.016)
  ps  1   [poolstack]          [ps]    -0.104    (0.017)

Poolstack DDML model
y-E[y|X]  = y-Y_lnearn_ps_1                        Number of obs   =      4836
D-E[D|X]  = D-D_gender_r_ps_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1035505    .016793    -6.17   0.000    -.1364641   -.0706368
       _cons |  -.0027862   .0063857    -0.44   0.663    -.0153021    .0097296
------------------------------------------------------------------------------
Stacking final estimator: singlebest

file out_53356/results.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: singlebest
               learner  mean_weight        rep_1
      ols            1            0            0
      ols            2            0            0
  lassocv            3           .5           .5
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7           .4           .4
       rf            8            0            0
       rf            9            0            0
gradboost           10           .1           .1
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: singlebest
               learner  mean_weight        rep_1
      ols            1            0            0
      ols            2            0            0
  lassocv            3           .1           .1
  ridgecv            4            0            0
  lassocv            5           .4           .4
  ridgecv            6            0            0
       rf            7           .5           .5
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: singlebest
               learner  mean_weight        rep_1
      ols            1            0            0
      ols            2            0            0
  lassocv            3           .5           .5
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7           .4           .4
       rf            8            0            0
       rf            9            0            0
gradboost           10           .1           .1
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: singlebest
               learner  mean_weight        rep_1
      ols            1            0            0
      ols            2            0            0
  lassocv            3           .1           .1
  ridgecv            4            0            0
  lassocv            5           .4           .4
  ridgecv            6            0            0
       rf            7           .5           .5
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

Y1_pystacked_w_mn[13,3]
               learner  mean_weight        rep_1
      ols            1            0            0
      ols            2            0            0
  lassocv            3           .1           .1
  ridgecv            4            0            0
  lassocv            5           .4           .4
  ridgecv            6            0            0
       rf            7           .5           .5
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

      +--------------------------------+
      | Y1_pys~1   Y1_pys~2   Y1_pys~3 |
      |--------------------------------|
   1. |        1          0          0 |
   2. |        2          0          0 |
   3. |        3         .1         .1 |
   4. |        4          0          0 |
      +--------------------------------+
(note: file out_53356/Y1_pystacked_w_mn_singlebest_regular.dta not found)
file out_53356/Y1_pystacked_w_mn_singlebest_regular.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: singlebest
               learner  mean_weight        rep_1
      ols            1            0            0
      ols            2            0            0
  lassocv            3           .5           .5
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7           .4           .4
       rf            8            0            0
       rf            9            0            0
gradboost           10           .1           .1
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: singlebest
               learner  mean_weight        rep_1
      ols            1            0            0
      ols            2            0            0
  lassocv            3           .1           .1
  ridgecv            4            0            0
  lassocv            5           .4           .4
  ridgecv            6            0            0
       rf            7           .5           .5
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

D1_pystacked_w_mn[13,3]
               learner  mean_weight        rep_1
      ols            1            0            0
      ols            2            0            0
  lassocv            3           .5           .5
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7           .4           .4
       rf            8            0            0
       rf            9            0            0
gradboost           10           .1           .1
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

      +--------------------------------+
      | D1_pys~1   D1_pys~2   D1_pys~3 |
      |--------------------------------|
   1. |        1          0          0 |
   2. |        2          0          0 |
   3. |        3         .5         .5 |
   4. |        4          0          0 |
      +--------------------------------+
(note: file out_53356/D1_pystacked_w_mn_singlebest_regular.dta not found)
file out_53356/D1_pystacked_w_mn_singlebest_regular.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: singlebest
               learner  mean_weight        rep_1
      ols            1            0            0
      ols            2            0            0
  lassocv            3            0            0
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            1            1
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

short-stacked weights across resamples for lnearn
final stacking estimator: singlebest
               learner  mean_weight        rep_1
      ols            1            0            0
      ols            2            0            0
  lassocv            3            0            0
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            1            1
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

Y_lnearn_ss[13,3]
               learner  mean_weight        rep_1
      ols            1            0            0
      ols            2            0            0
  lassocv            3            0            0
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            1            1
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

      +--------------------------------------------+
      | Y_lnea~_1   Y_lne~s1   Y_lnea~2   Y_lnea~3 |
      |--------------------------------------------|
   1. | 2.6180933          1          0          0 |
   2. | 3.1352291          2          0          0 |
   3. | 2.8108058          3          0          0 |
   4. | 2.4775155          4          0          0 |
      +--------------------------------------------+
(note: file out_53356/Y_lnearn_ss_singlebest_short.dta not found)
file out_53356/Y_lnearn_ss_singlebest_short.dta saved

D_gender_r_ss[13,3]
               learner  mean_weight        rep_1
      ols            1            0            0
      ols            2            0            0
  lassocv            3            0            0
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            1            1
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .77999997          1          0          0 |
   2. | .52399999          2          0          0 |
   3. |      .154          3          0          0 |
   4. |      .124          4          0          0 |
      +--------------------------------------------+
(note: file out_53356/D_gender_r_ss_singlebest_short.dta not found)
file out_53356/D_gender_r_ss_singlebest_short.dta saved

Y_lnearn_ps[13,3]
               learner  mean_weight        rep_1
      ols            1            0            0
      ols            2            0            0
  lassocv            3            0            0
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            1            1
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

      +--------------------------------------------+
      | Y_lnea~_1   Y_lne~s1   Y_lnea~2   Y_lnea~3 |
      |--------------------------------------------|
   1. | 2.5748384          1          0          0 |
   2. | 3.0597723          2          0          0 |
   3. | 2.8202629          3          0          0 |
   4. | 2.5507748          4          0          0 |
      +--------------------------------------------+
(note: file out_53356/Y_lnearn_ps_singlebest_pooled.dta not found)
file out_53356/Y_lnearn_ps_singlebest_pooled.dta saved

D_gender_r_ps[13,3]
               learner  mean_weight        rep_1
      ols            1            0            0
      ols            2            0            0
  lassocv            3            1            1
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .67213875          1          0          0 |
   2. | .36453238          2          0          0 |
   3. | .17489405          3          1          1 |
   4. | .37791327          4          0          0 |
      +--------------------------------------------+
(note: file out_53356/D_gender_r_ps_singlebest_pooled.dta not found)
file out_53356/D_gender_r_ps_singlebest_pooled.dta saved


Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  st  1  Y1_pystacked  D1_pystacked    -0.037    (0.036)
  ss  1  [shortstack]          [ss]    -0.101    (0.017)
  ps  1   [poolstack]          [ps]    -0.102    (0.017)

Shortstack DDML model
y-E[y|X]  = y-Y_lnearn_ss_1                        Number of obs   =      4836
D-E[D|X]  = D-D_gender_r_ss_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1012219   .0166558    -6.08   0.000    -.1338668   -.0685771
       _cons |  -.0158829   .0073167    -2.17   0.030    -.0302234   -.0015425
------------------------------------------------------------------------------
Stacking final estimator: ols



Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  st  1  Y1_pystacked  D1_pystacked    -0.037    (0.036)
  ss  1  [shortstack]          [ss]    -0.101    (0.017)
  ps  1   [poolstack]          [ps]    -0.102    (0.017)

Stacking DDML model
y-E[y|X]  = y-Y1_pystacked_1                       Number of obs   =      4836
D-E[D|X]  = D-D1_pystacked_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |   -.037238   .0355278    -1.05   0.295    -.1068713    .0323953
       _cons |    .813829   .0273814    29.72   0.000     .7601625    .8674956
------------------------------------------------------------------------------
Stacking final estimator: ols

(note: variable final was str3, now str10 to accommodate using data's values)
file out_53356/results.dta saved


Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  ss  1  Y1_pystacked  D1_pystacked    -0.101    (0.017)
  ss  1  [shortstack]          [ss]    -0.101    (0.017)
  ps  1   [poolstack]          [ps]    -0.102    (0.017)

Shortstack DDML model
y-E[y|X]  = y-Y_lnearn_ss_1                        Number of obs   =      4836
D-E[D|X]  = D-D_gender_r_ss_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1012219   .0166558    -6.08   0.000    -.1338668   -.0685771
       _cons |  -.0158829   .0073167    -2.17   0.030    -.0302234   -.0015425
------------------------------------------------------------------------------
Stacking final estimator: ols

(note: variable final was str3, now str10 to accommodate using data's values)
file out_53356/results.dta saved


Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  ps  1  Y1_pystacked  D1_pystacked    -0.102    (0.017)
  ss  1  [shortstack]          [ss]    -0.101    (0.017)
  ps  1   [poolstack]          [ps]    -0.102    (0.017)

Poolstack DDML model
y-E[y|X]  = y-Y_lnearn_ps_1                        Number of obs   =      4836
D-E[D|X]  = D-D_gender_r_ps_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1015416   .0167849    -6.05   0.000    -.1344394   -.0686438
       _cons |  -.0591748   .0066143    -8.95   0.000    -.0721386    -.046211
------------------------------------------------------------------------------
Stacking final estimator: ols

(note: variable final was str3, now str10 to accommodate using data's values)
file out_53356/results.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: ols
               learner  mean_weight        rep_1
      ols            1    .06347892    .06347892
      ols            2    .18069476    .18069476
  lassocv            3    .42719025    .42719025
  ridgecv            4    .06978304    .06978304
  lassocv            5   -.29282898   -.29282898
  ridgecv            6    .06908814    .06908814
       rf            7    .51297901    .51297901
       rf            8    .60294822    .60294822
       rf            9    -.7238818    -.7238818
gradboost           10    .11299549    .11299549
gradboost           11    .08676177    .08676177
     nnet           12   -.60157432   -.60157432
     nnet           13     .0061265     .0061265

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: ols
               learner  mean_weight        rep_1
      ols            1   -.00790264   -.00790264
      ols            2   -.00428002   -.00428002
  lassocv            3   -.20381215   -.20381215
  ridgecv            4    .24520311    .24520311
  lassocv            5    .18474843    .18474843
  ridgecv            6    .25285967    .25285967
       rf            7    .51103892    .51103892
       rf            8    .30410662    .30410662
       rf            9   -.50683296   -.50683296
gradboost           10    .17843425    .17843425
gradboost           11    .02895504    .02895504
     nnet           12   -.28332583   -.28332583
     nnet           13    .00950443    .00950443

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: ols
               learner  mean_weight        rep_1
      ols            1    .06347892    .06347892
      ols            2    .18069476    .18069476
  lassocv            3    .42719025    .42719025
  ridgecv            4    .06978304    .06978304
  lassocv            5   -.29282898   -.29282898
  ridgecv            6    .06908814    .06908814
       rf            7    .51297901    .51297901
       rf            8    .60294822    .60294822
       rf            9    -.7238818    -.7238818
gradboost           10    .11299549    .11299549
gradboost           11    .08676177    .08676177
     nnet           12   -.60157432   -.60157432
     nnet           13     .0061265     .0061265

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: ols
               learner  mean_weight        rep_1
      ols            1   -.00790264   -.00790264
      ols            2   -.00428002   -.00428002
  lassocv            3   -.20381215   -.20381215
  ridgecv            4    .24520311    .24520311
  lassocv            5    .18474843    .18474843
  ridgecv            6    .25285967    .25285967
       rf            7    .51103892    .51103892
       rf            8    .30410662    .30410662
       rf            9   -.50683296   -.50683296
gradboost           10    .17843425    .17843425
gradboost           11    .02895504    .02895504
     nnet           12   -.28332583   -.28332583
     nnet           13    .00950443    .00950443

Y1_pystacked_w_mn[13,3]
               learner  mean_weight        rep_1
      ols            1   -.00790264   -.00790264
      ols            2   -.00428002   -.00428002
  lassocv            3   -.20381215   -.20381215
  ridgecv            4    .24520311    .24520311
  lassocv            5    .18474843    .18474843
  ridgecv            6    .25285967    .25285967
       rf            7    .51103892    .51103892
       rf            8    .30410662    .30410662
       rf            9   -.50683296   -.50683296
gradboost           10    .17843425    .17843425
gradboost           11    .02895504    .02895504
     nnet           12   -.28332583   -.28332583
     nnet           13    .00950443    .00950443

      +----------------------------------+
      | Y1_pys~1   Y1_pyst~2   Y1_pyst~3 |
      |----------------------------------|
   1. |        1   -.0079026   -.0079026 |
   2. |        2     -.00428     -.00428 |
   3. |        3   -.2038122   -.2038122 |
   4. |        4    .2452031    .2452031 |
      +----------------------------------+
(note: file out_53356/Y1_pystacked_w_mn_ols_regular.dta not found)
file out_53356/Y1_pystacked_w_mn_ols_regular.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: ols
               learner  mean_weight        rep_1
      ols            1    .06347892    .06347892
      ols            2    .18069476    .18069476
  lassocv            3    .42719025    .42719025
  ridgecv            4    .06978304    .06978304
  lassocv            5   -.29282898   -.29282898
  ridgecv            6    .06908814    .06908814
       rf            7    .51297901    .51297901
       rf            8    .60294822    .60294822
       rf            9    -.7238818    -.7238818
gradboost           10    .11299549    .11299549
gradboost           11    .08676177    .08676177
     nnet           12   -.60157432   -.60157432
     nnet           13     .0061265     .0061265

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: ols
               learner  mean_weight        rep_1
      ols            1   -.00790264   -.00790264
      ols            2   -.00428002   -.00428002
  lassocv            3   -.20381215   -.20381215
  ridgecv            4    .24520311    .24520311
  lassocv            5    .18474843    .18474843
  ridgecv            6    .25285967    .25285967
       rf            7    .51103892    .51103892
       rf            8    .30410662    .30410662
       rf            9   -.50683296   -.50683296
gradboost           10    .17843425    .17843425
gradboost           11    .02895504    .02895504
     nnet           12   -.28332583   -.28332583
     nnet           13    .00950443    .00950443

D1_pystacked_w_mn[13,3]
               learner  mean_weight        rep_1
      ols            1    .06347892    .06347892
      ols            2    .18069476    .18069476
  lassocv            3    .42719025    .42719025
  ridgecv            4    .06978304    .06978304
  lassocv            5   -.29282898   -.29282898
  ridgecv            6    .06908814    .06908814
       rf            7    .51297901    .51297901
       rf            8    .60294822    .60294822
       rf            9    -.7238818    -.7238818
gradboost           10    .11299549    .11299549
gradboost           11    .08676177    .08676177
     nnet           12   -.60157432   -.60157432
     nnet           13     .0061265     .0061265

      +--------------------------------+
      | D1_pys~1   D1_pys~2   D1_pys~3 |
      |--------------------------------|
   1. |        1   .0634789   .0634789 |
   2. |        2   .1806948   .1806948 |
   3. |        3   .4271902   .4271902 |
   4. |        4    .069783    .069783 |
      +--------------------------------+
(note: file out_53356/D1_pystacked_w_mn_ols_regular.dta not found)
file out_53356/D1_pystacked_w_mn_ols_regular.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: ols
               learner  mean_weight        rep_1
      ols            1    .15273753    .15273753
      ols            2    .15134157    .15134157
  lassocv            3    .39284901    .39284901
  ridgecv            4    .19184242    .19184242
  lassocv            5    -.3122115    -.3122115
  ridgecv            6   -.15639879   -.15639879
       rf            7      .540623      .540623
       rf            8    .53519544    .53519544
       rf            9   -.67389245   -.67389245
gradboost           10    .07781526    .07781526
gradboost           11    .19864363    .19864363
     nnet           12    .41025849    .41025849
     nnet           13    .00409085    .00409085

short-stacked weights across resamples for lnearn
final stacking estimator: ols
               learner  mean_weight        rep_1
      ols            1   -.02259494   -.02259494
      ols            2    .01409273    .01409273
  lassocv            3   -.17726105   -.17726105
  ridgecv            4    .07648258    .07648258
  lassocv            5    .02539065    .02539065
  ridgecv            6    .54268091    .54268091
       rf            7    .40279666    .40279666
       rf            8    .85924296    .85924296
       rf            9   -.95682125   -.95682125
gradboost           10    .02167265    .02167265
gradboost           11    .18606989    .18606989
     nnet           12     .0375371     .0375371
     nnet           13   -.01539147   -.01539147

Y_lnearn_ss[13,3]
               learner  mean_weight        rep_1
      ols            1   -.02259494   -.02259494
      ols            2    .01409273    .01409273
  lassocv            3   -.17726105   -.17726105
  ridgecv            4    .07648258    .07648258
  lassocv            5    .02539065    .02539065
  ridgecv            6    .54268091    .54268091
       rf            7    .40279666    .40279666
       rf            8    .85924296    .85924296
       rf            9   -.95682125   -.95682125
gradboost           10    .02167265    .02167265
gradboost           11    .18606989    .18606989
     nnet           12     .0375371     .0375371
     nnet           13   -.01539147   -.01539147

      +----------------------------------------------+
      | Y_lnea~_1   Y_lne~s1   Y_lnear~2   Y_lnear~3 |
      |----------------------------------------------|
   1. |  2.604334          1   -.0225949   -.0225949 |
   2. | 3.1231112          2    .0140927    .0140927 |
   3. | 2.7817585          3   -.1772611   -.1772611 |
   4. | 2.4861528          4    .0764826    .0764826 |
      +----------------------------------------------+
(note: file out_53356/Y_lnearn_ss_ols_short.dta not found)
file out_53356/Y_lnearn_ss_ols_short.dta saved

D_gender_r_ss[13,3]
               learner  mean_weight        rep_1
      ols            1    .15273753    .15273753
      ols            2    .15134157    .15134157
  lassocv            3    .39284901    .39284901
  ridgecv            4    .19184242    .19184242
  lassocv            5    -.3122115    -.3122115
  ridgecv            6   -.15639879   -.15639879
       rf            7      .540623      .540623
       rf            8    .53519544    .53519544
       rf            9   -.67389245   -.67389245
gradboost           10    .07781526    .07781526
gradboost           11    .19864363    .19864363
     nnet           12    .41025849    .41025849
     nnet           13    .00409085    .00409085

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | 1.0351679          1   .1527375   .1527375 |
   2. | .73033211          2   .1513416   .1513416 |
   3. |  .3670879          3    .392849    .392849 |
   4. | .43251659          4   .1918424   .1918424 |
      +--------------------------------------------+
(note: file out_53356/D_gender_r_ss_ols_short.dta not found)
file out_53356/D_gender_r_ss_ols_short.dta saved

Y_lnearn_ps[13,3]
               learner  mean_weight        rep_1
      ols            1    .00482984    .00482984
      ols            2   -.02065437   -.02065437
  lassocv            3   -.00853601   -.00853601
  ridgecv            4    .43937662    .43937662
  lassocv            5   -.08167312   -.08167312
  ridgecv            6    .10643769    .10643769
       rf            7    .53217747    .53217747
       rf            8    .33074279    .33074279
       rf            9   -.53250857   -.53250857
gradboost           10    .19528306    .19528306
gradboost           11    .03630192    .03630192
     nnet           12    .00652708    .00652708
     nnet           13    .01505901    .01505901

      +----------------------------------------------+
      | Y_lnea~_1   Y_lne~s1   Y_lnear~2   Y_lnear~3 |
      |----------------------------------------------|
   1. | 2.6353048          1    .0048298    .0048298 |
   2. | 3.1796702          2   -.0206544   -.0206544 |
   3. | 2.8800569          3    -.008536    -.008536 |
   4. | 2.5673103          4    .4393766    .4393766 |
      +----------------------------------------------+
(note: file out_53356/Y_lnearn_ps_ols_pooled.dta not found)
file out_53356/Y_lnearn_ps_ols_pooled.dta saved

D_gender_r_ps[13,3]
               learner  mean_weight        rep_1
      ols            1    .02083341    .02083341
      ols            2    .18469731    .18469731
  lassocv            3    .42370434    .42370434
  ridgecv            4    .05957704    .05957704
  lassocv            5    -.2691196    -.2691196
  ridgecv            6    .10319834    .10319834
       rf            7    .51692717    .51692717
       rf            8    .59587442    .59587442
       rf            9   -.72714491   -.72714491
gradboost           10    .10367481    .10367481
gradboost           11    .09798532    .09798532
     nnet           12     -.245162     -.245162
     nnet           13      .006037      .006037

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .66542341          1   .0208334   .0208334 |
   2. | .34111787          2   .1846973   .1846973 |
   3. | .01830387          3   .4237043   .4237043 |
   4. | .07410513          4    .059577    .059577 |
      +--------------------------------------------+
(note: file out_53356/D_gender_r_ps_ols_pooled.dta not found)
file out_53356/D_gender_r_ps_ols_pooled.dta saved


Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  st  1  Y1_pystacked  D1_pystacked    -0.107    (0.017)
  ss  1  [shortstack]          [ss]    -0.107    (0.017)
  ps  1   [poolstack]          [ps]    -0.107    (0.017)

Shortstack DDML model
y-E[y|X]  = y-Y_lnearn_ss_1                        Number of obs   =      4836
D-E[D|X]  = D-D_gender_r_ss_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1070988   .0171071    -6.26   0.000    -.1406281   -.0735696
       _cons |  -.0012508   .0063564    -0.20   0.844    -.0137091    .0112074
------------------------------------------------------------------------------
Stacking final estimator: avg



Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  st  1  Y1_pystacked  D1_pystacked    -0.107    (0.017)
  ss  1  [shortstack]          [ss]    -0.107    (0.017)
  ps  1   [poolstack]          [ps]    -0.107    (0.017)

Stacking DDML model
y-E[y|X]  = y-Y1_pystacked_1                       Number of obs   =      4836
D-E[D|X]  = D-D1_pystacked_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1070988   .0171071    -6.26   0.000    -.1406281   -.0735696
       _cons |  -.0012508   .0063564    -0.20   0.844    -.0137091    .0112074
------------------------------------------------------------------------------
Stacking final estimator: avg

(note: variable final was str3, now str10 to accommodate using data's values)
file out_53356/results.dta saved


Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  ss  1  Y1_pystacked  D1_pystacked    -0.107    (0.017)
  ss  1  [shortstack]          [ss]    -0.107    (0.017)
  ps  1   [poolstack]          [ps]    -0.107    (0.017)

Shortstack DDML model
y-E[y|X]  = y-Y_lnearn_ss_1                        Number of obs   =      4836
D-E[D|X]  = D-D_gender_r_ss_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1070988   .0171071    -6.26   0.000    -.1406281   -.0735696
       _cons |  -.0012508   .0063564    -0.20   0.844    -.0137091    .0112074
------------------------------------------------------------------------------
Stacking final estimator: avg

(note: variable final was str3, now str10 to accommodate using data's values)
file out_53356/results.dta saved


Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  ps  1  Y1_pystacked  D1_pystacked    -0.107    (0.017)
  ss  1  [shortstack]          [ss]    -0.107    (0.017)
  ps  1   [poolstack]          [ps]    -0.107    (0.017)

Poolstack DDML model
y-E[y|X]  = y-Y_lnearn_ps_1                        Number of obs   =      4836
D-E[D|X]  = D-D_gender_r_ps_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1070988   .0171071    -6.26   0.000    -.1406281   -.0735696
       _cons |  -.0012508   .0063564    -0.20   0.844    -.0137091    .0112074
------------------------------------------------------------------------------
Stacking final estimator: avg

(note: variable final was str3, now str10 to accommodate using data's values)
file out_53356/results.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: avg
               learner  mean_weight        rep_1
      ols            1    .07692308    .07692308
      ols            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: avg
               learner  mean_weight        rep_1
      ols            1    .07692308    .07692308
      ols            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: avg
               learner  mean_weight        rep_1
      ols            1    .07692308    .07692308
      ols            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: avg
               learner  mean_weight        rep_1
      ols            1    .07692308    .07692308
      ols            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

Y1_pystacked_w_mn[13,3]
               learner  mean_weight        rep_1
      ols            1    .07692308    .07692308
      ols            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

      +--------------------------------+
      | Y1_pys~1   Y1_pys~2   Y1_pys~3 |
      |--------------------------------|
   1. |        1   .0769231   .0769231 |
   2. |        2   .0769231   .0769231 |
   3. |        3   .0769231   .0769231 |
   4. |        4   .0769231   .0769231 |
      +--------------------------------+
(note: file out_53356/Y1_pystacked_w_mn_avg_regular.dta not found)
file out_53356/Y1_pystacked_w_mn_avg_regular.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: avg
               learner  mean_weight        rep_1
      ols            1    .07692308    .07692308
      ols            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: avg
               learner  mean_weight        rep_1
      ols            1    .07692308    .07692308
      ols            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

D1_pystacked_w_mn[13,3]
               learner  mean_weight        rep_1
      ols            1    .07692308    .07692308
      ols            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

      +--------------------------------+
      | D1_pys~1   D1_pys~2   D1_pys~3 |
      |--------------------------------|
   1. |        1   .0769231   .0769231 |
   2. |        2   .0769231   .0769231 |
   3. |        3   .0769231   .0769231 |
   4. |        4   .0769231   .0769231 |
      +--------------------------------+
(note: file out_53356/D1_pystacked_w_mn_avg_regular.dta not found)
file out_53356/D1_pystacked_w_mn_avg_regular.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: avg
               learner  mean_weight        rep_1
      ols            1    .07692308    .07692308
      ols            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

short-stacked weights across resamples for lnearn
final stacking estimator: avg
               learner  mean_weight        rep_1
      ols            1    .07692308    .07692308
      ols            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

Y_lnearn_ss[13,3]
               learner  mean_weight        rep_1
      ols            1    .07692308    .07692308
      ols            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

      +--------------------------------------------+
      | Y_lnea~_1   Y_lne~s1   Y_lnea~2   Y_lnea~3 |
      |--------------------------------------------|
   1. | 2.6417978          1   .0769231   .0769231 |
   2. | 3.1583594          2   .0769231   .0769231 |
   3. |  2.823372          3   .0769231   .0769231 |
   4. | 2.5572811          4   .0769231   .0769231 |
      +--------------------------------------------+
(note: file out_53356/Y_lnearn_ss_avg_short.dta not found)
file out_53356/Y_lnearn_ss_avg_short.dta saved

D_gender_r_ss[13,3]
               learner  mean_weight        rep_1
      ols            1    .07692308    .07692308
      ols            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .69861201          1   .0769231   .0769231 |
   2. | .44039597          2   .0769231   .0769231 |
   3. | .23824529          3   .0769231   .0769231 |
   4. |  .3896817          4   .0769231   .0769231 |
      +--------------------------------------------+
(note: file out_53356/D_gender_r_ss_avg_short.dta not found)
file out_53356/D_gender_r_ss_avg_short.dta saved

Y_lnearn_ps[13,3]
               learner  mean_weight        rep_1
      ols            1    .07692308    .07692308
      ols            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

      +--------------------------------------------+
      | Y_lnea~_1   Y_lne~s1   Y_lnea~2   Y_lnea~3 |
      |--------------------------------------------|
   1. | 2.6417978          1   .0769231   .0769231 |
   2. | 3.1583594          2   .0769231   .0769231 |
   3. |  2.823372          3   .0769231   .0769231 |
   4. | 2.5572811          4   .0769231   .0769231 |
      +--------------------------------------------+
(note: file out_53356/Y_lnearn_ps_avg_pooled.dta not found)
file out_53356/Y_lnearn_ps_avg_pooled.dta saved

D_gender_r_ps[13,3]
               learner  mean_weight        rep_1
      ols            1    .07692308    .07692308
      ols            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .69861201          1   .0769231   .0769231 |
   2. | .44039597          2   .0769231   .0769231 |
   3. | .23824529          3   .0769231   .0769231 |
   4. |  .3896817          4   .0769231   .0769231 |
      +--------------------------------------------+
(note: file out_53356/D_gender_r_ps_avg_pooled.dta not found)
file out_53356/D_gender_r_ps_avg_pooled.dta saved
. 
.         forvalues i = 1(1)$L {
  2.                         ddml estimate, y(Y1_pystacked_L`i'_1) ///
>                                                         d(D1_pystacked_L`i'_1
> ) robust
  3.                         regsave gender_r using `folder'/results.dta, ci //
> /
>                                                 addlabel(model,partial,seed,`
> seed',final,indiv,learner,`i') ///
>                                                 append
  4.         }

y-E[y|X]  = Y1_pystacked_L1_1                      Number of obs   =      4836
D-E[D|X]  = D1_pystacked_L1_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1017919   .0182118    -5.59   0.000    -.1374863   -.0660975
       _cons |  -.0003693   .0067408    -0.05   0.956     -.013581    .0128424
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_53356/results.dta saved

y-E[y|X]  = Y1_pystacked_L2_1                      Number of obs   =      4836
D-E[D|X]  = D1_pystacked_L2_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1189563    .015449    -7.70   0.000    -.1492358   -.0886768
       _cons |   .0000592    .006858     0.01   0.993    -.0133821    .0135006
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_53356/results.dta saved

y-E[y|X]  = Y1_pystacked_L3_1                      Number of obs   =      4836
D-E[D|X]  = D1_pystacked_L3_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0991974   .0166915    -5.94   0.000    -.1319121   -.0664827
       _cons |   .0003776   .0063901     0.06   0.953    -.0121468    .0129019
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_53356/results.dta saved

y-E[y|X]  = Y1_pystacked_L4_1                      Number of obs   =      4836
D-E[D|X]  = D1_pystacked_L4_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0999256   .0167037    -5.98   0.000    -.1326643   -.0671869
       _cons |  -9.59e-06   .0064004    -0.00   0.999    -.0125542     .012535
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_53356/results.dta saved

y-E[y|X]  = Y1_pystacked_L5_1                      Number of obs   =      4836
D-E[D|X]  = D1_pystacked_L5_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0992012   .0166681    -5.95   0.000    -.1318701   -.0665322
       _cons |  -.0011165   .0063926    -0.17   0.861    -.0136458    .0114128
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_53356/results.dta saved

y-E[y|X]  = Y1_pystacked_L6_1                      Number of obs   =      4836
D-E[D|X]  = D1_pystacked_L6_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1022283   .0167901    -6.09   0.000    -.1351364   -.0693203
       _cons |  -.0009633   .0063648    -0.15   0.880    -.0134381    .0115116
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_53356/results.dta saved

y-E[y|X]  = Y1_pystacked_L7_1                      Number of obs   =      4836
D-E[D|X]  = D1_pystacked_L7_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0992314   .0165426    -6.00   0.000    -.1316543   -.0668086
       _cons |  -.0025417   .0063945    -0.40   0.691    -.0150746    .0099912
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_53356/results.dta saved

y-E[y|X]  = Y1_pystacked_L8_1                      Number of obs   =      4836
D-E[D|X]  = D1_pystacked_L8_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |   -.110582     .01692    -6.54   0.000    -.1437446   -.0774193
       _cons |   .0004002   .0066234     0.06   0.952    -.0125814    .0133817
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_53356/results.dta saved

y-E[y|X]  = Y1_pystacked_L9_1                      Number of obs   =      4836
D-E[D|X]  = D1_pystacked_L9_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |   -.113136   .0167084    -6.77   0.000     -.145884   -.0803881
       _cons |   .0003189   .0067505     0.05   0.962     -.012912    .0135497
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_53356/results.dta saved

y-E[y|X]  = Y1_pystacked_L10_1                     Number of obs   =      4836
D-E[D|X]  = D1_pystacked_L10_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0907458   .0167537    -5.42   0.000    -.1235824   -.0579092
       _cons |  -.0017385   .0064504    -0.27   0.788    -.0143811    .0109041
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_53356/results.dta saved

y-E[y|X]  = Y1_pystacked_L11_1                     Number of obs   =      4836
D-E[D|X]  = D1_pystacked_L11_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0886288   .0166738    -5.32   0.000    -.1213089   -.0559487
       _cons |  -.0054714    .006517    -0.84   0.401    -.0182445    .0073017
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_53356/results.dta saved

y-E[y|X]  = Y1_pystacked_L12_1                     Number of obs   =      4836
D-E[D|X]  = D1_pystacked_L12_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1091339   .0154926    -7.04   0.000    -.1394987    -.078769
       _cons |   .0001844   .0074905     0.02   0.980    -.0144967    .0148655
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_53356/results.dta saved

y-E[y|X]  = Y1_pystacked_L13_1                     Number of obs   =      4836
D-E[D|X]  = D1_pystacked_L13_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0367812   .0280336    -1.31   0.190     -.091726    .0181637
       _cons |  -.0063516   .0079175    -0.80   0.422    -.0218696    .0091664
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_53356/results.dta saved
. 
. }

.         
. *****************************************************************************
> *  
. *** interactive: estimation                                                  
>                                       ***
. *****************************************************************************
> *
.         
. if (`estimator'==2) {   
. 
.         ddml init interactive, kfolds($K) reps($R)
.         ddml E[Y|X,D]: pystacked lnearn $X_expanded $pystring_reg
.         ddml E[D|X]: pystacked gender_r $X_expanded $pystring_class
.         ddml crossfit, shortstack poolstack
.         ddml estimate, robust atet
. 
.         cap drop mse_*
.         foreach var of varlist Y1_pystacked0* {
  2.                  cap drop sqerr_`var'
  3.                  gen double sqerr_`var'=(lnearn-`var')^2 if gender_r==0
  4.                  sum sqerr_`var' if gender_r==0, meanonly
  5.                  gen double mse_`var'=r(mean) if _n ==1 
  6.         }
.         foreach var of varlist Y1_pystacked1* {
  2.                  cap drop sqerr_`var'
  3.                  gen double sqerr_`var'=(lnearn-`var')^2 if gender_r==1
  4.                  sum sqerr_`var' if gender_r==1, meanonly
  5.                  gen double mse_`var'=r(mean) if _n ==1 
  6.         }
.         foreach var of varlist D1_* {
  2.                  cap drop sqerr_`var'
  3.                  gen double sqerr_`var'=(gender_r-`var')^2
  4.                  sum sqerr_`var', meanonly
  5.                  gen double mse_`var'=r(mean) if _n ==1 
  6.         }
.         preserve
.                 keep mse_*
.                 keep if _n==1
.                 save `folder'/inter_mse, replace
.         restore
.         cap drop mse_*
.         
.         local mat gender_r_mse
.                         ddml extract, show(mse)
.                         mat `mat' = r(`mat')
.                         mat list `mat'
.                                 preserve
.                                 svmat `mat'
.                                 keep `mat'*
.                                 keep if _n<=$L
.                                 gen stack_type = "conventional" if _n==1
.                                 replace stack_type = "pooled" if _n==2
.                                 replace stack_type = "short" if _n==3
.                                 gen model = "interactive"
.                                 list if _n<=$L
.                                 save `folder'/`mat'_inter_gender_mse, replace
.                                 restore 
.                                 
.         local mat lnearn_mse
.                         ddml extract, show(mse)
.                         mat `mat' = r(`mat')
.                         mat list `mat'
.                                 preserve
.                                 svmat `mat'
.                                 keep `mat'*
.                                 keep if _n<=(2*$L)
.                                 gen stack_type = "conventional" if _n<=2
.                                 replace stack_type = "pooled" if _n>=3 & _n<=
> 4
.                                 replace stack_type = "short" if _n>4
.                                 gen model = "interactive"
.                                 list if _n<=(2*$L)
.                                 save `folder'/`mat'_inter_lnearn_mse, replace
.                                 restore 
.         
.         foreach final in nnls1 singlebest ols avg {
  2. 
.                 ddml estimate, robust finalest(`final') atet
  3.         
.                         // regular stacking results
.                         ddml estimate, mname(m0) spec(st) replay atet
  4.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,interactive,seed,`seed',final,`final',learner,-1) append
  5.                         
.                         // shortstacking results
.                         ddml estimate, mname(m0) spec(ss) replay atet
  6.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,interactive,seed,`seed',final,`final',learner,-2) append
  7.                         
.                         // poolstacking results
.                         ddml estimate, mname(m0) spec(ps) replay atet
  8.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,interactive,seed,`seed',final,`final',learner,-3) append
  9.                 
.                         // pystacked weights
.                         ddml extract, show(stweights)
 10.                         foreach mat in Y1_pystacked_w_mn D1_pystacked_w_mn
>  {
 11.                                         ddml extract, show(stweights)
 12.                                         mat `mat' = r(`mat')
 13.                                         mat list `mat'
 14.                                                 preserve
 15.                                                 svmat `mat'
 16.                                                 keep `mat'*
 17.                                                 list if _n<=8
 18.                                                 save `folder'/`mat'_`final
> '_regular_ia, replace
 19.                                                 restore
 20.                         }       
 21.                         // shortstacked weights
.                         ddml extract, show(ssweights)
 22.                         foreach mat in Y_lnearn_ss D_gender_r_ss {
 23.                                         ddml extract, show(ssweights)
 24.                                         mat `mat' = r(`mat')
 25.                                         mat list `mat'
 26.                                                 preserve
 27.                                                 svmat `mat'
 28.                                                 keep `mat'*
 29.                                                 list if _n<=8
 30.                                                 save `folder'/`mat'_`final
> '_short_ia, replace
 31.                                                 restore
 32.                         }       
 33.                         // poolstacked weights
.                         ddml extract, show(psweights)
 34.                         foreach mat in Y_lnearn_ps D_gender_r_ps {
 35.                                         ddml extract, show(psweights)
 36.                                         mat `mat' = r(`mat')
 37.                                         mat list `mat'
 38.                                                 preserve
 39.                                                 svmat `mat'
 40.                                                 keep `mat'*
 41.                                                 list if _n<=8
 42.                                                 save `folder'/`mat'_`final
> '_pooled_ia, replace
 43.                                                 restore
 44.                         }       
 45.         
.         }
. 
.         forvalues i = 1(1)$L {
  2.                         ddml estimate, y1(Y1_pystacked1_L`i'_1) y0(Y1_pyst
> acked0_L`i'_1) ///
>                                                         d(D1_pystacked_L`i'_1
> ) robust atet foldvar(m0_sample_1  )
  3.                         regsave gender_r using `folder'/results.dta, ci //
> /
>                                                 addlabel(model,interactive,se
> ed,`seed',final,indiv,learner,`i') ///
>                                                 append
  4.         }
. 
. }       

.         
. *****************************************************************************
> *  
. *** interactive NX: short-stacking                                           
>                                       ***
. *****************************************************************************
> *
. 
. if (`estimator'==3) {
. 
. gen one = 1     
. 
.         cap drop y0base*
.         cap drop dbase*
.         cap drop y1base*
. 
.         *** no cross-fitting
.         pystacked lnearn $X_expanded   $pystring_reg0  if gender_r == 0, type
> (reg) njobs($cores)  
.                 mat nxw_ia_y0 = e(weights)
.                 mat list nxw_ia_y0
.                                 preserve
.                                 svmat nxw_ia_y0
.                                 keep nxw_ia_y0*
.                                 save `folder'/nxw_ia_y0, replace
.                                 restore
.         predict y0base0, xb
.         predict y0base, base
. 
.         pystacked lnearn $X_expanded  $pystring_reg0 if gender_r == 1  , type
> (reg) njobs($cores)  
.                 mat nxw_ia_y1 = e(weights)
.                 mat list nxw_ia_y1
.                                 preserve
.                                 svmat nxw_ia_y1
.                                 keep nxw_ia_y1*
.                                 save `folder'/nxw_ia_y1, replace
.                                 restore
.         predict y1base0, xb
.         predict y1base, base
. 
.         pystacked gender_r $X_expanded $pystring_class  
.                 mat nxw_ia_d = e(weights)
.                 mat list nxw_ia_d
.                                 preserve
.                                 svmat nxw_ia_d
.                                 keep nxw_ia_d*
.                                 save `folder'/nxw_ia_d, replace
.                                 restore         
.         predict dbase0, pr
.         predict dbase, base pr
.         
.         forvalues i = 0(1)$L {
  2.                         _estimate_ate interactive, yname(lnearn) dname(gen
> der_r) ///
>                                                 y0(y0base`i') y1(y1base`i') d
> (dbase`i') ///
>                                                 atet foldid(one) robust model
> (interactive)
  3.                         regsave gender_r using `folder'/results.dta, ///
>                                                 ci addlabel(model,nxinter,see
> d,`seed',final,nx,learner,`i') append
  4.         }
.                 
. }

.         
. *****************************************************************************
> *  
. *** partial NX: short-stacking                                               
>                                       ***
. *****************************************************************************
> *
. 
. if (`estimator'==4) {
.         
. cap gen one = 1 
. 
.         cap drop Ybase* 
.         cap drop Dbase*
. 
.         *** no cross-fitting
.         pystacked lnearn $X_expanded $pystring_reg 
.                 mat nxw_y = e(weights)
.                 mat list nxw_y
.                                 preserve
.                                 svmat nxw_y
.                                 keep nxw_y*
.                                 save `folder'/nxw_y, replace
.                                 restore
.         predict Ybase0
.         predict Ybase, basexb
. 
.         pystacked gender_r $X_expanded $pystring_reg 
.                 mat nxw_d = e(weights)
.                 mat list nxw_d
.                                 preserve
.                                 svmat nxw_d
.                                 keep nxw_d*
.                                 save `folder'/nxw_d, replace
.                                 restore         
.         predict Dbase0
.         predict Dbase, basexb
. 
.         forvalues i = 0(1)$L {
  2.                 cap drop Ytil
  3.                 cap drop Dtil
  4.                 gen Ytil = lnearn - Ybase`i'
  5.                 gen Dtil = gender_r - Dbase`i'
  6.                 reg Ytil Dtil, robust
  7.                 regsave Dtil using `folder'/results.dta, ///
>                         ci addlabel(model,nxpartial,seed,`seed',final,nx,lear
> ner,`i') append
  8.         }
. 
. }

.         
. cap log close
