-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /cluster/home/kahrens/ddml_applied/GWG/Output/GWG_26898_2.txt
  log type:  text
 opened on:  10 Dec 2023, 19:14:53

. 
. which ddml
/cluster/home/kahrens/ado/plus/d/ddml.ado
*! ddml v1.4.3
*! last edited: 17aug2023
*! authors: aa/ms

. which pystacked
/cluster/home/kahrens/ado/plus/p/pystacked.ado
*! pystacked v0.7.5
*! last edited: 7aug2023
*! authors: aa/ms

. 
. set seed `seed'

. local folder out_`seed'

. 
. use "../Data/gender_gap_ML_processed", clear

. 
. cap mkdir `folder'

. 
. *****************************************************************************
> ***
. ***  controls
. *****************************************************************************
> ***
. 
. // create squared age and tenure here
. gen age_r2 = age_r^2

. gen tenure2 = tenure^2
(2 missing values generated)

. 
. // no base categories
. global continuous                                                            
>                                                            ///
>         age_r                                                                
>                                                                    /// no mis
> sing
>         yrsqual         /* years of education (derived) */                   
>                                    /// 355 missing
>         /// leavedu             /* age when left education (derived) */      
>                            /// 1,081 missing
>         pvlit1          /* literacy score: plausible value 1 (also 2-10 avail
> ) */       /// no missing
>         pvnum1          /* numeracy score: plausible value 1 (also 2-10 avail
> ) */       /// no missing
>         tenure          /* tenure = years in work for current employer */    
>                    /// 2 missing
>                                                                              
>                                                                            //

. // add second order terms here
. global continuous $continuous age_r2 tenure2

. 
. global discrete0                                                             
>                                                            ///             
>         b_q01a          /* education, highest level attained */              
>                            /// no missing
>         b_q01b          /* area of study */                                  
>                                                    /// 434 missing
>         d_q06c          /* part of a larger organization */                  
>                                    /// 13 missing
>         d_q08a          /* management position */                            
>                                            /// no missing
>         d_q09           /* type of contract */                               
>                                            /// 12 missing
>         d_q10_t1        /* hours per week at this job or business */         
>                    /// 1 missing
>         d_q14           /* job satisfaction */                               
>                                            /// 1 missing
>         i_q08           /* health status */                                  
>                                                    /// 2 missing
>         j_q02a          /* living with a partner */                          
>                                            /// 899 missing
>         j_q03d1_c       /* age of youngest child */                          
>                                            /// 2,718 missing
>         j_q04c1_c       /* immigration: age */                               
>                                            /// 4,375 missing
>         j_q06b          /* mother's highest level of educ */                 
>                            /// 445 missing
>         j_q07b          /* father's highest level of educ */                 
>                            /// 515 missing
>         j_q03b          /* number of children*/                              
>                                            /// 1,856 missing
>         impar           /* immigration: parents */                           
>                                            /// 21 missing
>         imgen           /* immigration: generation */                        
>                                    /// 344 missing
>         nfe12jr         /* informal job-related educ in prev 12 months */    
>                    /// 116 missing
>         nfe12njr        /* informal non-job-related educ in prev 12 months */
>            /// 116 missing
>                                                                              
>                                                                            //
>                                                                              
>                                                          

. global personality                                                           
>                                                            ///
>         i_q04b          /* Learning strategies, Relate new ideas into real li
> fe */      /// 16 missing
>         i_q04d          /* Learning strategies, Like learning new things */  
>                    /// no missing
>         i_q04h          /* Learning strategies, Attribute something new */   
>                    /// 10 missing
>         i_q04j          /* Learning strategies, Deal with difficult things */
>            /// no missing
>         i_q04l          /* Learning strategies, Fit different ideas together 
> */         /// 5 missing
>         i_q04m          /* Learning strategies, Looking for additional info *
> /          /// 1 missing
>         i_q05f          /* Cultural engagement, Voluntary non-profit work */ 
>            /// no missing
>         i_q06a          /* Political efficacy, No influence on the government
>  */        /// 14 missing
>         i_q07a          /* Social trust, Trust only few people */            
>                            /// 4 missing
>         i_q07b          /* Social trust, Other people take advantage of you *
> /          /// 6 missing
>                                                                              
>                                                                            //

. global discrete $discrete0                                                   
>                                                    ///
>         new_reg_tl2     /* geographical region */                            
>                                            /// 2 missing
>         new_isco1c      /* occupation */                                     
>                                                    /// no missing
>         new_isic1c      /* industry */                                       
>                                                    // no missing

. 
. global X_simple                                                         ///
>         i.(b_q01a d_q10_t1 j_q03b)                              ///
>         c.($continuous)

. 
. global X_fullinteracted                                         ///
>         i.($discrete0 )                                                 ///
>         i.new_isco1c#i.new_isic1c#i.new_reg_tl2 ///
>         c.($continuous)                  

.         
. global X_cont                                                           ///
>         c.($continuous)##i.($discrete)

. 
. global X_expanded                                                       ///
>         i.($discrete)                                                   ///
>         c.($continuous)                                                 ///
>         c.age_r#i.($discrete)                                   ///
>         c.tenure#i.($discrete)

. 
.         
. 
. *****************************************************************************
> ***
. ***  estimation sample
. *****************************************************************************
> ***
. 
. gen byte touse=1

. markout touse lnearn $X_expanded

. keep if touse
(53 observations deleted)

. 
. 
. *****************************************************************************
> ***
. ***  learners
. *****************************************************************************
> ***
. 
. global cores = 5

. 
. global rf1 min_samples_leaf(1)  max_features(sqrt) n_estimators(500)

. global rf2 min_samples_leaf(50)  max_features(sqrt) n_estimators(500)

. global rf3 min_samples_leaf(100)  max_features(sqrt) n_estimators(500)

. global grad1 n_estimators(500) n_iter_no_change(10)  

. global grad2 n_estimators(500)  

. global nnet1 hidden_layer_sizes(40 20 1 20 50) early_stopping 

. global nnet2 hidden_layer_sizes(30 30 30) early_stopping  

. 
. global pystring_reg0                                                         
>    || ///
>                                         m(ols)                               
>                            || ///
>                                         m(ols) xvars($X_simple)              
>            || ///
>                                         m(lassocv)                           
>                            || ///
>                                         m(ridgecv)                           
>                            || ///
>                                         m(lassocv)      xvars($X_cont)       
>            || ///
>                                         m(ridgecv)      xvars($X_cont)       
>            || ///
>                                         m(rf) opt($rf1)                      
>                    || ///
>                                         m(rf) opt($rf2)                      
>                    || ///
>                                         m(rf) opt($rf3)                      
>                    || ///
>                                         m(gradboost) opt($grad1)             
>            || ///
>                                         m(gradboost) opt($grad2)             
>            || ///
>                                         m(nnet) opt($nnet1)                  
>            || ///
>                                         m(nnet) opt($nnet2)                  
>            || //

. 
. global pystring_reg  $pystring_reg0 , type(reg) njobs($cores) 

.  
. global pystring_class0                                                       
>            || ///
>                                         m(logit)                             
>                            || ///
>                                         m(logit) xvars($X_simple)            
>            || ///
>                                         m(lassocv)                           
>                            || ///
>                                         m(ridgecv)                           
>                            || ///
>                                         m(lassocv)      xvars($X_cont)       
>            || ///
>                                         m(ridgecv)      xvars($X_cont)       
>            || ///
>                                         m(rf) opt($rf1)                      
>                    || ///
>                                         m(rf) opt($rf2)                      
>                    || ///
>                                         m(rf) opt($rf3)                      
>                    || ///
>                                         m(gradboost) opt($grad1)             
>            || ///
>                                         m(gradboost) opt($grad2)             
>            || ///
>                                         m(nnet) opt($nnet1)                  
>            || ///
>                                         m(nnet) opt($nnet2)                  
>            || //                   

.                                 
. global pystring_class $pystring_class0 , type(class) njobs($cores)

.                                         
. global R =1  

. global K=10 

. global L =13

.         
. *****************************************************************************
> *  
. *** ddml: estimation                                                         
>                                               ***
. *****************************************************************************
> *
. 
. if (`estimator'==1) {
. 
.         ddml init partial,  reps($R) kfolds($K)
.         ddml E[Y|X]: pystacked lnearn $X_expanded $pystring_reg
.         ddml E[D|X]: pystacked gender_r $X_expanded $pystring_reg
.         ddml crossfit, shortstack poolstack
.         ddml estimate, robust
.         
.         foreach mat in lnearn_mse gender_r_mse {
  2.                         ddml extract, show(mse)
  3.                         mat `mat' = r(`mat')
  4.                         mat list `mat'
  5.                                 preserve
  6.                                 svmat `mat'
  7.                                 keep `mat'*
  8.                                 keep if _n<=$L
  9.                                 gen stack_type = "conventional" if _n==1
 10.                                 replace stack_type = "pooled" if _n==2
 11.                                 replace stack_type = "short" if _n==3
 12.                                 gen model = "plm"
 13.                                 list if _n<=$L
 14.                                 save `folder'/`mat'_plm_mse, replace
 15.                                 restore 
 16.         }       
. 
.         cap drop mse_*
.         foreach var of varlist Y1_* {
  2.                  cap drop sqerr_`var'
  3.                  gen double sqerr_`var'=(lnearn-`var')^2
  4.                  sum sqerr_`var', meanonly
  5.                  gen double mse_`var'=r(mean) if _n ==1 
  6.         }
.         foreach var of varlist D1_* {
  2.                  cap drop sqerr_`var'
  3.                  gen double sqerr_`var'=(gender_r-`var')^2
  4.                  sum sqerr_`var', meanonly
  5.                  gen double mse_`var'=r(mean) if _n ==1 
  6.         }
.         preserve
.                 keep mse_*
.                 keep if _n==1
.                 save `folder'/plm_mse, replace
.         restore
.         cap drop mse_*
. 
.         ** initialize results file
.         regsave gender_r using `folder'/results.dta, ci addlabel(model,partia
> l,seed,`seed',final,init,learner,-99) replace
. 
.         foreach final in nnls1 singlebest ols avg {
  2. 
.                 ddml estimate, robust finalest(`final')
  3.         
.                         // regular stacking results
.                         ddml estimate, mname(m0) spec(st) replay  
  4.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,partial,seed,`seed',final,`final',learner,-1) append
  5.                         
.                         // shortstacking results
.                         ddml estimate, mname(m0) spec(ss) replay 
  6.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,partial,seed,`seed',final,`final',learner,-2) append
  7.                         
.                         // poolstacking results
.                         ddml estimate, mname(m0) spec(ps) replay  
  8.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,partial,seed,`seed',final,`final',learner,-3) append     
  9.                 
.                         // pystacked weights
.                         ddml extract, show(stweights)   
 10.                         foreach mat in Y1_pystacked_w_mn D1_pystacked_w_mn
>  {
 11.                                         ddml extract, show(stweights)   
 12.                                         mat `mat' = r(`mat')
 13.                                         mat list `mat'
 14.                                                 preserve
 15.                                                 svmat `mat'
 16.                                                 keep `mat'*
 17.                                                 list if _n<=4
 18.                                                 save `folder'/`mat'_`final
> '_regular, replace
 19.                                                 restore
 20.                         }       
 21.                         // shortstacked weights
.                         ddml extract, show(ssweights)
 22.                         foreach mat in Y_lnearn_ss D_gender_r_ss {
 23.                                         qui ddml extract, show(ssweights)
 24.                                         mat `mat' = r(`mat')
 25.                                         mat list `mat'
 26.                                                 preserve
 27.                                                 svmat `mat'
 28.                                                 keep `mat'*
 29.                                                 list if _n<=4
 30.                                                 save `folder'/`mat'_`final
> '_short, replace
 31.                                                 restore
 32.                         }       
 33.                         // poolstacked weights
. 
.                         foreach mat in Y_lnearn_ps D_gender_r_ps {
 34.                                         qui ddml extract, show(psweights)
 35.                                         mat `mat' = r(`mat')
 36.                                         mat list `mat'
 37.                                                 preserve
 38.                                                 svmat `mat'
 39.                                                 keep `mat'*
 40.                                                 list if _n<=4
 41.                                                 save `folder'/`mat'_`final
> '_pooled, replace
 42.                                                 restore
 43.                         }       
 44.         
.         }
. 
.         forvalues i = 1(1)$L {
  2.                         ddml estimate, y(Y1_pystacked_L`i'_1) ///
>                                                         d(D1_pystacked_L`i'_1
> ) robust
  3.                         regsave gender_r using `folder'/results.dta, ci //
> /
>                                                 addlabel(model,partial,seed,`
> seed',final,indiv,learner,`i') ///
>                                                 append
  4.         }
. 
. }

.         
. *****************************************************************************
> *  
. *** interactive: estimation                                                  
>                                       ***
. *****************************************************************************
> *
.         
. if (`estimator'==2) {   
. 
.         ddml init interactive, kfolds($K) reps($R)
.         ddml E[Y|X,D]: pystacked lnearn $X_expanded $pystring_reg
Learner Y1_pystacked added successfully.
.         ddml E[D|X]: pystacked gender_r $X_expanded $pystring_class
Learner D1_pystacked added successfully.
.         ddml crossfit, shortstack poolstack
Cross-fitting E[y|X,D] equation: lnearn
Cross-fitting fold 1 2 3 4 5 6 7 8 9 10 ...completed cross-fitting...completed 
> short-stacking...completed pooled-stacking
Cross-fitting E[D|X] equation: gender_r
Cross-fitting fold 1 2 3 4 5 6 7 8 9 10 ...completed cross-fitting...completed 
> short-stacking...completed pooled-stacking
.         ddml estimate, robust atet


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.074    (0.027)
  ss  1  [shortstack]          [ss]          [ss]    -0.072    (0.029)
  ps  1   [poolstack]          [ps]          [ps]    -0.071    (0.028)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0716622   .0287916    -2.49   0.013    -.1280927   -.0152317
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 4 propensity scores trimmed to lower limit .01.

. 
.         cap drop mse_*
.         foreach var of varlist Y1_pystacked0* {
  2.                  cap drop sqerr_`var'
  3.                  gen double sqerr_`var'=(lnearn-`var')^2 if gender_r==0
  4.                  sum sqerr_`var' if gender_r==0, meanonly
  5.                  gen double mse_`var'=r(mean) if _n ==1 
  6.         }
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
.         foreach var of varlist Y1_pystacked1* {
  2.                  cap drop sqerr_`var'
  3.                  gen double sqerr_`var'=(lnearn-`var')^2 if gender_r==1
  4.                  sum sqerr_`var' if gender_r==1, meanonly
  5.                  gen double mse_`var'=r(mean) if _n ==1 
  6.         }
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
.         foreach var of varlist D1_* {
  2.                  cap drop sqerr_`var'
  3.                  gen double sqerr_`var'=(gender_r-`var')^2
  4.                  sum sqerr_`var', meanonly
  5.                  gen double mse_`var'=r(mean) if _n ==1 
  6.         }
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
.         preserve
.                 keep mse_*
.                 keep if _n==1
(4,835 observations deleted)
.                 save `folder'/inter_mse, replace
(note: file out_26898/inter_mse.dta not found)
file out_26898/inter_mse.dta saved
.         restore
.         cap drop mse_*
.         
.         local mat gender_r_mse
.                         ddml extract, show(mse)

MSEs for gender_r:
                 rep   full smp      fold 1      fold 2      fold 3      fold 4
>       fold 5      fold 6      fold 7      fold 8      fold 9     fold 10 
    D1_pystacked   1      0.155       0.145       0.144       0.170       0.167
>        0.133       0.156       0.152       0.166       0.164       0.151  
   D_gender_r_ps   1      0.155       0.145       0.143       0.170       0.167
>        0.132       0.156       0.152       0.165       0.163       0.151  
   D_gender_r_ss   1      0.154       0.145       0.143       0.170       0.167
>        0.132       0.156       0.150       0.166       0.163       0.150  

MSEs for lnearn:
                D=  rep   full smp      fold 1      fold 2      fold 3      fol
> d 4      fold 5      fold 6      fold 7      fold 8      fold 9     fold 10 
    Y1_pystacked 0    1      0.226       0.228       0.227       0.211       0.
> 180       0.121       0.212       0.430       0.290       0.207       0.167  
    Y1_pystacked 1    1      0.173       0.133       0.172       0.185       0.
> 147       0.166       0.231       0.205       0.130       0.115       0.243  
     Y_lnearn_ps 0    1      8.299       8.320       8.439       8.317       8.
> 236       8.197       8.078       8.231       8.377       8.391       8.395  
     Y_lnearn_ps 1    1      7.485       7.408       7.694       7.623       7.
> 523       7.477       7.333       7.556       7.311       7.463       7.457  
     Y_lnearn_ss 0    1      0.224       0.229       0.224       0.208       0.
> 179       0.119       0.209       0.428       0.285       0.204       0.169  
     Y_lnearn_ss 1    1      0.172       0.134       0.171       0.182       0.
> 144       0.166       0.232       0.202       0.128       0.115       0.243  
.                         mat `mat' = r(`mat')
.                         mat list `mat'

gender_r_mse[3,12]
                      rep  full_sample        fold1        fold2        fold3
D1_pystacked            1    .15478037       .14503    .14362675    .17015825
D_gender_r~s            1    .15453412    .14490359     .1433107    .17025182
D_gender_r~s            1    .15427517    .14548671    .14345228    .17023517

                    fold4        fold5        fold6        fold7        fold8
D1_pystacked    .16742567    .13255614    .15640408    .15181965    .16608369
D_gender_r~s    .16725627    .13243844    .15627986    .15198506      .165152
D_gender_r~s      .166902    .13169039     .1561826    .15024878    .16619812

                    fold9       fold10
D1_pystacked    .16363405    .15110375
D_gender_r~s    .16301847    .15078308
D_gender_r~s    .16255304    .14984595
.                                 preserve
.                                 svmat `mat'
.                                 keep `mat'*
.                                 keep if _n<=$L
(4,823 observations deleted)
.                                 gen stack_type = "conventional" if _n==1
(12 missing values generated)
.                                 replace stack_type = "pooled" if _n==2
(1 real change made)
.                                 replace stack_type = "short" if _n==3
(1 real change made)
.                                 gen model = "interactive"
.                                 list if _n<=$L

     +-----------------------------------------------------------------+
  1. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        1 | .1547804 |   .14503 | .1436267 | .1701583 | .1674257 |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     | .1325561 | .1564041 | .1518197 | .1660837 |  .163634 | .1511037 |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |          conventional          |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  2. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        1 | .1545341 | .1449036 | .1433107 | .1702518 | .1672563 |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     | .1324385 | .1562799 | .1519851 |  .165152 | .1630185 | .1507831 |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                pooled          |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  3. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        1 | .1542752 | .1454867 | .1434523 | .1702352 |  .166902 |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     | .1316904 | .1561826 | .1502488 | .1661981 |  .162553 |  .149846 |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                 short          |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  4. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  5. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  6. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  7. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  8. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  9. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 10. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 11. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 12. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 13. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+
.                                 save `folder'/`mat'_inter_gender_mse, replace
(note: file out_26898/gender_r_mse_inter_gender_mse.dta not found)
file out_26898/gender_r_mse_inter_gender_mse.dta saved
.                                 restore 
.                                 
.         local mat lnearn_mse
.                         ddml extract, show(mse)

MSEs for gender_r:
                 rep   full smp      fold 1      fold 2      fold 3      fold 4
>       fold 5      fold 6      fold 7      fold 8      fold 9     fold 10 
    D1_pystacked   1      0.155       0.145       0.144       0.170       0.167
>        0.133       0.156       0.152       0.166       0.164       0.151  
   D_gender_r_ps   1      0.155       0.145       0.143       0.170       0.167
>        0.132       0.156       0.152       0.165       0.163       0.151  
   D_gender_r_ss   1      0.154       0.145       0.143       0.170       0.167
>        0.132       0.156       0.150       0.166       0.163       0.150  

MSEs for lnearn:
                D=  rep   full smp      fold 1      fold 2      fold 3      fol
> d 4      fold 5      fold 6      fold 7      fold 8      fold 9     fold 10 
    Y1_pystacked 0    1      0.226       0.228       0.227       0.211       0.
> 180       0.121       0.212       0.430       0.290       0.207       0.167  
    Y1_pystacked 1    1      0.173       0.133       0.172       0.185       0.
> 147       0.166       0.231       0.205       0.130       0.115       0.243  
     Y_lnearn_ps 0    1      8.299       8.320       8.439       8.317       8.
> 236       8.197       8.078       8.231       8.377       8.391       8.395  
     Y_lnearn_ps 1    1      7.485       7.408       7.694       7.623       7.
> 523       7.477       7.333       7.556       7.311       7.463       7.457  
     Y_lnearn_ss 0    1      0.224       0.229       0.224       0.208       0.
> 179       0.119       0.209       0.428       0.285       0.204       0.169  
     Y_lnearn_ss 1    1      0.172       0.134       0.171       0.182       0.
> 144       0.166       0.232       0.202       0.128       0.115       0.243  
.                         mat `mat' = r(`mat')
.                         mat list `mat'

lnearn_mse[6,13]
                    D=0/1          rep  full_sample        fold1        fold2
Y1_pystacked            0            1    .22634113    .22837105    .22698918
Y1_pystacked            1            1     .1731942    .13289276     .1717819
 Y_lnearn_ps            0            1     8.298817    8.3195443    8.4389064
 Y_lnearn_ps            1            1    7.4851185    7.4084242    7.6938269
 Y_lnearn_ss            0            1    .22427962    .22869344    .22382382
 Y_lnearn_ss            1            1    .17226034    .13424766    .17072845

                    fold3        fold4        fold5        fold6        fold7
Y1_pystacked     .2111748    .18040867    .12066952    .21185503    .42952921
Y1_pystacked    .18525402    .14675158     .1660233     .2313805    .20458219
 Y_lnearn_ps    8.3165174    8.2361289    8.1966275    8.0775904    8.2305185
 Y_lnearn_ps    7.6229007    7.5229796    7.4772155    7.3327138    7.5564505
 Y_lnearn_ss    .20807736    .17912536    .11872742    .20865455    .42806415
 Y_lnearn_ss    .18206108    .14407353      .165788    .23218366    .20214823

                    fold8        fold9       fold10
Y1_pystacked    .29026888    .20718968    .16650832
Y1_pystacked    .13026882     .1145327    .24289885
 Y_lnearn_ps    8.3766785    8.3913828    8.3952953
 Y_lnearn_ps    7.3113474    7.4632577    7.4569924
 Y_lnearn_ss    .28483748    .20365331    .16868912
 Y_lnearn_ss    .12849726    .11454219    .24269202
.                                 preserve
.                                 svmat `mat'
.                                 keep `mat'*
.                                 keep if _n<=(2*$L)
(4,810 observations deleted)
.                                 gen stack_type = "conventional" if _n<=2
(24 missing values generated)
.                                 replace stack_type = "pooled" if _n>=3 & _n<=
> 4
(2 real changes made)
.                                 replace stack_type = "short" if _n>4
(22 real changes made)
.                                 gen model = "interactive"
.                                 list if _n<=(2*$L)

     +-----------------------------------------------------------------+
  1. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        0 |        1 | .2263411 |  .228371 | .2269892 | .2111748 |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     | .1804087 | .1206695 |  .211855 | .4295292 | .2902689 | .2071897 |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |     .1665083     |     conventional      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  2. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        1 |        1 | .1731942 | .1328928 | .1717819 |  .185254 |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     | .1467516 | .1660233 | .2313805 | .2045822 | .1302688 | .1145327 |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |     .2428989     |     conventional      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  3. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        0 |        1 | 8.298817 | 8.319545 | 8.438907 | 8.316518 |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     | 8.236129 | 8.196628 |  8.07759 | 8.230518 | 8.376678 | 8.391383 |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |     8.395295     |           pooled      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  4. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        1 |        1 | 7.485118 | 7.408424 | 7.693827 |   7.6229 |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |  7.52298 | 7.477215 | 7.332714 |  7.55645 | 7.311347 | 7.463258 |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |     7.456993     |           pooled      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  5. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        0 |        1 | .2242796 | .2286934 | .2238238 | .2080774 |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     | .1791254 | .1187274 | .2086546 | .4280641 | .2848375 | .2036533 |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |     .1686891     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  6. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        1 |        1 | .1722603 | .1342477 | .1707285 | .1820611 |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     | .1440735 |  .165788 | .2321837 | .2021482 | .1284973 | .1145422 |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |      .242692     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  7. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  8. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  9. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 10. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 11. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 12. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 13. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 14. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 15. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 16. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 17. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 18. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 19. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 20. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 21. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 22. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 23. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 24. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 25. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 26. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+
.                                 save `folder'/`mat'_inter_lnearn_mse, replace
(note: file out_26898/lnearn_mse_inter_lnearn_mse.dta not found)
file out_26898/lnearn_mse_inter_lnearn_mse.dta saved
.                                 restore 
.         
.         foreach final in nnls1 singlebest ols avg {
  2. 
.                 ddml estimate, robust finalest(`final') atet
  3.         
.                         // regular stacking results
.                         ddml estimate, mname(m0) spec(st) replay atet
  4.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,interactive,seed,`seed',final,`final',learner,-1) append
  5.                         
.                         // shortstacking results
.                         ddml estimate, mname(m0) spec(ss) replay atet
  6.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,interactive,seed,`seed',final,`final',learner,-2) append
  7.                         
.                         // poolstacking results
.                         ddml estimate, mname(m0) spec(ps) replay atet
  8.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,interactive,seed,`seed',final,`final',learner,-3) append
  9.                 
.                         // pystacked weights
.                         ddml extract, show(stweights)
 10.                         foreach mat in Y1_pystacked_w_mn D1_pystacked_w_mn
>  {
 11.                                         ddml extract, show(stweights)
 12.                                         mat `mat' = r(`mat')
 13.                                         mat list `mat'
 14.                                                 preserve
 15.                                                 svmat `mat'
 16.                                                 keep `mat'*
 17.                                                 list if _n<=8
 18.                                                 save `folder'/`mat'_`final
> '_regular_ia, replace
 19.                                                 restore
 20.                         }       
 21.                         // shortstacked weights
.                         ddml extract, show(ssweights)
 22.                         foreach mat in Y_lnearn_ss D_gender_r_ss {
 23.                                         ddml extract, show(ssweights)
 24.                                         mat `mat' = r(`mat')
 25.                                         mat list `mat'
 26.                                                 preserve
 27.                                                 svmat `mat'
 28.                                                 keep `mat'*
 29.                                                 list if _n<=8
 30.                                                 save `folder'/`mat'_`final
> '_short_ia, replace
 31.                                                 restore
 32.                         }       
 33.                         // poolstacked weights
.                         ddml extract, show(psweights)
 34.                         foreach mat in Y_lnearn_ps D_gender_r_ps {
 35.                                         ddml extract, show(psweights)
 36.                                         mat `mat' = r(`mat')
 37.                                         mat list `mat'
 38.                                                 preserve
 39.                                                 svmat `mat'
 40.                                                 keep `mat'*
 41.                                                 list if _n<=8
 42.                                                 save `folder'/`mat'_`final
> '_pooled_ia, replace
 43.                                                 restore
 44.                         }       
 45.         
.         }


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.074    (0.027)
  ss  1  [shortstack]          [ss]          [ss]    -0.072    (0.029)
  ps  1   [poolstack]          [ps]          [ps]    -0.071    (0.028)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0716622   .0287916    -2.49   0.013    -.1280927   -.0152317
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 4 propensity scores trimmed to lower limit .01.



Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.074    (0.027)
  ss  1  [shortstack]          [ss]          [ss]    -0.072    (0.029)
  ps  1   [poolstack]          [ps]          [ps]    -0.071    (0.028)

Stacking DDML model (ATET)
E[y|X,D=0]   = Y1_pystacked0_1                     Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1
E[D|X]       = D1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |   -.074241   .0272561    -2.72   0.006     -.127662     -.02082
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 2 propensity scores trimmed to lower limit .01.

(note: variable final was str5, now str10 to accommodate using data's values)
file out_26898/results.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  ss  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.072    (0.029)
  ss  1  [shortstack]          [ss]          [ss]    -0.072    (0.029)
  ps  1   [poolstack]          [ps]          [ps]    -0.071    (0.028)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0716622   .0287916    -2.49   0.013    -.1280927   -.0152317
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 4 propensity scores trimmed to lower limit .01.

(note: variable final was str5, now str10 to accommodate using data's values)
file out_26898/results.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  ps  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.071    (0.028)
  ss  1  [shortstack]          [ss]          [ss]    -0.072    (0.029)
  ps  1   [poolstack]          [ps]          [ps]    -0.071    (0.028)

Poolstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ps0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ps1
E[D|X]       = D_gender_r_ps_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0710178   .0278134    -2.55   0.011     -.125531   -.0165045
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 3 propensity scores trimmed to lower limit .01.

(note: variable final was str5, now str10 to accommodate using data's values)
file out_26898/results.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1     .2384202     .2384202
    logit            2    6.471e-17    6.471e-17
  lassocv            3    .10200234    .10200234
  ridgecv            4    .07290756    .07290756
  lassocv            5    .03022753    .03022753
  ridgecv            6     .0031197     .0031197
       rf            7    .28160586    .28160586
       rf            8    3.508e-17    3.508e-17
       rf            9    1.065e-16    1.065e-16
gradboost           10     .0286758     .0286758
gradboost           11    .22164246    .22164246
     nnet           12    8.963e-17    8.963e-17
     nnet           13    .02139854    .02139854

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .01692291    .01692291
      ols            2            0    1.127e-16    1.127e-16
  lassocv            3            0    .10295718    .10295718
  ridgecv            4            0    .18749178    .18749178
  lassocv            5            0    .04394297    .04394297
  ridgecv            6            0    .01163053    .01163053
       rf            7            0    .46136112    .46136112
       rf            8            0    9.155e-17    9.155e-17
       rf            9            0    1.162e-16    1.162e-16
gradboost           10            0    .01152971    .01152971
gradboost           11            0    .14507278    .14507278
     nnet           12            0    .01134925    .01134925
     nnet           13            0    .00774177    .00774177
      ols            1            1    .02869651    .02869651
      ols            2            1    .00006619    .00006619
  lassocv            3            1    .10349786    .10349786
  ridgecv            4            1    .05141988    .05141988
  lassocv            5            1    .20089588    .20089588
  ridgecv            6            1    .02080557    .02080557
       rf            7            1    .50531389    .50531389
       rf            8            1    2.201e-17    2.201e-17
       rf            9            1    7.175e-17    7.175e-17
gradboost           10            1    .01155055    .01155055
gradboost           11            1    .04188205    .04188205
     nnet           12            1    .01516595    .01516595
     nnet           13            1    .02070567    .02070567

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1     .2384202     .2384202
    logit            2    6.471e-17    6.471e-17
  lassocv            3    .10200234    .10200234
  ridgecv            4    .07290756    .07290756
  lassocv            5    .03022753    .03022753
  ridgecv            6     .0031197     .0031197
       rf            7    .28160586    .28160586
       rf            8    3.508e-17    3.508e-17
       rf            9    1.065e-16    1.065e-16
gradboost           10     .0286758     .0286758
gradboost           11    .22164246    .22164246
     nnet           12    8.963e-17    8.963e-17
     nnet           13    .02139854    .02139854

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .01692291    .01692291
      ols            2            0    1.127e-16    1.127e-16
  lassocv            3            0    .10295718    .10295718
  ridgecv            4            0    .18749178    .18749178
  lassocv            5            0    .04394297    .04394297
  ridgecv            6            0    .01163053    .01163053
       rf            7            0    .46136112    .46136112
       rf            8            0    9.155e-17    9.155e-17
       rf            9            0    1.162e-16    1.162e-16
gradboost           10            0    .01152971    .01152971
gradboost           11            0    .14507278    .14507278
     nnet           12            0    .01134925    .01134925
     nnet           13            0    .00774177    .00774177
      ols            1            1    .02869651    .02869651
      ols            2            1    .00006619    .00006619
  lassocv            3            1    .10349786    .10349786
  ridgecv            4            1    .05141988    .05141988
  lassocv            5            1    .20089588    .20089588
  ridgecv            6            1    .02080557    .02080557
       rf            7            1    .50531389    .50531389
       rf            8            1    2.201e-17    2.201e-17
       rf            9            1    7.175e-17    7.175e-17
gradboost           10            1    .01155055    .01155055
gradboost           11            1    .04188205    .04188205
     nnet           12            1    .01516595    .01516595
     nnet           13            1    .02070567    .02070567

Y1_pystacked_w_mn[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .01692291    .01692291
      ols            2            0    1.127e-16    1.127e-16
  lassocv            3            0    .10295718    .10295718
  ridgecv            4            0    .18749178    .18749178
  lassocv            5            0    .04394297    .04394297
  ridgecv            6            0    .01163053    .01163053
       rf            7            0    .46136112    .46136112
       rf            8            0    9.155e-17    9.155e-17
       rf            9            0    1.162e-16    1.162e-16
gradboost           10            0    .01152971    .01152971
gradboost           11            0    .14507278    .14507278
     nnet           12            0    .01134925    .01134925
     nnet           13            0    .00774177    .00774177
      ols            1            1    .02869651    .02869651
      ols            2            1    .00006619    .00006619
  lassocv            3            1    .10349786    .10349786
  ridgecv            4            1    .05141988    .05141988
  lassocv            5            1    .20089588    .20089588
  ridgecv            6            1    .02080557    .02080557
       rf            7            1    .50531389    .50531389
       rf            8            1    2.201e-17    2.201e-17
       rf            9            1    7.175e-17    7.175e-17
gradboost           10            1    .01155055    .01155055
gradboost           11            1    .04188205    .04188205
     nnet           12            1    .01516595    .01516595
     nnet           13            1    .02070567    .02070567

      +-------------------------------------------+
      | Y1_pys~1   Y1_pys~2   Y1_pys~3   Y1_pys~4 |
      |-------------------------------------------|
   1. |        1          0   .0169229   .0169229 |
   2. |        2          0   1.13e-16   1.13e-16 |
   3. |        3          0   .1029572   .1029572 |
   4. |        4          0   .1874918   .1874918 |
   5. |        5          0    .043943    .043943 |
      |-------------------------------------------|
   6. |        6          0   .0116305   .0116305 |
   7. |        7          0   .4613611   .4613611 |
   8. |        8          0   9.16e-17   9.16e-17 |
      +-------------------------------------------+
(note: file out_26898/Y1_pystacked_w_mn_nnls1_regular_ia.dta not found)
file out_26898/Y1_pystacked_w_mn_nnls1_regular_ia.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1     .2384202     .2384202
    logit            2    6.471e-17    6.471e-17
  lassocv            3    .10200234    .10200234
  ridgecv            4    .07290756    .07290756
  lassocv            5    .03022753    .03022753
  ridgecv            6     .0031197     .0031197
       rf            7    .28160586    .28160586
       rf            8    3.508e-17    3.508e-17
       rf            9    1.065e-16    1.065e-16
gradboost           10     .0286758     .0286758
gradboost           11    .22164246    .22164246
     nnet           12    8.963e-17    8.963e-17
     nnet           13    .02139854    .02139854

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .01692291    .01692291
      ols            2            0    1.127e-16    1.127e-16
  lassocv            3            0    .10295718    .10295718
  ridgecv            4            0    .18749178    .18749178
  lassocv            5            0    .04394297    .04394297
  ridgecv            6            0    .01163053    .01163053
       rf            7            0    .46136112    .46136112
       rf            8            0    9.155e-17    9.155e-17
       rf            9            0    1.162e-16    1.162e-16
gradboost           10            0    .01152971    .01152971
gradboost           11            0    .14507278    .14507278
     nnet           12            0    .01134925    .01134925
     nnet           13            0    .00774177    .00774177
      ols            1            1    .02869651    .02869651
      ols            2            1    .00006619    .00006619
  lassocv            3            1    .10349786    .10349786
  ridgecv            4            1    .05141988    .05141988
  lassocv            5            1    .20089588    .20089588
  ridgecv            6            1    .02080557    .02080557
       rf            7            1    .50531389    .50531389
       rf            8            1    2.201e-17    2.201e-17
       rf            9            1    7.175e-17    7.175e-17
gradboost           10            1    .01155055    .01155055
gradboost           11            1    .04188205    .04188205
     nnet           12            1    .01516595    .01516595
     nnet           13            1    .02070567    .02070567

D1_pystacked_w_mn[13,3]
               learner  mean_weight        rep_1
    logit            1     .2384202     .2384202
    logit            2    6.471e-17    6.471e-17
  lassocv            3    .10200234    .10200234
  ridgecv            4    .07290756    .07290756
  lassocv            5    .03022753    .03022753
  ridgecv            6     .0031197     .0031197
       rf            7    .28160586    .28160586
       rf            8    3.508e-17    3.508e-17
       rf            9    1.065e-16    1.065e-16
gradboost           10     .0286758     .0286758
gradboost           11    .22164246    .22164246
     nnet           12    8.963e-17    8.963e-17
     nnet           13    .02139854    .02139854

      +--------------------------------+
      | D1_pys~1   D1_pys~2   D1_pys~3 |
      |--------------------------------|
   1. |        1   .2384202   .2384202 |
   2. |        2   6.47e-17   6.47e-17 |
   3. |        3   .1020023   .1020023 |
   4. |        4   .0729076   .0729076 |
   5. |        5   .0302275   .0302275 |
      |--------------------------------|
   6. |        6   .0031197   .0031197 |
   7. |        7   .2816059   .2816059 |
   8. |        8   3.51e-17   3.51e-17 |
      +--------------------------------+
(note: file out_26898/D1_pystacked_w_mn_nnls1_regular_ia.dta not found)
file out_26898/D1_pystacked_w_mn_nnls1_regular_ia.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1     .2155912     .2155912
    logit            2            0            0
  lassocv            3            0            0
  ridgecv            4    .03535683    .03535683
  lassocv            5            0            0
  ridgecv            6    .17704915    .17704915
       rf            7     .2636545     .2636545
       rf            8    1.441e-16    1.441e-16
       rf            9    2.713e-17    2.713e-17
gradboost           10            0            0
gradboost           11    .30834832    .30834832
     nnet           12    7.260e-17    7.260e-17
     nnet           13    1.035e-17    1.035e-17

short-stacked weights across resamples for lnearn
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .05187596    .05187596
      ols            2            0    2.223e-17    2.223e-17
  lassocv            3            0    .08810285    .08810285
  ridgecv            4            0    .17379527    .17379527
  lassocv            5            0    1.505e-16    1.505e-16
  ridgecv            6            0    7.291e-17    7.291e-17
       rf            7            0    .49036016    .49036016
       rf            8            0    2.143e-17    2.143e-17
       rf            9            0    2.520e-16    2.520e-16
gradboost           10            0            0            0
gradboost           11            0    .19586577    .19586577
     nnet           12            0    3.099e-17    3.099e-17
     nnet           13            0    3.361e-17    3.361e-17
      ols            1            1    8.587e-17    8.587e-17
      ols            2            1            0            0
  lassocv            3            1    .04462708    .04462708
  ridgecv            4            1    2.034e-17    2.034e-17
  lassocv            5            1    .35129596    .35129596
  ridgecv            6            1    .04192768    .04192768
       rf            7            1     .5272445     .5272445
       rf            8            1    1.827e-16    1.827e-16
       rf            9            1    1.538e-16    1.538e-16
gradboost           10            1    7.791e-17    7.791e-17
gradboost           11            1    .03490479    .03490479
     nnet           12            1    2.182e-16    2.182e-16
     nnet           13            1    8.893e-16    8.893e-16

short-stacked weights across resamples for gender_r
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1     .2155912     .2155912
    logit            2            0            0
  lassocv            3            0            0
  ridgecv            4    .03535683    .03535683
  lassocv            5            0            0
  ridgecv            6    .17704915    .17704915
       rf            7     .2636545     .2636545
       rf            8    1.441e-16    1.441e-16
       rf            9    2.713e-17    2.713e-17
gradboost           10            0            0
gradboost           11    .30834832    .30834832
     nnet           12    7.260e-17    7.260e-17
     nnet           13    1.035e-17    1.035e-17

short-stacked weights across resamples for lnearn
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .05187596    .05187596
      ols            2            0    2.223e-17    2.223e-17
  lassocv            3            0    .08810285    .08810285
  ridgecv            4            0    .17379527    .17379527
  lassocv            5            0    1.505e-16    1.505e-16
  ridgecv            6            0    7.291e-17    7.291e-17
       rf            7            0    .49036016    .49036016
       rf            8            0    2.143e-17    2.143e-17
       rf            9            0    2.520e-16    2.520e-16
gradboost           10            0            0            0
gradboost           11            0    .19586577    .19586577
     nnet           12            0    3.099e-17    3.099e-17
     nnet           13            0    3.361e-17    3.361e-17
      ols            1            1    8.587e-17    8.587e-17
      ols            2            1            0            0
  lassocv            3            1    .04462708    .04462708
  ridgecv            4            1    2.034e-17    2.034e-17
  lassocv            5            1    .35129596    .35129596
  ridgecv            6            1    .04192768    .04192768
       rf            7            1     .5272445     .5272445
       rf            8            1    1.827e-16    1.827e-16
       rf            9            1    1.538e-16    1.538e-16
gradboost           10            1    7.791e-17    7.791e-17
gradboost           11            1    .03490479    .03490479
     nnet           12            1    2.182e-16    2.182e-16
     nnet           13            1    8.893e-16    8.893e-16

Y_lnearn_ss[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .05187596    .05187596
      ols            2            0    2.223e-17    2.223e-17
  lassocv            3            0    .08810285    .08810285
  ridgecv            4            0    .17379527    .17379527
  lassocv            5            0    1.505e-16    1.505e-16
  ridgecv            6            0    7.291e-17    7.291e-17
       rf            7            0    .49036016    .49036016
       rf            8            0    2.143e-17    2.143e-17
       rf            9            0    2.520e-16    2.520e-16
gradboost           10            0            0            0
gradboost           11            0    .19586577    .19586577
     nnet           12            0    3.099e-17    3.099e-17
     nnet           13            0    3.361e-17    3.361e-17
      ols            1            1    8.587e-17    8.587e-17
      ols            2            1            0            0
  lassocv            3            1    .04462708    .04462708
  ridgecv            4            1    2.034e-17    2.034e-17
  lassocv            5            1    .35129596    .35129596
  ridgecv            6            1    .04192768    .04192768
       rf            7            1     .5272445     .5272445
       rf            8            1    1.827e-16    1.827e-16
       rf            9            1    1.538e-16    1.538e-16
gradboost           10            1    7.791e-17    7.791e-17
gradboost           11            1    .03490479    .03490479
     nnet           12            1    2.182e-16    2.182e-16
     nnet           13            1    8.893e-16    8.893e-16

      +-------------------------------------------------------------------+
      | Y_lne~1_1   Y_lne~0_1   Y_lne~s1   Y_lnea~2   Y_lnea~3   Y_lnea~4 |
      |-------------------------------------------------------------------|
   1. | 2.4785412   2.7728394          1          0    .051876    .051876 |
   2. | 2.9799508   3.2374318          2          0   2.22e-17   2.22e-17 |
   3. | 2.8010105   2.8741746          3          0   .0881028   .0881028 |
   4. | 2.4619176   2.6233899          4          0   .1737953   .1737953 |
   5. | 3.1210994   3.1420296          5          0   1.50e-16   1.50e-16 |
      |-------------------------------------------------------------------|
   6. | 2.5477426   2.7139497          6          0   7.29e-17   7.29e-17 |
   7. | 2.3789374   2.6416499          7          0   .4903602   .4903602 |
   8. | 2.6643037   2.7111669          8          0   2.14e-17   2.14e-17 |
      +-------------------------------------------------------------------+
(note: file out_26898/Y_lnearn_ss_nnls1_short_ia.dta not found)
file out_26898/Y_lnearn_ss_nnls1_short_ia.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1     .2155912     .2155912
    logit            2            0            0
  lassocv            3            0            0
  ridgecv            4    .03535683    .03535683
  lassocv            5            0            0
  ridgecv            6    .17704915    .17704915
       rf            7     .2636545     .2636545
       rf            8    1.441e-16    1.441e-16
       rf            9    2.713e-17    2.713e-17
gradboost           10            0            0
gradboost           11    .30834832    .30834832
     nnet           12    7.260e-17    7.260e-17
     nnet           13    1.035e-17    1.035e-17

short-stacked weights across resamples for lnearn
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .05187596    .05187596
      ols            2            0    2.223e-17    2.223e-17
  lassocv            3            0    .08810285    .08810285
  ridgecv            4            0    .17379527    .17379527
  lassocv            5            0    1.505e-16    1.505e-16
  ridgecv            6            0    7.291e-17    7.291e-17
       rf            7            0    .49036016    .49036016
       rf            8            0    2.143e-17    2.143e-17
       rf            9            0    2.520e-16    2.520e-16
gradboost           10            0            0            0
gradboost           11            0    .19586577    .19586577
     nnet           12            0    3.099e-17    3.099e-17
     nnet           13            0    3.361e-17    3.361e-17
      ols            1            1    8.587e-17    8.587e-17
      ols            2            1            0            0
  lassocv            3            1    .04462708    .04462708
  ridgecv            4            1    2.034e-17    2.034e-17
  lassocv            5            1    .35129596    .35129596
  ridgecv            6            1    .04192768    .04192768
       rf            7            1     .5272445     .5272445
       rf            8            1    1.827e-16    1.827e-16
       rf            9            1    1.538e-16    1.538e-16
gradboost           10            1    7.791e-17    7.791e-17
gradboost           11            1    .03490479    .03490479
     nnet           12            1    2.182e-16    2.182e-16
     nnet           13            1    8.893e-16    8.893e-16

D_gender_r_ss[13,3]
               learner  mean_weight        rep_1
    logit            1     .2155912     .2155912
    logit            2            0            0
  lassocv            3            0            0
  ridgecv            4    .03535683    .03535683
  lassocv            5            0            0
  ridgecv            6    .17704915    .17704915
       rf            7     .2636545     .2636545
       rf            8    1.441e-16    1.441e-16
       rf            9    2.713e-17    2.713e-17
gradboost           10            0            0
gradboost           11    .30834832    .30834832
     nnet           12    7.260e-17    7.260e-17
     nnet           13    1.035e-17    1.035e-17

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .76799033          1   .2155912   .2155912 |
   2. | .34206934          2          0          0 |
   3. | .07895614          3          0          0 |
   4. | .21990142          4   .0353568   .0353568 |
   5. | .53223606          5          0          0 |
      |--------------------------------------------|
   6. | .85409623          6   .1770491   .1770491 |
   7. | .81030937          7   .2636545   .2636545 |
   8. | .84659199          8   1.44e-16   1.44e-16 |
      +--------------------------------------------+
(note: file out_26898/D_gender_r_ss_nnls1_short_ia.dta not found)
file out_26898/D_gender_r_ss_nnls1_short_ia.dta saved

pool-stacked weights across resamples for gender_r
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .24467819    .24467819
    logit            2            0            0
  lassocv            3    .15241597    .15241597
  ridgecv            4    .06301041    .06301041
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7    .28736841    .28736841
       rf            8    3.355e-16    3.355e-16
       rf            9    1.076e-17    1.076e-17
gradboost           10    2.360e-16    2.360e-16
gradboost           11    .23380398    .23380398
     nnet           12    4.050e-16    4.050e-16
     nnet           13    .01872305    .01872305

pool-stacked weights across resamples for lnearn
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .00146357    .00146357
      ols            2            0    1.107e-15    1.107e-15
  lassocv            3            0    .19308297    .19308297
  ridgecv            4            0    .17267294    .17267294
  lassocv            5            0    2.708e-16    2.708e-16
  ridgecv            6            0            0            0
       rf            7            0    .46640825    .46640825
       rf            8            0    1.590e-15    1.590e-15
       rf            9            0    2.343e-15    2.343e-15
gradboost           10            0    1.042e-15    1.042e-15
gradboost           11            0    .16637226    .16637226
     nnet           12            0    3.325e-15    3.325e-15
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1    .19947613    .19947613
  ridgecv            4            1    .09142381    .09142381
  lassocv            5            1    .10733458    .10733458
  ridgecv            6            1    .00428499    .00428499
       rf            7            1    .52725598    .52725598
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1    .05216646    .05216646
     nnet           12            1            0            0
     nnet           13            1    .01805804    .01805804

pool-stacked weights across resamples for gender_r
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .24467819    .24467819
    logit            2            0            0
  lassocv            3    .15241597    .15241597
  ridgecv            4    .06301041    .06301041
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7    .28736841    .28736841
       rf            8    3.355e-16    3.355e-16
       rf            9    1.076e-17    1.076e-17
gradboost           10    2.360e-16    2.360e-16
gradboost           11    .23380398    .23380398
     nnet           12    4.050e-16    4.050e-16
     nnet           13    .01872305    .01872305

pool-stacked weights across resamples for lnearn
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .00146357    .00146357
      ols            2            0    1.107e-15    1.107e-15
  lassocv            3            0    .19308297    .19308297
  ridgecv            4            0    .17267294    .17267294
  lassocv            5            0    2.708e-16    2.708e-16
  ridgecv            6            0            0            0
       rf            7            0    .46640825    .46640825
       rf            8            0    1.590e-15    1.590e-15
       rf            9            0    2.343e-15    2.343e-15
gradboost           10            0    1.042e-15    1.042e-15
gradboost           11            0    .16637226    .16637226
     nnet           12            0    3.325e-15    3.325e-15
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1    .19947613    .19947613
  ridgecv            4            1    .09142381    .09142381
  lassocv            5            1    .10733458    .10733458
  ridgecv            6            1    .00428499    .00428499
       rf            7            1    .52725598    .52725598
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1    .05216646    .05216646
     nnet           12            1            0            0
     nnet           13            1    .01805804    .01805804

Y_lnearn_ps[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .00146357    .00146357
      ols            2            0    1.107e-15    1.107e-15
  lassocv            3            0    .19308297    .19308297
  ridgecv            4            0    .17267294    .17267294
  lassocv            5            0    2.708e-16    2.708e-16
  ridgecv            6            0            0            0
       rf            7            0    .46640825    .46640825
       rf            8            0    1.590e-15    1.590e-15
       rf            9            0    2.343e-15    2.343e-15
gradboost           10            0    1.042e-15    1.042e-15
gradboost           11            0    .16637226    .16637226
     nnet           12            0    3.325e-15    3.325e-15
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1    .19947613    .19947613
  ridgecv            4            1    .09142381    .09142381
  lassocv            5            1    .10733458    .10733458
  ridgecv            6            1    .00428499    .00428499
       rf            7            1    .52725598    .52725598
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1    .05216646    .05216646
     nnet           12            1            0            0
     nnet           13            1    .01805804    .01805804

      +-------------------------------------------------------------------+
      | Y_lne~1_1   Y_lne~0_1   Y_lne~s1   Y_lnea~2   Y_lnea~3   Y_lnea~4 |
      |-------------------------------------------------------------------|
   1. | 2.4876594   2.7562568          1          0   .0014636   .0014636 |
   2. | 2.9735284   3.2244972          2          0   1.11e-15   1.11e-15 |
   3. | 2.7872793   2.8596608          3          0    .193083    .193083 |
   4. | 2.4471938   2.6126218          4          0   .1726729   .1726729 |
   5. |  3.102849   3.1409301          5          0   2.71e-16   2.71e-16 |
      |-------------------------------------------------------------------|
   6. | 2.5435758   2.7043045          6          0          0          0 |
   7. | 2.3374305   2.6561147          7          0   .4664083   .4664083 |
   8. | 2.6472164   2.7145307          8          0   1.59e-15   1.59e-15 |
      +-------------------------------------------------------------------+
(note: file out_26898/Y_lnearn_ps_nnls1_pooled_ia.dta not found)
file out_26898/Y_lnearn_ps_nnls1_pooled_ia.dta saved

pool-stacked weights across resamples for gender_r
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .24467819    .24467819
    logit            2            0            0
  lassocv            3    .15241597    .15241597
  ridgecv            4    .06301041    .06301041
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7    .28736841    .28736841
       rf            8    3.355e-16    3.355e-16
       rf            9    1.076e-17    1.076e-17
gradboost           10    2.360e-16    2.360e-16
gradboost           11    .23380398    .23380398
     nnet           12    4.050e-16    4.050e-16
     nnet           13    .01872305    .01872305

pool-stacked weights across resamples for lnearn
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .00146357    .00146357
      ols            2            0    1.107e-15    1.107e-15
  lassocv            3            0    .19308297    .19308297
  ridgecv            4            0    .17267294    .17267294
  lassocv            5            0    2.708e-16    2.708e-16
  ridgecv            6            0            0            0
       rf            7            0    .46640825    .46640825
       rf            8            0    1.590e-15    1.590e-15
       rf            9            0    2.343e-15    2.343e-15
gradboost           10            0    1.042e-15    1.042e-15
gradboost           11            0    .16637226    .16637226
     nnet           12            0    3.325e-15    3.325e-15
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1    .19947613    .19947613
  ridgecv            4            1    .09142381    .09142381
  lassocv            5            1    .10733458    .10733458
  ridgecv            6            1    .00428499    .00428499
       rf            7            1    .52725598    .52725598
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1    .05216646    .05216646
     nnet           12            1            0            0
     nnet           13            1    .01805804    .01805804

D_gender_r_ps[13,3]
               learner  mean_weight        rep_1
    logit            1    .24467819    .24467819
    logit            2            0            0
  lassocv            3    .15241597    .15241597
  ridgecv            4    .06301041    .06301041
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7    .28736841    .28736841
       rf            8    3.355e-16    3.355e-16
       rf            9    1.076e-17    1.076e-17
gradboost           10    2.360e-16    2.360e-16
gradboost           11    .23380398    .23380398
     nnet           12    4.050e-16    4.050e-16
     nnet           13    .01872305    .01872305

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .77026501          1   .2446782   .2446782 |
   2. | .34596208          2          0          0 |
   3. | .08640803          3    .152416    .152416 |
   4. | .21824536          4   .0630104   .0630104 |
   5. | .53414087          5          0          0 |
      |--------------------------------------------|
   6. | .85269388          6          0          0 |
   7. | .80971264          7   .2873684   .2873684 |
   8. | .84638175          8   3.36e-16   3.36e-16 |
      +--------------------------------------------+
(note: file out_26898/D_gender_r_ps_nnls1_pooled_ia.dta not found)
file out_26898/D_gender_r_ps_nnls1_pooled_ia.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.033    (0.054)
  ss  1  [shortstack]          [ss]          [ss]    -0.045    (0.053)
  ps  1   [poolstack]          [ps]          [ps]    -0.045    (0.053)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0448994   .0526566    -0.85   0.394    -.1481044    .0583057
------------------------------------------------------------------------------
Stacking final estimator: singlebest
Warning: 60 propensity scores trimmed to lower limit .01.
Warning: 11 propensity scores trimmed to upper limit .99.
Warning: . resamples had propensity scores trimmed to upper limit .99.



Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.033    (0.054)
  ss  1  [shortstack]          [ss]          [ss]    -0.045    (0.053)
  ps  1   [poolstack]          [ps]          [ps]    -0.045    (0.053)

Stacking DDML model (ATET)
E[y|X,D=0]   = Y1_pystacked0_1                     Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1
E[D|X]       = D1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0327143   .0535138    -0.61   0.541    -.1375995    .0721709
------------------------------------------------------------------------------
Stacking final estimator: singlebest
Warning: 67 propensity scores trimmed to lower limit .01.
Warning: 17 propensity scores trimmed to upper limit .99.
Warning: . resamples had propensity scores trimmed to upper limit .99.

file out_26898/results.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  ss  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.045    (0.053)
  ss  1  [shortstack]          [ss]          [ss]    -0.045    (0.053)
  ps  1   [poolstack]          [ps]          [ps]    -0.045    (0.053)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0448994   .0526566    -0.85   0.394    -.1481044    .0583057
------------------------------------------------------------------------------
Stacking final estimator: singlebest
Warning: 60 propensity scores trimmed to lower limit .01.
Warning: 11 propensity scores trimmed to upper limit .99.
Warning: . resamples had propensity scores trimmed to upper limit .99.

file out_26898/results.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  ps  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.045    (0.053)
  ss  1  [shortstack]          [ss]          [ss]    -0.045    (0.053)
  ps  1   [poolstack]          [ps]          [ps]    -0.045    (0.053)

Poolstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ps0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ps1
E[D|X]       = D_gender_r_ps_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0448994   .0526566    -0.85   0.394    -.1481044    .0583057
------------------------------------------------------------------------------
Stacking final estimator: singlebest
Warning: 60 propensity scores trimmed to lower limit .01.
Warning: 11 propensity scores trimmed to upper limit .99.
Warning: . resamples had propensity scores trimmed to upper limit .99.

file out_26898/results.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3           .9           .9
  ridgecv            4            0            0
  lassocv            5           .1           .1
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0           .1           .1
  ridgecv            4            0            0            0
  lassocv            5            0           .1           .1
  ridgecv            6            0            0            0
       rf            7            0           .8           .8
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3           .9           .9
  ridgecv            4            0            0
  lassocv            5           .1           .1
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0           .1           .1
  ridgecv            4            0            0            0
  lassocv            5            0           .1           .1
  ridgecv            6            0            0            0
       rf            7            0           .8           .8
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

Y1_pystacked_w_mn[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0           .1           .1
  ridgecv            4            0            0            0
  lassocv            5            0           .1           .1
  ridgecv            6            0            0            0
       rf            7            0           .8           .8
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

      +-------------------------------------------+
      | Y1_pys~1   Y1_pys~2   Y1_pys~3   Y1_pys~4 |
      |-------------------------------------------|
   1. |        1          0          0          0 |
   2. |        2          0          0          0 |
   3. |        3          0         .1         .1 |
   4. |        4          0          0          0 |
   5. |        5          0         .1         .1 |
      |-------------------------------------------|
   6. |        6          0          0          0 |
   7. |        7          0         .8         .8 |
   8. |        8          0          0          0 |
      +-------------------------------------------+
(note: file out_26898/Y1_pystacked_w_mn_singlebest_regular_ia.dta not found)
file out_26898/Y1_pystacked_w_mn_singlebest_regular_ia.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3           .9           .9
  ridgecv            4            0            0
  lassocv            5           .1           .1
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0           .1           .1
  ridgecv            4            0            0            0
  lassocv            5            0           .1           .1
  ridgecv            6            0            0            0
       rf            7            0           .8           .8
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

D1_pystacked_w_mn[13,3]
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3           .9           .9
  ridgecv            4            0            0
  lassocv            5           .1           .1
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

      +--------------------------------+
      | D1_pys~1   D1_pys~2   D1_pys~3 |
      |--------------------------------|
   1. |        1          0          0 |
   2. |        2          0          0 |
   3. |        3         .9         .9 |
   4. |        4          0          0 |
   5. |        5         .1         .1 |
      |--------------------------------|
   6. |        6          0          0 |
   7. |        7          0          0 |
   8. |        8          0          0 |
      +--------------------------------+
(note: file out_26898/D1_pystacked_w_mn_singlebest_regular_ia.dta not found)
file out_26898/D1_pystacked_w_mn_singlebest_regular_ia.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3            1            1
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

short-stacked weights across resamples for lnearn
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

short-stacked weights across resamples for gender_r
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3            1            1
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

short-stacked weights across resamples for lnearn
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

Y_lnearn_ss[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

      +-------------------------------------------------------------------+
      | Y_lne~1_1   Y_lne~0_1   Y_lne~s1   Y_lnea~2   Y_lnea~3   Y_lnea~4 |
      |-------------------------------------------------------------------|
   1. | 2.4409921   2.7980919          1          0          0          0 |
   2. | 2.9056861   3.1843088          2          0          0          0 |
   3. | 2.9033923   2.8787894          3          0          0          0 |
   4. |  2.482338   2.5922754          4          0          0          0 |
   5. | 3.1032491   3.1068552          5          0          0          0 |
      |-------------------------------------------------------------------|
   6. | 2.5047736   2.7146881          6          0          0          0 |
   7. | 2.4679549   2.7620749          7          0          1          1 |
   8. | 2.6358566   2.8030219          8          0          0          0 |
      +-------------------------------------------------------------------+
(note: file out_26898/Y_lnearn_ss_singlebest_short_ia.dta not found)
file out_26898/Y_lnearn_ss_singlebest_short_ia.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3            1            1
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

short-stacked weights across resamples for lnearn
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

D_gender_r_ss[13,3]
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3            1            1
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .77300316          1          0          0 |
   2. | .32058501          2          0          0 |
   3. | .08907966          3          1          1 |
   4. | .22110163          4          0          0 |
   5. | .57157534          5          0          0 |
      |--------------------------------------------|
   6. | .84313226          6          0          0 |
   7. | .78584564          7          0          0 |
   8. | .78886384          8          0          0 |
      +--------------------------------------------+
(note: file out_26898/D_gender_r_ss_singlebest_short_ia.dta not found)
file out_26898/D_gender_r_ss_singlebest_short_ia.dta saved

pool-stacked weights across resamples for gender_r
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3            1            1
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

pool-stacked weights across resamples for lnearn
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

pool-stacked weights across resamples for gender_r
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3            1            1
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

pool-stacked weights across resamples for lnearn
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

Y_lnearn_ps[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

      +-------------------------------------------------------------------+
      | Y_lne~1_1   Y_lne~0_1   Y_lne~s1   Y_lnea~2   Y_lnea~3   Y_lnea~4 |
      |-------------------------------------------------------------------|
   1. | 2.4409921   2.7980919          1          0          0          0 |
   2. | 2.9056861   3.1843088          2          0          0          0 |
   3. | 2.9033923   2.8787894          3          0          0          0 |
   4. |  2.482338   2.5922754          4          0          0          0 |
   5. | 3.1032491   3.1068552          5          0          0          0 |
      |-------------------------------------------------------------------|
   6. | 2.5047736   2.7146881          6          0          0          0 |
   7. | 2.4679549   2.7620749          7          0          1          1 |
   8. | 2.6358566   2.8030219          8          0          0          0 |
      +-------------------------------------------------------------------+
(note: file out_26898/Y_lnearn_ps_singlebest_pooled_ia.dta not found)
file out_26898/Y_lnearn_ps_singlebest_pooled_ia.dta saved

pool-stacked weights across resamples for gender_r
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3            1            1
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

pool-stacked weights across resamples for lnearn
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

D_gender_r_ps[13,3]
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3            1            1
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .77300316          1          0          0 |
   2. | .32058501          2          0          0 |
   3. | .08907966          3          1          1 |
   4. | .22110163          4          0          0 |
   5. | .57157534          5          0          0 |
      |--------------------------------------------|
   6. | .84313226          6          0          0 |
   7. | .78584564          7          0          0 |
   8. | .78886384          8          0          0 |
      +--------------------------------------------+
(note: file out_26898/D_gender_r_ps_singlebest_pooled_ia.dta not found)
file out_26898/D_gender_r_ps_singlebest_pooled_ia.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked     1.192    (0.145)
  ss  1  [shortstack]          [ss]          [ss]    -0.068    (0.088)
  ps  1   [poolstack]          [ps]          [ps]     0.106    (0.093)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0675172   .0880689    -0.77   0.443     -.240129    .1050946
------------------------------------------------------------------------------
Stacking final estimator: ols
Warning: 389 propensity scores trimmed to upper limit .99.
Warning: . resamples had propensity scores trimmed to upper limit .99.



Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked     1.192    (0.145)
  ss  1  [shortstack]          [ss]          [ss]    -0.068    (0.088)
  ps  1   [poolstack]          [ps]          [ps]     0.106    (0.093)

Stacking DDML model (ATET)
E[y|X,D=0]   = Y1_pystacked0_1                     Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1
E[D|X]       = D1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |    1.19152   .1450235     8.22   0.000     .9072788     1.47576
------------------------------------------------------------------------------
Stacking final estimator: ols
Warning: 2170 propensity scores trimmed to lower limit .01.
Warning: 159 propensity scores trimmed to upper limit .99.
Warning: . resamples had propensity scores trimmed to upper limit .99.

(note: variable final was str3, now str10 to accommodate using data's values)
file out_26898/results.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  ss  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.068    (0.088)
  ss  1  [shortstack]          [ss]          [ss]    -0.068    (0.088)
  ps  1   [poolstack]          [ps]          [ps]     0.106    (0.093)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0675172   .0880689    -0.77   0.443     -.240129    .1050946
------------------------------------------------------------------------------
Stacking final estimator: ols
Warning: 389 propensity scores trimmed to upper limit .99.
Warning: . resamples had propensity scores trimmed to upper limit .99.

(note: variable final was str3, now str10 to accommodate using data's values)
file out_26898/results.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  ps  1  Y1_pystacked  Y1_pystacked  D1_pystacked     0.106    (0.093)
  ss  1  [shortstack]          [ss]          [ss]    -0.068    (0.088)
  ps  1   [poolstack]          [ps]          [ps]     0.106    (0.093)

Poolstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ps0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ps1
E[D|X]       = D_gender_r_ps_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |   .1064335   .0926717     1.15   0.251    -.0751997    .2880668
------------------------------------------------------------------------------
Stacking final estimator: ols
Warning: 14 propensity scores trimmed to lower limit .01.
Warning: 241 propensity scores trimmed to upper limit .99.
Warning: . resamples had propensity scores trimmed to upper limit .99.

(note: variable final was str3, now str10 to accommodate using data's values)
file out_26898/results.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .18393947    .18393947
    logit            2    .08566161    .08566161
  lassocv            3    .39783283    .39783283
  ridgecv            4    .09497771    .09497771
  lassocv            5   -.20284385   -.20284385
  ridgecv            6   -.01167815   -.01167815
       rf            7    .42450884    .42450884
       rf            8    .09350667    .09350667
       rf            9   -.23819724   -.23819724
gradboost           10    .05089377    .05089377
gradboost           11     .1673316     .1673316
     nnet           12   -3.3426692   -3.3426692
     nnet           13    .02392698    .02392698

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .01588512    .01588512
      ols            2            0   -.03854544   -.03854544
  lassocv            3            0    .03092122    .03092122
  ridgecv            4            0    .50789971    .50789971
  lassocv            5            0   -.04841109   -.04841109
  ridgecv            6            0   -.06089615   -.06089615
       rf            7            0    .71211963    .71211963
       rf            8            0   -.10474732   -.10474732
       rf            9            0   -.03785684   -.03785684
gradboost           10            0    .03174321    .03174321
gradboost           11            0    .07299202    .07299202
     nnet           12            0   -.72661824   -.72661824
     nnet           13            0   -.00772818   -.00772818
      ols            1            1    .00751356    .00751356
      ols            2            1   -.02148147   -.02148147
  lassocv            3            1   -.12487337   -.12487337
  ridgecv            4            1    .37447511    .37447511
  lassocv            5            1    .33560127    .33560127
  ridgecv            6            1   -.11470269   -.11470269
       rf            7            1    .53125983    .53125983
       rf            8            1    .35572304    .35572304
       rf            9            1   -.26007195   -.26007195
gradboost           10            1   -.02779997   -.02779997
gradboost           11            1    .01762636    .01762636
     nnet           12            1   -.00304549   -.00304549
     nnet           13            1    .00444707    .00444707

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .18393947    .18393947
    logit            2    .08566161    .08566161
  lassocv            3    .39783283    .39783283
  ridgecv            4    .09497771    .09497771
  lassocv            5   -.20284385   -.20284385
  ridgecv            6   -.01167815   -.01167815
       rf            7    .42450884    .42450884
       rf            8    .09350667    .09350667
       rf            9   -.23819724   -.23819724
gradboost           10    .05089377    .05089377
gradboost           11     .1673316     .1673316
     nnet           12   -3.3426692   -3.3426692
     nnet           13    .02392698    .02392698

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .01588512    .01588512
      ols            2            0   -.03854544   -.03854544
  lassocv            3            0    .03092122    .03092122
  ridgecv            4            0    .50789971    .50789971
  lassocv            5            0   -.04841109   -.04841109
  ridgecv            6            0   -.06089615   -.06089615
       rf            7            0    .71211963    .71211963
       rf            8            0   -.10474732   -.10474732
       rf            9            0   -.03785684   -.03785684
gradboost           10            0    .03174321    .03174321
gradboost           11            0    .07299202    .07299202
     nnet           12            0   -.72661824   -.72661824
     nnet           13            0   -.00772818   -.00772818
      ols            1            1    .00751356    .00751356
      ols            2            1   -.02148147   -.02148147
  lassocv            3            1   -.12487337   -.12487337
  ridgecv            4            1    .37447511    .37447511
  lassocv            5            1    .33560127    .33560127
  ridgecv            6            1   -.11470269   -.11470269
       rf            7            1    .53125983    .53125983
       rf            8            1    .35572304    .35572304
       rf            9            1   -.26007195   -.26007195
gradboost           10            1   -.02779997   -.02779997
gradboost           11            1    .01762636    .01762636
     nnet           12            1   -.00304549   -.00304549
     nnet           13            1    .00444707    .00444707

Y1_pystacked_w_mn[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .01588512    .01588512
      ols            2            0   -.03854544   -.03854544
  lassocv            3            0    .03092122    .03092122
  ridgecv            4            0    .50789971    .50789971
  lassocv            5            0   -.04841109   -.04841109
  ridgecv            6            0   -.06089615   -.06089615
       rf            7            0    .71211963    .71211963
       rf            8            0   -.10474732   -.10474732
       rf            9            0   -.03785684   -.03785684
gradboost           10            0    .03174321    .03174321
gradboost           11            0    .07299202    .07299202
     nnet           12            0   -.72661824   -.72661824
     nnet           13            0   -.00772818   -.00772818
      ols            1            1    .00751356    .00751356
      ols            2            1   -.02148147   -.02148147
  lassocv            3            1   -.12487337   -.12487337
  ridgecv            4            1    .37447511    .37447511
  lassocv            5            1    .33560127    .33560127
  ridgecv            6            1   -.11470269   -.11470269
       rf            7            1    .53125983    .53125983
       rf            8            1    .35572304    .35572304
       rf            9            1   -.26007195   -.26007195
gradboost           10            1   -.02779997   -.02779997
gradboost           11            1    .01762636    .01762636
     nnet           12            1   -.00304549   -.00304549
     nnet           13            1    .00444707    .00444707

      +---------------------------------------------+
      | Y1_pys~1   Y1_pys~2   Y1_pyst~3   Y1_pyst~4 |
      |---------------------------------------------|
   1. |        1          0    .0158851    .0158851 |
   2. |        2          0   -.0385454   -.0385454 |
   3. |        3          0    .0309212    .0309212 |
   4. |        4          0    .5078997    .5078997 |
   5. |        5          0   -.0484111   -.0484111 |
      |---------------------------------------------|
   6. |        6          0   -.0608961   -.0608961 |
   7. |        7          0    .7121196    .7121196 |
   8. |        8          0   -.1047473   -.1047473 |
      +---------------------------------------------+
(note: file out_26898/Y1_pystacked_w_mn_ols_regular_ia.dta not found)
file out_26898/Y1_pystacked_w_mn_ols_regular_ia.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .18393947    .18393947
    logit            2    .08566161    .08566161
  lassocv            3    .39783283    .39783283
  ridgecv            4    .09497771    .09497771
  lassocv            5   -.20284385   -.20284385
  ridgecv            6   -.01167815   -.01167815
       rf            7    .42450884    .42450884
       rf            8    .09350667    .09350667
       rf            9   -.23819724   -.23819724
gradboost           10    .05089377    .05089377
gradboost           11     .1673316     .1673316
     nnet           12   -3.3426692   -3.3426692
     nnet           13    .02392698    .02392698

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .01588512    .01588512
      ols            2            0   -.03854544   -.03854544
  lassocv            3            0    .03092122    .03092122
  ridgecv            4            0    .50789971    .50789971
  lassocv            5            0   -.04841109   -.04841109
  ridgecv            6            0   -.06089615   -.06089615
       rf            7            0    .71211963    .71211963
       rf            8            0   -.10474732   -.10474732
       rf            9            0   -.03785684   -.03785684
gradboost           10            0    .03174321    .03174321
gradboost           11            0    .07299202    .07299202
     nnet           12            0   -.72661824   -.72661824
     nnet           13            0   -.00772818   -.00772818
      ols            1            1    .00751356    .00751356
      ols            2            1   -.02148147   -.02148147
  lassocv            3            1   -.12487337   -.12487337
  ridgecv            4            1    .37447511    .37447511
  lassocv            5            1    .33560127    .33560127
  ridgecv            6            1   -.11470269   -.11470269
       rf            7            1    .53125983    .53125983
       rf            8            1    .35572304    .35572304
       rf            9            1   -.26007195   -.26007195
gradboost           10            1   -.02779997   -.02779997
gradboost           11            1    .01762636    .01762636
     nnet           12            1   -.00304549   -.00304549
     nnet           13            1    .00444707    .00444707

D1_pystacked_w_mn[13,3]
               learner  mean_weight        rep_1
    logit            1    .18393947    .18393947
    logit            2    .08566161    .08566161
  lassocv            3    .39783283    .39783283
  ridgecv            4    .09497771    .09497771
  lassocv            5   -.20284385   -.20284385
  ridgecv            6   -.01167815   -.01167815
       rf            7    .42450884    .42450884
       rf            8    .09350667    .09350667
       rf            9   -.23819724   -.23819724
gradboost           10    .05089377    .05089377
gradboost           11     .1673316     .1673316
     nnet           12   -3.3426692   -3.3426692
     nnet           13    .02392698    .02392698

      +----------------------------------+
      | D1_pys~1   D1_pyst~2   D1_pyst~3 |
      |----------------------------------|
   1. |        1    .1839395    .1839395 |
   2. |        2    .0856616    .0856616 |
   3. |        3    .3978328    .3978328 |
   4. |        4    .0949777    .0949777 |
   5. |        5   -.2028439   -.2028439 |
      |----------------------------------|
   6. |        6   -.0116781   -.0116781 |
   7. |        7    .4245088    .4245088 |
   8. |        8    .0935067    .0935067 |
      +----------------------------------+
(note: file out_26898/D1_pystacked_w_mn_ols_regular_ia.dta not found)
file out_26898/D1_pystacked_w_mn_ols_regular_ia.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .20188673    .20188673
    logit            2    .06775321    .06775321
  lassocv            3   -.00293093   -.00293093
  ridgecv            4    .09460893    .09460893
  lassocv            5    .00016313    .00016313
  ridgecv            6    .16922915    .16922915
       rf            7    .43185899    .43185899
       rf            8   -.02970037   -.02970037
       rf            9   -.11167107   -.11167107
gradboost           10    .01241612    .01241612
gradboost           11    .25865654    .25865654
     nnet           12     .0330841     .0330841
     nnet           13   -.02435895   -.02435895

short-stacked weights across resamples for lnearn
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .06734279    .06734279
      ols            2            0   -.08494085   -.08494085
  lassocv            3            0   -.05536104   -.05536104
  ridgecv            4            0    .65749134    .65749134
  lassocv            5            0   -.06865155   -.06865155
  ridgecv            6            0   -.18130243   -.18130243
       rf            7            0    .68543416    .68543416
       rf            8            0    .66014202    .66014202
       rf            9            0    -.8451638    -.8451638
gradboost           10            0    .02353518    .02353518
gradboost           11            0    .12303222    .12303222
     nnet           12            0    .00509104    .00509104
     nnet           13            0    -.0210854    -.0210854
      ols            1            1   -.02523294   -.02523294
      ols            2            1    .04046108    .04046108
  lassocv            3            1   -.08274311   -.08274311
  ridgecv            4            1    .25794249    .25794249
  lassocv            5            1    .39928994    .39928994
  ridgecv            6            1   -.02037349   -.02037349
       rf            7            1    .56787869    .56787869
       rf            8            1    .50591953    .50591953
       rf            9            1   -.60335712   -.60335712
gradboost           10            1    .03719911    .03719911
gradboost           11            1    -.0050251    -.0050251
     nnet           12            1    .09118469    .09118469
     nnet           13            1   -.05578651   -.05578651

short-stacked weights across resamples for gender_r
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .20188673    .20188673
    logit            2    .06775321    .06775321
  lassocv            3   -.00293093   -.00293093
  ridgecv            4    .09460893    .09460893
  lassocv            5    .00016313    .00016313
  ridgecv            6    .16922915    .16922915
       rf            7    .43185899    .43185899
       rf            8   -.02970037   -.02970037
       rf            9   -.11167107   -.11167107
gradboost           10    .01241612    .01241612
gradboost           11    .25865654    .25865654
     nnet           12     .0330841     .0330841
     nnet           13   -.02435895   -.02435895

short-stacked weights across resamples for lnearn
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .06734279    .06734279
      ols            2            0   -.08494085   -.08494085
  lassocv            3            0   -.05536104   -.05536104
  ridgecv            4            0    .65749134    .65749134
  lassocv            5            0   -.06865155   -.06865155
  ridgecv            6            0   -.18130243   -.18130243
       rf            7            0    .68543416    .68543416
       rf            8            0    .66014202    .66014202
       rf            9            0    -.8451638    -.8451638
gradboost           10            0    .02353518    .02353518
gradboost           11            0    .12303222    .12303222
     nnet           12            0    .00509104    .00509104
     nnet           13            0    -.0210854    -.0210854
      ols            1            1   -.02523294   -.02523294
      ols            2            1    .04046108    .04046108
  lassocv            3            1   -.08274311   -.08274311
  ridgecv            4            1    .25794249    .25794249
  lassocv            5            1    .39928994    .39928994
  ridgecv            6            1   -.02037349   -.02037349
       rf            7            1    .56787869    .56787869
       rf            8            1    .50591953    .50591953
       rf            9            1   -.60335712   -.60335712
gradboost           10            1    .03719911    .03719911
gradboost           11            1    -.0050251    -.0050251
     nnet           12            1    .09118469    .09118469
     nnet           13            1   -.05578651   -.05578651

Y_lnearn_ss[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .06734279    .06734279
      ols            2            0   -.08494085   -.08494085
  lassocv            3            0   -.05536104   -.05536104
  ridgecv            4            0    .65749134    .65749134
  lassocv            5            0   -.06865155   -.06865155
  ridgecv            6            0   -.18130243   -.18130243
       rf            7            0    .68543416    .68543416
       rf            8            0    .66014202    .66014202
       rf            9            0    -.8451638    -.8451638
gradboost           10            0    .02353518    .02353518
gradboost           11            0    .12303222    .12303222
     nnet           12            0    .00509104    .00509104
     nnet           13            0    -.0210854    -.0210854
      ols            1            1   -.02523294   -.02523294
      ols            2            1    .04046108    .04046108
  lassocv            3            1   -.08274311   -.08274311
  ridgecv            4            1    .25794249    .25794249
  lassocv            5            1    .39928994    .39928994
  ridgecv            6            1   -.02037349   -.02037349
       rf            7            1    .56787869    .56787869
       rf            8            1    .50591953    .50591953
       rf            9            1   -.60335712   -.60335712
gradboost           10            1    .03719911    .03719911
gradboost           11            1    -.0050251    -.0050251
     nnet           12            1    .09118469    .09118469
     nnet           13            1   -.05578651   -.05578651

      +---------------------------------------------------------------------+
      | Y_lne~1_1   Y_lne~0_1   Y_lne~s1   Y_lnea~2   Y_lnear~3   Y_lnear~4 |
      |---------------------------------------------------------------------|
   1. |  2.749032   2.6351244          1          0    .0673428    .0673428 |
   2. | 3.2626322   3.1511126          2          0   -.0849408   -.0849408 |
   3. |  3.117952   2.7829205          3          0    -.055361    -.055361 |
   4. | 2.7628777   2.4986248          4          0    .6574913    .6574913 |
   5. | 3.5111754   3.0528633          5          0   -.0686515   -.0686515 |
      |---------------------------------------------------------------------|
   6. | 2.8399871   2.6001706          6          0   -.1813024   -.1813024 |
   7. | 2.6448765   2.4933883          7          0    .6854342    .6854342 |
   8. | 3.0055557   2.5444965          8          0     .660142     .660142 |
      +---------------------------------------------------------------------+
(note: file out_26898/Y_lnearn_ss_ols_short_ia.dta not found)
file out_26898/Y_lnearn_ss_ols_short_ia.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .20188673    .20188673
    logit            2    .06775321    .06775321
  lassocv            3   -.00293093   -.00293093
  ridgecv            4    .09460893    .09460893
  lassocv            5    .00016313    .00016313
  ridgecv            6    .16922915    .16922915
       rf            7    .43185899    .43185899
       rf            8   -.02970037   -.02970037
       rf            9   -.11167107   -.11167107
gradboost           10    .01241612    .01241612
gradboost           11    .25865654    .25865654
     nnet           12     .0330841     .0330841
     nnet           13   -.02435895   -.02435895

short-stacked weights across resamples for lnearn
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .06734279    .06734279
      ols            2            0   -.08494085   -.08494085
  lassocv            3            0   -.05536104   -.05536104
  ridgecv            4            0    .65749134    .65749134
  lassocv            5            0   -.06865155   -.06865155
  ridgecv            6            0   -.18130243   -.18130243
       rf            7            0    .68543416    .68543416
       rf            8            0    .66014202    .66014202
       rf            9            0    -.8451638    -.8451638
gradboost           10            0    .02353518    .02353518
gradboost           11            0    .12303222    .12303222
     nnet           12            0    .00509104    .00509104
     nnet           13            0    -.0210854    -.0210854
      ols            1            1   -.02523294   -.02523294
      ols            2            1    .04046108    .04046108
  lassocv            3            1   -.08274311   -.08274311
  ridgecv            4            1    .25794249    .25794249
  lassocv            5            1    .39928994    .39928994
  ridgecv            6            1   -.02037349   -.02037349
       rf            7            1    .56787869    .56787869
       rf            8            1    .50591953    .50591953
       rf            9            1   -.60335712   -.60335712
gradboost           10            1    .03719911    .03719911
gradboost           11            1    -.0050251    -.0050251
     nnet           12            1    .09118469    .09118469
     nnet           13            1   -.05578651   -.05578651

D_gender_r_ss[13,3]
               learner  mean_weight        rep_1
    logit            1    .20188673    .20188673
    logit            2    .06775321    .06775321
  lassocv            3   -.00293093   -.00293093
  ridgecv            4    .09460893    .09460893
  lassocv            5    .00016313    .00016313
  ridgecv            6    .16922915    .16922915
       rf            7    .43185899    .43185899
       rf            8   -.02970037   -.02970037
       rf            9   -.11167107   -.11167107
gradboost           10    .01241612    .01241612
gradboost           11    .25865654    .25865654
     nnet           12     .0330841     .0330841
     nnet           13   -.02435895   -.02435895

      +----------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gende~2   D_gende~3 |
      |----------------------------------------------|
   1. | .83900226          1    .2018867    .2018867 |
   2. |  .3955165          2    .0677532    .0677532 |
   3. | .10590541          3   -.0029309   -.0029309 |
   4. | .24695794          4    .0946089    .0946089 |
   5. | .57867823          5    .0001631    .0001631 |
      |----------------------------------------------|
   6. | .93250185          6    .1692291    .1692291 |
   7. | .87944867          7     .431859     .431859 |
   8. |  .9119612          8   -.0297004   -.0297004 |
      +----------------------------------------------+
(note: file out_26898/D_gender_r_ss_ols_short_ia.dta not found)
file out_26898/D_gender_r_ss_ols_short_ia.dta saved

pool-stacked weights across resamples for gender_r
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .18922988    .18922988
    logit            2    .08942591    .08942591
  lassocv            3    .24735393    .24735393
  ridgecv            4    .09353779    .09353779
  lassocv            5   -.05241582   -.05241582
  ridgecv            6   -.01111051   -.01111051
       rf            7     .4273264     .4273264
       rf            8    .09027522    .09027522
       rf            9   -.23926817   -.23926817
gradboost           10    .05023305    .05023305
gradboost           11    .16703716    .16703716
     nnet           12   -.00332062   -.00332062
     nnet           13    .02424695    .02424695

pool-stacked weights across resamples for lnearn
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0   -.00228551   -.00228551
      ols            2            0   -.04356065   -.04356065
  lassocv            3            0    .10057309    .10057309
  ridgecv            4            0     .4252168     .4252168
  lassocv            5            0   -.07930718   -.07930718
  ridgecv            6            0   -.01776591   -.01776591
       rf            7            0    .73463963    .73463963
       rf            8            0   -.04597137   -.04597137
       rf            9            0   -.11656951   -.11656951
gradboost           10            0    .02324998    .02324998
gradboost           11            0    .08175522    .08175522
     nnet           12            0   -.00305448   -.00305448
     nnet           13            0   -.00651478   -.00651478
      ols            1            1   -.01452571   -.01452571
      ols            2            1   -.01443305   -.01443305
  lassocv            3            1    .01325555    .01325555
  ridgecv            4            1    .35666903    .35666903
  lassocv            5            1    .16939312    .16939312
  ridgecv            6            1   -.07065107   -.07065107
       rf            7            1    .54074952    .54074952
       rf            8            1    .37405915    .37405915
       rf            9            1   -.28670808   -.28670808
gradboost           10            1   -.01316308   -.01316308
gradboost           11            1    .02005848    .02005848
     nnet           12            1    .02885171    .02885171
     nnet           13            1    .01137091    .01137091

pool-stacked weights across resamples for gender_r
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .18922988    .18922988
    logit            2    .08942591    .08942591
  lassocv            3    .24735393    .24735393
  ridgecv            4    .09353779    .09353779
  lassocv            5   -.05241582   -.05241582
  ridgecv            6   -.01111051   -.01111051
       rf            7     .4273264     .4273264
       rf            8    .09027522    .09027522
       rf            9   -.23926817   -.23926817
gradboost           10    .05023305    .05023305
gradboost           11    .16703716    .16703716
     nnet           12   -.00332062   -.00332062
     nnet           13    .02424695    .02424695

pool-stacked weights across resamples for lnearn
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0   -.00228551   -.00228551
      ols            2            0   -.04356065   -.04356065
  lassocv            3            0    .10057309    .10057309
  ridgecv            4            0     .4252168     .4252168
  lassocv            5            0   -.07930718   -.07930718
  ridgecv            6            0   -.01776591   -.01776591
       rf            7            0    .73463963    .73463963
       rf            8            0   -.04597137   -.04597137
       rf            9            0   -.11656951   -.11656951
gradboost           10            0    .02324998    .02324998
gradboost           11            0    .08175522    .08175522
     nnet           12            0   -.00305448   -.00305448
     nnet           13            0   -.00651478   -.00651478
      ols            1            1   -.01452571   -.01452571
      ols            2            1   -.01443305   -.01443305
  lassocv            3            1    .01325555    .01325555
  ridgecv            4            1    .35666903    .35666903
  lassocv            5            1    .16939312    .16939312
  ridgecv            6            1   -.07065107   -.07065107
       rf            7            1    .54074952    .54074952
       rf            8            1    .37405915    .37405915
       rf            9            1   -.28670808   -.28670808
gradboost           10            1   -.01316308   -.01316308
gradboost           11            1    .02005848    .02005848
     nnet           12            1    .02885171    .02885171
     nnet           13            1    .01137091    .01137091

Y_lnearn_ps[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0   -.00228551   -.00228551
      ols            2            0   -.04356065   -.04356065
  lassocv            3            0    .10057309    .10057309
  ridgecv            4            0     .4252168     .4252168
  lassocv            5            0   -.07930718   -.07930718
  ridgecv            6            0   -.01776591   -.01776591
       rf            7            0    .73463963    .73463963
       rf            8            0   -.04597137   -.04597137
       rf            9            0   -.11656951   -.11656951
gradboost           10            0    .02324998    .02324998
gradboost           11            0    .08175522    .08175522
     nnet           12            0   -.00305448   -.00305448
     nnet           13            0   -.00651478   -.00651478
      ols            1            1   -.01452571   -.01452571
      ols            2            1   -.01443305   -.01443305
  lassocv            3            1    .01325555    .01325555
  ridgecv            4            1    .35666903    .35666903
  lassocv            5            1    .16939312    .16939312
  ridgecv            6            1   -.07065107   -.07065107
       rf            7            1    .54074952    .54074952
       rf            8            1    .37405915    .37405915
       rf            9            1   -.28670808   -.28670808
gradboost           10            1   -.01316308   -.01316308
gradboost           11            1    .02005848    .02005848
     nnet           12            1    .02885171    .02885171
     nnet           13            1    .01137091    .01137091

      +---------------------------------------------------------------------+
      | Y_lne~1_1   Y_lne~0_1   Y_lne~s1   Y_lnea~2   Y_lnear~3   Y_lnear~4 |
      |---------------------------------------------------------------------|
   1. | 2.7771062   2.8866571          1          0   -.0022855   -.0022855 |
   2. |  3.278159   3.3695524          2          0   -.0435607   -.0435607 |
   3. | 3.1009043   3.0089323          3          0    .1005731    .1005731 |
   4. | 2.7449774   2.7151901          4          0    .4252168    .4252168 |
   5. | 3.4711962   3.2804275          5          0   -.0793072   -.0793072 |
      |---------------------------------------------------------------------|
   6. | 2.8526878   2.8261049          6          0   -.0177659   -.0177659 |
   7. | 2.6028561   2.7998522          7          0    .7346396    .7346396 |
   8. | 2.9635064   2.8400958          8          0   -.0459714   -.0459714 |
      +---------------------------------------------------------------------+
(note: file out_26898/Y_lnearn_ps_ols_pooled_ia.dta not found)
file out_26898/Y_lnearn_ps_ols_pooled_ia.dta saved

pool-stacked weights across resamples for gender_r
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .18922988    .18922988
    logit            2    .08942591    .08942591
  lassocv            3    .24735393    .24735393
  ridgecv            4    .09353779    .09353779
  lassocv            5   -.05241582   -.05241582
  ridgecv            6   -.01111051   -.01111051
       rf            7     .4273264     .4273264
       rf            8    .09027522    .09027522
       rf            9   -.23926817   -.23926817
gradboost           10    .05023305    .05023305
gradboost           11    .16703716    .16703716
     nnet           12   -.00332062   -.00332062
     nnet           13    .02424695    .02424695

pool-stacked weights across resamples for lnearn
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0   -.00228551   -.00228551
      ols            2            0   -.04356065   -.04356065
  lassocv            3            0    .10057309    .10057309
  ridgecv            4            0     .4252168     .4252168
  lassocv            5            0   -.07930718   -.07930718
  ridgecv            6            0   -.01776591   -.01776591
       rf            7            0    .73463963    .73463963
       rf            8            0   -.04597137   -.04597137
       rf            9            0   -.11656951   -.11656951
gradboost           10            0    .02324998    .02324998
gradboost           11            0    .08175522    .08175522
     nnet           12            0   -.00305448   -.00305448
     nnet           13            0   -.00651478   -.00651478
      ols            1            1   -.01452571   -.01452571
      ols            2            1   -.01443305   -.01443305
  lassocv            3            1    .01325555    .01325555
  ridgecv            4            1    .35666903    .35666903
  lassocv            5            1    .16939312    .16939312
  ridgecv            6            1   -.07065107   -.07065107
       rf            7            1    .54074952    .54074952
       rf            8            1    .37405915    .37405915
       rf            9            1   -.28670808   -.28670808
gradboost           10            1   -.01316308   -.01316308
gradboost           11            1    .02005848    .02005848
     nnet           12            1    .02885171    .02885171
     nnet           13            1    .01137091    .01137091

D_gender_r_ps[13,3]
               learner  mean_weight        rep_1
    logit            1    .18922988    .18922988
    logit            2    .08942591    .08942591
  lassocv            3    .24735393    .24735393
  ridgecv            4    .09353779    .09353779
  lassocv            5   -.05241582   -.05241582
  ridgecv            6   -.01111051   -.01111051
       rf            7     .4273264     .4273264
       rf            8    .09027522    .09027522
       rf            9   -.23926817   -.23926817
gradboost           10    .05023305    .05023305
gradboost           11    .16703716    .16703716
     nnet           12   -.00332062   -.00332062
     nnet           13    .02424695    .02424695

      +----------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gende~2   D_gende~3 |
      |----------------------------------------------|
   1. | .81033503          1    .1892299    .1892299 |
   2. | .38196974          2    .0894259    .0894259 |
   3. | .09421093          3    .2473539    .2473539 |
   4. | .21690861          4    .0935378    .0935378 |
   5. | .56238892          5   -.0524158   -.0524158 |
      |----------------------------------------------|
   6. | .92314275          6   -.0111105   -.0111105 |
   7. | .86990663          7    .4273264    .4273264 |
   8. | .89256696          8    .0902752    .0902752 |
      +----------------------------------------------+
(note: file out_26898/D_gender_r_ps_ols_pooled_ia.dta not found)
file out_26898/D_gender_r_ps_ols_pooled_ia.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.100    (0.017)
  ss  1  [shortstack]          [ss]          [ss]    -0.100    (0.017)
  ps  1   [poolstack]          [ps]          [ps]    -0.100    (0.017)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |   -.099919   .0166897    -5.99   0.000    -.1326302   -.0672078
------------------------------------------------------------------------------
Stacking final estimator: avg



Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.100    (0.017)
  ss  1  [shortstack]          [ss]          [ss]    -0.100    (0.017)
  ps  1   [poolstack]          [ps]          [ps]    -0.100    (0.017)

Stacking DDML model (ATET)
E[y|X,D=0]   = Y1_pystacked0_1                     Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1
E[D|X]       = D1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |   -.099919   .0166897    -5.99   0.000    -.1326302   -.0672078
------------------------------------------------------------------------------
Stacking final estimator: avg

(note: variable final was str3, now str10 to accommodate using data's values)
file out_26898/results.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  ss  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.100    (0.017)
  ss  1  [shortstack]          [ss]          [ss]    -0.100    (0.017)
  ps  1   [poolstack]          [ps]          [ps]    -0.100    (0.017)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |   -.099919   .0166897    -5.99   0.000    -.1326302   -.0672078
------------------------------------------------------------------------------
Stacking final estimator: avg

(note: variable final was str3, now str10 to accommodate using data's values)
file out_26898/results.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  ps  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.100    (0.017)
  ss  1  [shortstack]          [ss]          [ss]    -0.100    (0.017)
  ps  1   [poolstack]          [ps]          [ps]    -0.100    (0.017)

Poolstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ps0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ps1
E[D|X]       = D_gender_r_ps_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |   -.099919   .0166897    -5.99   0.000    -.1326302   -.0672078
------------------------------------------------------------------------------
Stacking final estimator: avg

(note: variable final was str3, now str10 to accommodate using data's values)
file out_26898/results.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

Y1_pystacked_w_mn[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

      +-------------------------------------------+
      | Y1_pys~1   Y1_pys~2   Y1_pys~3   Y1_pys~4 |
      |-------------------------------------------|
   1. |        1          0   .0769231   .0769231 |
   2. |        2          0   .0769231   .0769231 |
   3. |        3          0   .0769231   .0769231 |
   4. |        4          0   .0769231   .0769231 |
   5. |        5          0   .0769231   .0769231 |
      |-------------------------------------------|
   6. |        6          0   .0769231   .0769231 |
   7. |        7          0   .0769231   .0769231 |
   8. |        8          0   .0769231   .0769231 |
      +-------------------------------------------+
(note: file out_26898/Y1_pystacked_w_mn_avg_regular_ia.dta not found)
file out_26898/Y1_pystacked_w_mn_avg_regular_ia.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

D1_pystacked_w_mn[13,3]
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

      +--------------------------------+
      | D1_pys~1   D1_pys~2   D1_pys~3 |
      |--------------------------------|
   1. |        1   .0769231   .0769231 |
   2. |        2   .0769231   .0769231 |
   3. |        3   .0769231   .0769231 |
   4. |        4   .0769231   .0769231 |
   5. |        5   .0769231   .0769231 |
      |--------------------------------|
   6. |        6   .0769231   .0769231 |
   7. |        7   .0769231   .0769231 |
   8. |        8   .0769231   .0769231 |
      +--------------------------------+
(note: file out_26898/D1_pystacked_w_mn_avg_regular_ia.dta not found)
file out_26898/D1_pystacked_w_mn_avg_regular_ia.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

short-stacked weights across resamples for lnearn
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

short-stacked weights across resamples for gender_r
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

short-stacked weights across resamples for lnearn
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

Y_lnearn_ss[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

      +-------------------------------------------------------------------+
      | Y_lne~1_1   Y_lne~0_1   Y_lne~s1   Y_lnea~2   Y_lnea~3   Y_lnea~4 |
      |-------------------------------------------------------------------|
   1. | 2.5731106   2.7595761          1          0   .0769231   .0769231 |
   2. |  3.012021   3.1914993          2          0   .0769231   .0769231 |
   3. | 2.6852914    2.837247          3          0   .0769231   .0769231 |
   4. | 2.4441258   2.5284696          4          0   .0769231   .0769231 |
   5. | 2.9944128   3.1345809          5          0   .0769231   .0769231 |
      |-------------------------------------------------------------------|
   6. | 2.5862697   2.6582468          6          0   .0769231   .0769231 |
   7. | 2.3785512   2.6912907          7          0   .0769231   .0769231 |
   8. | 2.6880416   2.8235203          8          0   .0769231   .0769231 |
      +-------------------------------------------------------------------+
(note: file out_26898/Y_lnearn_ss_avg_short_ia.dta not found)
file out_26898/Y_lnearn_ss_avg_short_ia.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

short-stacked weights across resamples for lnearn
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

D_gender_r_ss[13,3]
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .77775711          1   .0769231   .0769231 |
   2. | .38290175          2   .0769231   .0769231 |
   3. | .16050938          3   .0769231   .0769231 |
   4. | .34633803          4   .0769231   .0769231 |
   5. | .54921343          5   .0769231   .0769231 |
      |--------------------------------------------|
   6. | .80473792          6   .0769231   .0769231 |
   7. | .77570862          7   .0769231   .0769231 |
   8. | .78489701          8   .0769231   .0769231 |
      +--------------------------------------------+
(note: file out_26898/D_gender_r_ss_avg_short_ia.dta not found)
file out_26898/D_gender_r_ss_avg_short_ia.dta saved

pool-stacked weights across resamples for gender_r
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

pool-stacked weights across resamples for lnearn
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

pool-stacked weights across resamples for gender_r
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

pool-stacked weights across resamples for lnearn
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

Y_lnearn_ps[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

      +-------------------------------------------------------------------+
      | Y_lne~1_1   Y_lne~0_1   Y_lne~s1   Y_lnea~2   Y_lnea~3   Y_lnea~4 |
      |-------------------------------------------------------------------|
   1. | 2.5731106   2.7595761          1          0   .0769231   .0769231 |
   2. |  3.012021   3.1914993          2          0   .0769231   .0769231 |
   3. | 2.6852914    2.837247          3          0   .0769231   .0769231 |
   4. | 2.4441258   2.5284696          4          0   .0769231   .0769231 |
   5. | 2.9944128   3.1345809          5          0   .0769231   .0769231 |
      |-------------------------------------------------------------------|
   6. | 2.5862697   2.6582468          6          0   .0769231   .0769231 |
   7. | 2.3785512   2.6912907          7          0   .0769231   .0769231 |
   8. | 2.6880416   2.8235203          8          0   .0769231   .0769231 |
      +-------------------------------------------------------------------+
(note: file out_26898/Y_lnearn_ps_avg_pooled_ia.dta not found)
file out_26898/Y_lnearn_ps_avg_pooled_ia.dta saved

pool-stacked weights across resamples for gender_r
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

pool-stacked weights across resamples for lnearn
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

D_gender_r_ps[13,3]
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .77775711          1   .0769231   .0769231 |
   2. | .38290175          2   .0769231   .0769231 |
   3. | .16050938          3   .0769231   .0769231 |
   4. | .34633803          4   .0769231   .0769231 |
   5. | .54921343          5   .0769231   .0769231 |
      |--------------------------------------------|
   6. | .80473792          6   .0769231   .0769231 |
   7. | .77570862          7   .0769231   .0769231 |
   8. | .78489701          8   .0769231   .0769231 |
      +--------------------------------------------+
(note: file out_26898/D_gender_r_ps_avg_pooled_ia.dta not found)
file out_26898/D_gender_r_ps_avg_pooled_ia.dta saved
. 
.         forvalues i = 1(1)$L {
  2.                         ddml estimate, y1(Y1_pystacked1_L`i'_1) y0(Y1_pyst
> acked0_L`i'_1) ///
>                                                         d(D1_pystacked_L`i'_1
> ) robust atet foldvar(m0_sample_1  )
  3.                         regsave gender_r using `folder'/results.dta, ci //
> /
>                                                 addlabel(model,interactive,se
> ed,`seed',final,indiv,learner,`i') ///
>                                                 append
  4.         }

E[y|X,D=0]   = Y1_pystacked0_L1_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L1_1
E[D|X]       = D1_pystacked_L1_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1118519    .066866    -1.67   0.094    -.2429068     .019203
------------------------------------------------------------------------------
Warning: 139 propensity scores trimmed to lower limit ..
Warning: 42 propensity scores trimmed to upper limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_26898/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L2_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L2_1
E[D|X]       = D1_pystacked_L2_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1187809   .0164079    -7.24   0.000    -.1509399   -.0866219
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_26898/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L3_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L3_1
E[D|X]       = D1_pystacked_L3_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0306879   .0530753    -0.58   0.563    -.1347137    .0733379
------------------------------------------------------------------------------
Warning: 60 propensity scores trimmed to lower limit ..
Warning: 11 propensity scores trimmed to upper limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_26898/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L4_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L4_1
E[D|X]       = D1_pystacked_L4_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0408885   .0588525    -0.69   0.487    -.1562373    .0744603
------------------------------------------------------------------------------
Warning: 86 propensity scores trimmed to lower limit ..
Warning: 21 propensity scores trimmed to upper limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_26898/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L5_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L5_1
E[D|X]       = D1_pystacked_L5_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0192257   .0849813    -0.23   0.821     -.185786    .1473347
------------------------------------------------------------------------------
Warning: 79 propensity scores trimmed to lower limit ..
Warning: 20 propensity scores trimmed to upper limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_26898/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L6_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L6_1
E[D|X]       = D1_pystacked_L6_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1618137   .1676452    -0.97   0.334    -.4903923    .1667649
------------------------------------------------------------------------------
Warning: 94 propensity scores trimmed to lower limit ..
Warning: 21 propensity scores trimmed to upper limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_26898/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L7_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L7_1
E[D|X]       = D1_pystacked_L7_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0777002   .0229872    -3.38   0.001    -.1227542   -.0326461
------------------------------------------------------------------------------
Warning: 2 propensity scores trimmed to lower limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_26898/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L8_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L8_1
E[D|X]       = D1_pystacked_L8_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1046057   .0156248    -6.69   0.000    -.1352297   -.0739818
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_26898/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L9_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L9_1
E[D|X]       = D1_pystacked_L9_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1090781   .0148228    -7.36   0.000    -.1381303   -.0800259
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_26898/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L10_1                 Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L10_1
E[D|X]       = D1_pystacked_L10_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |   -.071902   .0214635    -3.35   0.001    -.1139696   -.0298343
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_26898/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L11_1                 Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L11_1
E[D|X]       = D1_pystacked_L11_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0239929   .0396704    -0.60   0.545    -.1017455    .0537598
------------------------------------------------------------------------------
Warning: 80 propensity scores trimmed to lower limit ..
Warning: 19 propensity scores trimmed to upper limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_26898/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L12_1                 Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L12_1
E[D|X]       = D1_pystacked_L12_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1358472    .019507    -6.96   0.000    -.1740803   -.0976141
------------------------------------------------------------------------------
Warning: 7 propensity scores trimmed to upper limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_26898/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L13_1                 Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L13_1
E[D|X]       = D1_pystacked_L13_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |   .0031749   .1913757     0.02   0.987    -.3719145    .3782643
------------------------------------------------------------------------------
Warning: 162 propensity scores trimmed to lower limit ..
Warning: 126 propensity scores trimmed to upper limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_26898/results.dta saved
. 
. }       

.         
. *****************************************************************************
> *  
. *** interactive NX: short-stacking                                           
>                                       ***
. *****************************************************************************
> *
. 
. if (`estimator'==3) {
. 
. gen one = 1     
. 
.         cap drop y0base*
.         cap drop dbase*
.         cap drop y1base*
. 
.         *** no cross-fitting
.         pystacked lnearn $X_expanded   $pystring_reg0  if gender_r == 0, type
> (reg) njobs($cores)  
.                 mat nxw_ia_y0 = e(weights)
.                 mat list nxw_ia_y0
.                                 preserve
.                                 svmat nxw_ia_y0
.                                 keep nxw_ia_y0*
.                                 save `folder'/nxw_ia_y0, replace
.                                 restore
.         predict y0base0, xb
.         predict y0base, base
. 
.         pystacked lnearn $X_expanded  $pystring_reg0 if gender_r == 1  , type
> (reg) njobs($cores)  
.                 mat nxw_ia_y1 = e(weights)
.                 mat list nxw_ia_y1
.                                 preserve
.                                 svmat nxw_ia_y1
.                                 keep nxw_ia_y1*
.                                 save `folder'/nxw_ia_y1, replace
.                                 restore
.         predict y1base0, xb
.         predict y1base, base
. 
.         pystacked gender_r $X_expanded $pystring_class  
.                 mat nxw_ia_d = e(weights)
.                 mat list nxw_ia_d
.                                 preserve
.                                 svmat nxw_ia_d
.                                 keep nxw_ia_d*
.                                 save `folder'/nxw_ia_d, replace
.                                 restore         
.         predict dbase0, pr
.         predict dbase, base pr
.         
.         forvalues i = 0(1)$L {
  2.                         _estimate_ate interactive, yname(lnearn) dname(gen
> der_r) ///
>                                                 y0(y0base`i') y1(y1base`i') d
> (dbase`i') ///
>                                                 atet foldid(one) robust model
> (interactive)
  3.                         regsave gender_r using `folder'/results.dta, ///
>                                                 ci addlabel(model,nxinter,see
> d,`seed',final,nx,learner,`i') append
  4.         }
.                 
. }

.         
. *****************************************************************************
> *  
. *** partial NX: short-stacking                                               
>                                       ***
. *****************************************************************************
> *
. 
. if (`estimator'==4) {
.         
. cap gen one = 1 
. 
.         cap drop Ybase* 
.         cap drop Dbase*
. 
.         *** no cross-fitting
.         pystacked lnearn $X_expanded $pystring_reg 
.                 mat nxw_y = e(weights)
.                 mat list nxw_y
.                                 preserve
.                                 svmat nxw_y
.                                 keep nxw_y*
.                                 save `folder'/nxw_y, replace
.                                 restore
.         predict Ybase0
.         predict Ybase, basexb
. 
.         pystacked gender_r $X_expanded $pystring_reg 
.                 mat nxw_d = e(weights)
.                 mat list nxw_d
.                                 preserve
.                                 svmat nxw_d
.                                 keep nxw_d*
.                                 save `folder'/nxw_d, replace
.                                 restore         
.         predict Dbase0
.         predict Dbase, basexb
. 
.         forvalues i = 0(1)$L {
  2.                 cap drop Ytil
  3.                 cap drop Dtil
  4.                 gen Ytil = lnearn - Ybase`i'
  5.                 gen Dtil = gender_r - Dbase`i'
  6.                 reg Ytil Dtil, robust
  7.                 regsave Dtil using `folder'/results.dta, ///
>                         ci addlabel(model,nxpartial,seed,`seed',final,nx,lear
> ner,`i') append
  8.         }
. 
. }

.         
. cap log close
