-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /cluster/home/kahrens/ddml_applied/GWG/Output/GWG_58248_2.txt
  log type:  text
 opened on:  10 Dec 2023, 19:14:52

. 
. which ddml
/cluster/home/kahrens/ado/plus/d/ddml.ado
*! ddml v1.4.3
*! last edited: 17aug2023
*! authors: aa/ms

. which pystacked
/cluster/home/kahrens/ado/plus/p/pystacked.ado
*! pystacked v0.7.5
*! last edited: 7aug2023
*! authors: aa/ms

. 
. set seed `seed'

. local folder out_`seed'

. 
. use "../Data/gender_gap_ML_processed", clear

. 
. cap mkdir `folder'

. 
. *****************************************************************************
> ***
. ***  controls
. *****************************************************************************
> ***
. 
. // create squared age and tenure here
. gen age_r2 = age_r^2

. gen tenure2 = tenure^2
(2 missing values generated)

. 
. // no base categories
. global continuous                                                            
>                                                            ///
>         age_r                                                                
>                                                                    /// no mis
> sing
>         yrsqual         /* years of education (derived) */                   
>                                    /// 355 missing
>         /// leavedu             /* age when left education (derived) */      
>                            /// 1,081 missing
>         pvlit1          /* literacy score: plausible value 1 (also 2-10 avail
> ) */       /// no missing
>         pvnum1          /* numeracy score: plausible value 1 (also 2-10 avail
> ) */       /// no missing
>         tenure          /* tenure = years in work for current employer */    
>                    /// 2 missing
>                                                                              
>                                                                            //

. // add second order terms here
. global continuous $continuous age_r2 tenure2

. 
. global discrete0                                                             
>                                                            ///             
>         b_q01a          /* education, highest level attained */              
>                            /// no missing
>         b_q01b          /* area of study */                                  
>                                                    /// 434 missing
>         d_q06c          /* part of a larger organization */                  
>                                    /// 13 missing
>         d_q08a          /* management position */                            
>                                            /// no missing
>         d_q09           /* type of contract */                               
>                                            /// 12 missing
>         d_q10_t1        /* hours per week at this job or business */         
>                    /// 1 missing
>         d_q14           /* job satisfaction */                               
>                                            /// 1 missing
>         i_q08           /* health status */                                  
>                                                    /// 2 missing
>         j_q02a          /* living with a partner */                          
>                                            /// 899 missing
>         j_q03d1_c       /* age of youngest child */                          
>                                            /// 2,718 missing
>         j_q04c1_c       /* immigration: age */                               
>                                            /// 4,375 missing
>         j_q06b          /* mother's highest level of educ */                 
>                            /// 445 missing
>         j_q07b          /* father's highest level of educ */                 
>                            /// 515 missing
>         j_q03b          /* number of children*/                              
>                                            /// 1,856 missing
>         impar           /* immigration: parents */                           
>                                            /// 21 missing
>         imgen           /* immigration: generation */                        
>                                    /// 344 missing
>         nfe12jr         /* informal job-related educ in prev 12 months */    
>                    /// 116 missing
>         nfe12njr        /* informal non-job-related educ in prev 12 months */
>            /// 116 missing
>                                                                              
>                                                                            //
>                                                                              
>                                                          

. global personality                                                           
>                                                            ///
>         i_q04b          /* Learning strategies, Relate new ideas into real li
> fe */      /// 16 missing
>         i_q04d          /* Learning strategies, Like learning new things */  
>                    /// no missing
>         i_q04h          /* Learning strategies, Attribute something new */   
>                    /// 10 missing
>         i_q04j          /* Learning strategies, Deal with difficult things */
>            /// no missing
>         i_q04l          /* Learning strategies, Fit different ideas together 
> */         /// 5 missing
>         i_q04m          /* Learning strategies, Looking for additional info *
> /          /// 1 missing
>         i_q05f          /* Cultural engagement, Voluntary non-profit work */ 
>            /// no missing
>         i_q06a          /* Political efficacy, No influence on the government
>  */        /// 14 missing
>         i_q07a          /* Social trust, Trust only few people */            
>                            /// 4 missing
>         i_q07b          /* Social trust, Other people take advantage of you *
> /          /// 6 missing
>                                                                              
>                                                                            //

. global discrete $discrete0                                                   
>                                                    ///
>         new_reg_tl2     /* geographical region */                            
>                                            /// 2 missing
>         new_isco1c      /* occupation */                                     
>                                                    /// no missing
>         new_isic1c      /* industry */                                       
>                                                    // no missing

. 
. global X_simple                                                         ///
>         i.(b_q01a d_q10_t1 j_q03b)                              ///
>         c.($continuous)

. 
. global X_fullinteracted                                         ///
>         i.($discrete0 )                                                 ///
>         i.new_isco1c#i.new_isic1c#i.new_reg_tl2 ///
>         c.($continuous)                  

.         
. global X_cont                                                           ///
>         c.($continuous)##i.($discrete)

. 
. global X_expanded                                                       ///
>         i.($discrete)                                                   ///
>         c.($continuous)                                                 ///
>         c.age_r#i.($discrete)                                   ///
>         c.tenure#i.($discrete)

. 
.         
. 
. *****************************************************************************
> ***
. ***  estimation sample
. *****************************************************************************
> ***
. 
. gen byte touse=1

. markout touse lnearn $X_expanded

. keep if touse
(53 observations deleted)

. 
. 
. *****************************************************************************
> ***
. ***  learners
. *****************************************************************************
> ***
. 
. global cores = 5

. 
. global rf1 min_samples_leaf(1)  max_features(sqrt) n_estimators(500)

. global rf2 min_samples_leaf(50)  max_features(sqrt) n_estimators(500)

. global rf3 min_samples_leaf(100)  max_features(sqrt) n_estimators(500)

. global grad1 n_estimators(500) n_iter_no_change(10)  

. global grad2 n_estimators(500)  

. global nnet1 hidden_layer_sizes(40 20 1 20 50) early_stopping 

. global nnet2 hidden_layer_sizes(30 30 30) early_stopping  

. 
. global pystring_reg0                                                         
>    || ///
>                                         m(ols)                               
>                            || ///
>                                         m(ols) xvars($X_simple)              
>            || ///
>                                         m(lassocv)                           
>                            || ///
>                                         m(ridgecv)                           
>                            || ///
>                                         m(lassocv)      xvars($X_cont)       
>            || ///
>                                         m(ridgecv)      xvars($X_cont)       
>            || ///
>                                         m(rf) opt($rf1)                      
>                    || ///
>                                         m(rf) opt($rf2)                      
>                    || ///
>                                         m(rf) opt($rf3)                      
>                    || ///
>                                         m(gradboost) opt($grad1)             
>            || ///
>                                         m(gradboost) opt($grad2)             
>            || ///
>                                         m(nnet) opt($nnet1)                  
>            || ///
>                                         m(nnet) opt($nnet2)                  
>            || //

. 
. global pystring_reg  $pystring_reg0 , type(reg) njobs($cores) 

.  
. global pystring_class0                                                       
>            || ///
>                                         m(logit)                             
>                            || ///
>                                         m(logit) xvars($X_simple)            
>            || ///
>                                         m(lassocv)                           
>                            || ///
>                                         m(ridgecv)                           
>                            || ///
>                                         m(lassocv)      xvars($X_cont)       
>            || ///
>                                         m(ridgecv)      xvars($X_cont)       
>            || ///
>                                         m(rf) opt($rf1)                      
>                    || ///
>                                         m(rf) opt($rf2)                      
>                    || ///
>                                         m(rf) opt($rf3)                      
>                    || ///
>                                         m(gradboost) opt($grad1)             
>            || ///
>                                         m(gradboost) opt($grad2)             
>            || ///
>                                         m(nnet) opt($nnet1)                  
>            || ///
>                                         m(nnet) opt($nnet2)                  
>            || //                   

.                                 
. global pystring_class $pystring_class0 , type(class) njobs($cores)

.                                         
. global R =1  

. global K=10 

. global L =13

.         
. *****************************************************************************
> *  
. *** ddml: estimation                                                         
>                                               ***
. *****************************************************************************
> *
. 
. if (`estimator'==1) {
. 
.         ddml init partial,  reps($R) kfolds($K)
.         ddml E[Y|X]: pystacked lnearn $X_expanded $pystring_reg
.         ddml E[D|X]: pystacked gender_r $X_expanded $pystring_reg
.         ddml crossfit, shortstack poolstack
.         ddml estimate, robust
.         
.         foreach mat in lnearn_mse gender_r_mse {
  2.                         ddml extract, show(mse)
  3.                         mat `mat' = r(`mat')
  4.                         mat list `mat'
  5.                                 preserve
  6.                                 svmat `mat'
  7.                                 keep `mat'*
  8.                                 keep if _n<=$L
  9.                                 gen stack_type = "conventional" if _n==1
 10.                                 replace stack_type = "pooled" if _n==2
 11.                                 replace stack_type = "short" if _n==3
 12.                                 gen model = "plm"
 13.                                 list if _n<=$L
 14.                                 save `folder'/`mat'_plm_mse, replace
 15.                                 restore 
 16.         }       
. 
.         cap drop mse_*
.         foreach var of varlist Y1_* {
  2.                  cap drop sqerr_`var'
  3.                  gen double sqerr_`var'=(lnearn-`var')^2
  4.                  sum sqerr_`var', meanonly
  5.                  gen double mse_`var'=r(mean) if _n ==1 
  6.         }
.         foreach var of varlist D1_* {
  2.                  cap drop sqerr_`var'
  3.                  gen double sqerr_`var'=(gender_r-`var')^2
  4.                  sum sqerr_`var', meanonly
  5.                  gen double mse_`var'=r(mean) if _n ==1 
  6.         }
.         preserve
.                 keep mse_*
.                 keep if _n==1
.                 save `folder'/plm_mse, replace
.         restore
.         cap drop mse_*
. 
.         ** initialize results file
.         regsave gender_r using `folder'/results.dta, ci addlabel(model,partia
> l,seed,`seed',final,init,learner,-99) replace
. 
.         foreach final in nnls1 singlebest ols avg {
  2. 
.                 ddml estimate, robust finalest(`final')
  3.         
.                         // regular stacking results
.                         ddml estimate, mname(m0) spec(st) replay  
  4.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,partial,seed,`seed',final,`final',learner,-1) append
  5.                         
.                         // shortstacking results
.                         ddml estimate, mname(m0) spec(ss) replay 
  6.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,partial,seed,`seed',final,`final',learner,-2) append
  7.                         
.                         // poolstacking results
.                         ddml estimate, mname(m0) spec(ps) replay  
  8.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,partial,seed,`seed',final,`final',learner,-3) append     
  9.                 
.                         // pystacked weights
.                         ddml extract, show(stweights)   
 10.                         foreach mat in Y1_pystacked_w_mn D1_pystacked_w_mn
>  {
 11.                                         ddml extract, show(stweights)   
 12.                                         mat `mat' = r(`mat')
 13.                                         mat list `mat'
 14.                                                 preserve
 15.                                                 svmat `mat'
 16.                                                 keep `mat'*
 17.                                                 list if _n<=4
 18.                                                 save `folder'/`mat'_`final
> '_regular, replace
 19.                                                 restore
 20.                         }       
 21.                         // shortstacked weights
.                         ddml extract, show(ssweights)
 22.                         foreach mat in Y_lnearn_ss D_gender_r_ss {
 23.                                         qui ddml extract, show(ssweights)
 24.                                         mat `mat' = r(`mat')
 25.                                         mat list `mat'
 26.                                                 preserve
 27.                                                 svmat `mat'
 28.                                                 keep `mat'*
 29.                                                 list if _n<=4
 30.                                                 save `folder'/`mat'_`final
> '_short, replace
 31.                                                 restore
 32.                         }       
 33.                         // poolstacked weights
. 
.                         foreach mat in Y_lnearn_ps D_gender_r_ps {
 34.                                         qui ddml extract, show(psweights)
 35.                                         mat `mat' = r(`mat')
 36.                                         mat list `mat'
 37.                                                 preserve
 38.                                                 svmat `mat'
 39.                                                 keep `mat'*
 40.                                                 list if _n<=4
 41.                                                 save `folder'/`mat'_`final
> '_pooled, replace
 42.                                                 restore
 43.                         }       
 44.         
.         }
. 
.         forvalues i = 1(1)$L {
  2.                         ddml estimate, y(Y1_pystacked_L`i'_1) ///
>                                                         d(D1_pystacked_L`i'_1
> ) robust
  3.                         regsave gender_r using `folder'/results.dta, ci //
> /
>                                                 addlabel(model,partial,seed,`
> seed',final,indiv,learner,`i') ///
>                                                 append
  4.         }
. 
. }

.         
. *****************************************************************************
> *  
. *** interactive: estimation                                                  
>                                       ***
. *****************************************************************************
> *
.         
. if (`estimator'==2) {   
. 
.         ddml init interactive, kfolds($K) reps($R)
.         ddml E[Y|X,D]: pystacked lnearn $X_expanded $pystring_reg
Learner Y1_pystacked added successfully.
.         ddml E[D|X]: pystacked gender_r $X_expanded $pystring_class
Learner D1_pystacked added successfully.
.         ddml crossfit, shortstack poolstack
Cross-fitting E[y|X,D] equation: lnearn
Cross-fitting fold 1 2 3 4 5 6 7 8 9 10 ...completed cross-fitting...completed 
> short-stacking...completed pooled-stacking
Cross-fitting E[D|X] equation: gender_r
Cross-fitting fold 1 2 3 4 5 6 7 8 9 10 ...completed cross-fitting...completed 
> short-stacking...completed pooled-stacking
.         ddml estimate, robust atet


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.083    (0.029)
  ss  1  [shortstack]          [ss]          [ss]    -0.078    (0.027)
  ps  1   [poolstack]          [ps]          [ps]    -0.080    (0.027)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0781938   .0269505    -2.90   0.004    -.1310157   -.0253718
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 8 propensity scores trimmed to lower limit .01.

. 
.         cap drop mse_*
.         foreach var of varlist Y1_pystacked0* {
  2.                  cap drop sqerr_`var'
  3.                  gen double sqerr_`var'=(lnearn-`var')^2 if gender_r==0
  4.                  sum sqerr_`var' if gender_r==0, meanonly
  5.                  gen double mse_`var'=r(mean) if _n ==1 
  6.         }
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
(2,813 missing values generated)
(4,835 missing values generated)
.         foreach var of varlist Y1_pystacked1* {
  2.                  cap drop sqerr_`var'
  3.                  gen double sqerr_`var'=(lnearn-`var')^2 if gender_r==1
  4.                  sum sqerr_`var' if gender_r==1, meanonly
  5.                  gen double mse_`var'=r(mean) if _n ==1 
  6.         }
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
(2,023 missing values generated)
(4,835 missing values generated)
.         foreach var of varlist D1_* {
  2.                  cap drop sqerr_`var'
  3.                  gen double sqerr_`var'=(gender_r-`var')^2
  4.                  sum sqerr_`var', meanonly
  5.                  gen double mse_`var'=r(mean) if _n ==1 
  6.         }
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
.         preserve
.                 keep mse_*
.                 keep if _n==1
(4,835 observations deleted)
.                 save `folder'/inter_mse, replace
(note: file out_58248/inter_mse.dta not found)
file out_58248/inter_mse.dta saved
.         restore
.         cap drop mse_*
.         
.         local mat gender_r_mse
.                         ddml extract, show(mse)

MSEs for gender_r:
                 rep   full smp      fold 1      fold 2      fold 3      fold 4
>       fold 5      fold 6      fold 7      fold 8      fold 9     fold 10 
    D1_pystacked   1      0.155       0.143       0.165       0.143       0.153
>        0.167       0.175       0.141       0.157       0.162       0.148  
   D_gender_r_ps   1      0.155       0.143       0.165       0.142       0.151
>        0.166       0.175       0.140       0.156       0.162       0.148  
   D_gender_r_ss   1      0.155       0.143       0.165       0.142       0.150
>        0.166       0.175       0.140       0.156       0.162       0.148  

MSEs for lnearn:
                D=  rep   full smp      fold 1      fold 2      fold 3      fol
> d 4      fold 5      fold 6      fold 7      fold 8      fold 9     fold 10 
    Y1_pystacked 0    1      0.230       0.556       0.172       0.265       0.
> 111       0.191       0.232       0.168       0.253       0.178       0.165  
    Y1_pystacked 1    1      0.175       0.275       0.244       0.110       0.
> 121       0.145       0.189       0.230       0.202       0.097       0.145  
     Y_lnearn_ps 0    1      8.292       8.340       8.216       8.273       8.
> 259       8.381       8.404       8.239       8.304       8.244       8.220  
     Y_lnearn_ps 1    1      7.502       7.506       7.476       7.374       7.
> 353       7.428       7.624       7.468       7.603       7.527       7.660  
     Y_lnearn_ss 0    1      0.226       0.556       0.169       0.263       0.
> 111       0.193       0.205       0.166       0.248       0.178       0.166  
     Y_lnearn_ss 1    1      0.173       0.269       0.243       0.109       0.
> 122       0.143       0.191       0.228       0.202       0.098       0.132  
.                         mat `mat' = r(`mat')
.                         mat list `mat'

gender_r_mse[3,12]
                      rep  full_sample        fold1        fold2        fold3
D1_pystacked            1     .1554056    .14326803    .16511501    .14284614
D_gender_r~s            1    .15481626    .14272633     .1648852    .14239118
D_gender_r~s            1    .15468605    .14265305    .16458012    .14201202

                    fold4        fold5        fold6        fold7        fold8
D1_pystacked    .15260973    .16712551    .17542972     .1406318    .15656991
D_gender_r~s     .1508745     .1663953    .17515261    .13998846    .15591008
D_gender_r~s     .1500956    .16646392     .1750389    .13955063    .15644537

                    fold9       fold10
D1_pystacked    .16243323    .14801965
D_gender_r~s    .16227841    .14755417
D_gender_r~s    .16229857      .147717
.                                 preserve
.                                 svmat `mat'
.                                 keep `mat'*
.                                 keep if _n<=$L
(4,823 observations deleted)
.                                 gen stack_type = "conventional" if _n==1
(12 missing values generated)
.                                 replace stack_type = "pooled" if _n==2
(1 real change made)
.                                 replace stack_type = "short" if _n==3
(1 real change made)
.                                 gen model = "interactive"
.                                 list if _n<=$L

     +-----------------------------------------------------------------+
  1. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        1 | .1554056 |  .143268 |  .165115 | .1428461 | .1526097 |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     | .1671255 | .1754297 | .1406318 | .1565699 | .1624332 | .1480197 |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |          conventional          |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  2. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        1 | .1548163 | .1427263 | .1648852 | .1423912 | .1508745 |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     | .1663953 | .1751526 | .1399885 | .1559101 | .1622784 | .1475542 |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                pooled          |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  3. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        1 |  .154686 |  .142653 | .1645801 |  .142012 | .1500956 |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     | .1664639 | .1750389 | .1395506 | .1564454 | .1622986 |  .147717 |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                 short          |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  4. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  5. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  6. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  7. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  8. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  9. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 10. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 11. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 12. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 13. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |--------------------------------+--------------------------------|
     |            stack_type          |                model           |
     |                                |          interactive           |
     +-----------------------------------------------------------------+
.                                 save `folder'/`mat'_inter_gender_mse, replace
(note: file out_58248/gender_r_mse_inter_gender_mse.dta not found)
file out_58248/gender_r_mse_inter_gender_mse.dta saved
.                                 restore 
.                                 
.         local mat lnearn_mse
.                         ddml extract, show(mse)

MSEs for gender_r:
                 rep   full smp      fold 1      fold 2      fold 3      fold 4
>       fold 5      fold 6      fold 7      fold 8      fold 9     fold 10 
    D1_pystacked   1      0.155       0.143       0.165       0.143       0.153
>        0.167       0.175       0.141       0.157       0.162       0.148  
   D_gender_r_ps   1      0.155       0.143       0.165       0.142       0.151
>        0.166       0.175       0.140       0.156       0.162       0.148  
   D_gender_r_ss   1      0.155       0.143       0.165       0.142       0.150
>        0.166       0.175       0.140       0.156       0.162       0.148  

MSEs for lnearn:
                D=  rep   full smp      fold 1      fold 2      fold 3      fol
> d 4      fold 5      fold 6      fold 7      fold 8      fold 9     fold 10 
    Y1_pystacked 0    1      0.230       0.556       0.172       0.265       0.
> 111       0.191       0.232       0.168       0.253       0.178       0.165  
    Y1_pystacked 1    1      0.175       0.275       0.244       0.110       0.
> 121       0.145       0.189       0.230       0.202       0.097       0.145  
     Y_lnearn_ps 0    1      8.292       8.340       8.216       8.273       8.
> 259       8.381       8.404       8.239       8.304       8.244       8.220  
     Y_lnearn_ps 1    1      7.502       7.506       7.476       7.374       7.
> 353       7.428       7.624       7.468       7.603       7.527       7.660  
     Y_lnearn_ss 0    1      0.226       0.556       0.169       0.263       0.
> 111       0.193       0.205       0.166       0.248       0.178       0.166  
     Y_lnearn_ss 1    1      0.173       0.269       0.243       0.109       0.
> 122       0.143       0.191       0.228       0.202       0.098       0.132  
.                         mat `mat' = r(`mat')
.                         mat list `mat'

lnearn_mse[6,13]
                    D=0/1          rep  full_sample        fold1        fold2
Y1_pystacked            0            1    .23035174    .55626546    .17167105
Y1_pystacked            1            1    .17485233     .2747194    .24415268
 Y_lnearn_ps            0            1    8.2915969    8.3401245    8.2156804
 Y_lnearn_ps            1            1    7.5015604    7.5057282    7.4757753
 Y_lnearn_ss            0            1    .22649424    .55645241    .16922276
 Y_lnearn_ss            1            1    .17267699    .26873556    .24320577

                    fold3        fold4        fold5        fold6        fold7
Y1_pystacked    .26464681    .11052714    .19144344    .23210348    .16760397
Y1_pystacked    .11009644    .12058208    .14466345       .18949    .22958443
 Y_lnearn_ps    8.2730007    8.2592149    8.3814797    8.4036093    8.2385658
 Y_lnearn_ps    7.3743837    7.3533947    7.4282163    7.6239566    7.4676384
 Y_lnearn_ss    .26316981    .11072115    .19266061    .20481605    .16641811
 Y_lnearn_ss    .10915479    .12181569    .14254937    .19093626    .22834174

                    fold8        fold9       fold10
Y1_pystacked    .25293386    .17829284    .16543426
Y1_pystacked    .20189677    .09737368    .14481619
 Y_lnearn_ps    8.3037267    8.2442807    8.2204073
 Y_lnearn_ps    7.6027675    7.5270102    7.6601402
 Y_lnearn_ss    .24849803     .1784617    .16555674
 Y_lnearn_ss    .20152625    .09813845     .1322571
.                                 preserve
.                                 svmat `mat'
.                                 keep `mat'*
.                                 keep if _n<=(2*$L)
(4,810 observations deleted)
.                                 gen stack_type = "conventional" if _n<=2
(24 missing values generated)
.                                 replace stack_type = "pooled" if _n>=3 & _n<=
> 4
(2 real changes made)
.                                 replace stack_type = "short" if _n>4
(22 real changes made)
.                                 gen model = "interactive"
.                                 list if _n<=(2*$L)

     +-----------------------------------------------------------------+
  1. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        0 |        1 | .2303517 | .5562655 |  .171671 | .2646468 |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     | .1105271 | .1914434 | .2321035 |  .167604 | .2529339 | .1782928 |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |     .1654343     |     conventional      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  2. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        1 |        1 | .1748523 | .2747194 | .2441527 | .1100964 |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     | .1205821 | .1446635 |   .18949 | .2295844 | .2018968 | .0973737 |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |     .1448162     |     conventional      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  3. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        0 |        1 | 8.291597 | 8.340124 |  8.21568 | 8.273001 |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     | 8.259214 | 8.381479 | 8.403609 | 8.238565 | 8.303727 | 8.244281 |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |     8.220407     |           pooled      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  4. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        1 |        1 |  7.50156 | 7.505728 | 7.475775 | 7.374384 |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     | 7.353395 | 7.428216 | 7.623957 | 7.467638 | 7.602767 |  7.52701 |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |      7.66014     |           pooled      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  5. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        0 |        1 | .2264942 | .5564524 | .1692228 | .2631698 |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     | .1107212 | .1926606 | .2048161 | .1664181 |  .248498 | .1784617 |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |     .1655567     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  6. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        1 |        1 |  .172677 | .2687356 | .2432058 | .1091548 |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     | .1218157 | .1425494 | .1909363 | .2283417 | .2015262 | .0981384 |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |     .1322571     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  7. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  8. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  9. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 10. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 11. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 12. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 13. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 14. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 15. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 16. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 17. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 18. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 19. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 20. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 21. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 22. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 23. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 24. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 25. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 26. | lnear~e1 | lnear~e2 | lnear~e3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |     lnear~13     |       stack_type      |           model      |
     |            .     |            short      |     interactive      |
     +-----------------------------------------------------------------+
.                                 save `folder'/`mat'_inter_lnearn_mse, replace
(note: file out_58248/lnearn_mse_inter_lnearn_mse.dta not found)
file out_58248/lnearn_mse_inter_lnearn_mse.dta saved
.                                 restore 
.         
.         foreach final in nnls1 singlebest ols avg {
  2. 
.                 ddml estimate, robust finalest(`final') atet
  3.         
.                         // regular stacking results
.                         ddml estimate, mname(m0) spec(st) replay atet
  4.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,interactive,seed,`seed',final,`final',learner,-1) append
  5.                         
.                         // shortstacking results
.                         ddml estimate, mname(m0) spec(ss) replay atet
  6.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,interactive,seed,`seed',final,`final',learner,-2) append
  7.                         
.                         // poolstacking results
.                         ddml estimate, mname(m0) spec(ps) replay atet
  8.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,interactive,seed,`seed',final,`final',learner,-3) append
  9.                 
.                         // pystacked weights
.                         ddml extract, show(stweights)
 10.                         foreach mat in Y1_pystacked_w_mn D1_pystacked_w_mn
>  {
 11.                                         ddml extract, show(stweights)
 12.                                         mat `mat' = r(`mat')
 13.                                         mat list `mat'
 14.                                                 preserve
 15.                                                 svmat `mat'
 16.                                                 keep `mat'*
 17.                                                 list if _n<=8
 18.                                                 save `folder'/`mat'_`final
> '_regular_ia, replace
 19.                                                 restore
 20.                         }       
 21.                         // shortstacked weights
.                         ddml extract, show(ssweights)
 22.                         foreach mat in Y_lnearn_ss D_gender_r_ss {
 23.                                         ddml extract, show(ssweights)
 24.                                         mat `mat' = r(`mat')
 25.                                         mat list `mat'
 26.                                                 preserve
 27.                                                 svmat `mat'
 28.                                                 keep `mat'*
 29.                                                 list if _n<=8
 30.                                                 save `folder'/`mat'_`final
> '_short_ia, replace
 31.                                                 restore
 32.                         }       
 33.                         // poolstacked weights
.                         ddml extract, show(psweights)
 34.                         foreach mat in Y_lnearn_ps D_gender_r_ps {
 35.                                         ddml extract, show(psweights)
 36.                                         mat `mat' = r(`mat')
 37.                                         mat list `mat'
 38.                                                 preserve
 39.                                                 svmat `mat'
 40.                                                 keep `mat'*
 41.                                                 list if _n<=8
 42.                                                 save `folder'/`mat'_`final
> '_pooled_ia, replace
 43.                                                 restore
 44.                         }       
 45.         
.         }


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.083    (0.029)
  ss  1  [shortstack]          [ss]          [ss]    -0.078    (0.027)
  ps  1   [poolstack]          [ps]          [ps]    -0.080    (0.027)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0781938   .0269505    -2.90   0.004    -.1310157   -.0253718
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 8 propensity scores trimmed to lower limit .01.



Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.083    (0.029)
  ss  1  [shortstack]          [ss]          [ss]    -0.078    (0.027)
  ps  1   [poolstack]          [ps]          [ps]    -0.080    (0.027)

Stacking DDML model (ATET)
E[y|X,D=0]   = Y1_pystacked0_1                     Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1
E[D|X]       = D1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0830245   .0289717    -2.87   0.004     -.139808    -.026241
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 7 propensity scores trimmed to lower limit .01.

(note: variable final was str5, now str10 to accommodate using data's values)
file out_58248/results.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  ss  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.078    (0.027)
  ss  1  [shortstack]          [ss]          [ss]    -0.078    (0.027)
  ps  1   [poolstack]          [ps]          [ps]    -0.080    (0.027)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0781938   .0269505    -2.90   0.004    -.1310157   -.0253718
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 8 propensity scores trimmed to lower limit .01.

(note: variable final was str5, now str10 to accommodate using data's values)
file out_58248/results.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  ps  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.080    (0.027)
  ss  1  [shortstack]          [ss]          [ss]    -0.078    (0.027)
  ps  1   [poolstack]          [ps]          [ps]    -0.080    (0.027)

Poolstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ps0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ps1
E[D|X]       = D_gender_r_ps_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0798118    .026675    -2.99   0.003    -.1320938   -.0275298
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 8 propensity scores trimmed to lower limit .01.

(note: variable final was str5, now str10 to accommodate using data's values)
file out_58248/results.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .24032951    .24032951
    logit            2    1.930e-17    1.930e-17
  lassocv            3    .12280241    .12280241
  ridgecv            4    .04923946    .04923946
  lassocv            5    .03123819    .03123819
  ridgecv            6    .00933887    .00933887
       rf            7    .27761159    .27761159
       rf            8    4.982e-17    4.982e-17
       rf            9    5.889e-17    5.889e-17
gradboost           10    .02645408    .02645408
gradboost           11    .22068594    .22068594
     nnet           12    4.235e-17    4.235e-17
     nnet           13    .02229995    .02229995

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .02974785    .02974785
      ols            2            0    .00098348    .00098348
  lassocv            3            0     .1029355     .1029355
  ridgecv            4            0     .2158857     .2158857
  lassocv            5            0    .02160404    .02160404
  ridgecv            6            0    .01039274    .01039274
       rf            7            0    .41550343    .41550343
       rf            8            0    9.996e-17    9.996e-17
       rf            9            0    1.301e-16    1.301e-16
gradboost           10            0    .03990042    .03990042
gradboost           11            0    .13674214    .13674214
     nnet           12            0    .01658176    .01658176
     nnet           13            0    .00972295    .00972295
      ols            1            1    .00902852    .00902852
      ols            2            1    2.865e-17    2.865e-17
  lassocv            3            1    .06214047    .06214047
  ridgecv            4            1    .03371948    .03371948
  lassocv            5            1    .23596907    .23596907
  ridgecv            6            1    .08294635    .08294635
       rf            7            1    .47759744    .47759744
       rf            8            1    6.207e-17    6.207e-17
       rf            9            1    1.599e-16    1.599e-16
gradboost           10            1    .00269208    .00269208
gradboost           11            1     .0572381     .0572381
     nnet           12            1    .00836318    .00836318
     nnet           13            1    .03030533    .03030533

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .24032951    .24032951
    logit            2    1.930e-17    1.930e-17
  lassocv            3    .12280241    .12280241
  ridgecv            4    .04923946    .04923946
  lassocv            5    .03123819    .03123819
  ridgecv            6    .00933887    .00933887
       rf            7    .27761159    .27761159
       rf            8    4.982e-17    4.982e-17
       rf            9    5.889e-17    5.889e-17
gradboost           10    .02645408    .02645408
gradboost           11    .22068594    .22068594
     nnet           12    4.235e-17    4.235e-17
     nnet           13    .02229995    .02229995

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .02974785    .02974785
      ols            2            0    .00098348    .00098348
  lassocv            3            0     .1029355     .1029355
  ridgecv            4            0     .2158857     .2158857
  lassocv            5            0    .02160404    .02160404
  ridgecv            6            0    .01039274    .01039274
       rf            7            0    .41550343    .41550343
       rf            8            0    9.996e-17    9.996e-17
       rf            9            0    1.301e-16    1.301e-16
gradboost           10            0    .03990042    .03990042
gradboost           11            0    .13674214    .13674214
     nnet           12            0    .01658176    .01658176
     nnet           13            0    .00972295    .00972295
      ols            1            1    .00902852    .00902852
      ols            2            1    2.865e-17    2.865e-17
  lassocv            3            1    .06214047    .06214047
  ridgecv            4            1    .03371948    .03371948
  lassocv            5            1    .23596907    .23596907
  ridgecv            6            1    .08294635    .08294635
       rf            7            1    .47759744    .47759744
       rf            8            1    6.207e-17    6.207e-17
       rf            9            1    1.599e-16    1.599e-16
gradboost           10            1    .00269208    .00269208
gradboost           11            1     .0572381     .0572381
     nnet           12            1    .00836318    .00836318
     nnet           13            1    .03030533    .03030533

Y1_pystacked_w_mn[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .02974785    .02974785
      ols            2            0    .00098348    .00098348
  lassocv            3            0     .1029355     .1029355
  ridgecv            4            0     .2158857     .2158857
  lassocv            5            0    .02160404    .02160404
  ridgecv            6            0    .01039274    .01039274
       rf            7            0    .41550343    .41550343
       rf            8            0    9.996e-17    9.996e-17
       rf            9            0    1.301e-16    1.301e-16
gradboost           10            0    .03990042    .03990042
gradboost           11            0    .13674214    .13674214
     nnet           12            0    .01658176    .01658176
     nnet           13            0    .00972295    .00972295
      ols            1            1    .00902852    .00902852
      ols            2            1    2.865e-17    2.865e-17
  lassocv            3            1    .06214047    .06214047
  ridgecv            4            1    .03371948    .03371948
  lassocv            5            1    .23596907    .23596907
  ridgecv            6            1    .08294635    .08294635
       rf            7            1    .47759744    .47759744
       rf            8            1    6.207e-17    6.207e-17
       rf            9            1    1.599e-16    1.599e-16
gradboost           10            1    .00269208    .00269208
gradboost           11            1     .0572381     .0572381
     nnet           12            1    .00836318    .00836318
     nnet           13            1    .03030533    .03030533

      +-------------------------------------------+
      | Y1_pys~1   Y1_pys~2   Y1_pys~3   Y1_pys~4 |
      |-------------------------------------------|
   1. |        1          0   .0297479   .0297479 |
   2. |        2          0   .0009835   .0009835 |
   3. |        3          0   .1029355   .1029355 |
   4. |        4          0   .2158857   .2158857 |
   5. |        5          0    .021604    .021604 |
      |-------------------------------------------|
   6. |        6          0   .0103927   .0103927 |
   7. |        7          0   .4155034   .4155034 |
   8. |        8          0   1.00e-16   1.00e-16 |
      +-------------------------------------------+
(note: file out_58248/Y1_pystacked_w_mn_nnls1_regular_ia.dta not found)
file out_58248/Y1_pystacked_w_mn_nnls1_regular_ia.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .24032951    .24032951
    logit            2    1.930e-17    1.930e-17
  lassocv            3    .12280241    .12280241
  ridgecv            4    .04923946    .04923946
  lassocv            5    .03123819    .03123819
  ridgecv            6    .00933887    .00933887
       rf            7    .27761159    .27761159
       rf            8    4.982e-17    4.982e-17
       rf            9    5.889e-17    5.889e-17
gradboost           10    .02645408    .02645408
gradboost           11    .22068594    .22068594
     nnet           12    4.235e-17    4.235e-17
     nnet           13    .02229995    .02229995

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .02974785    .02974785
      ols            2            0    .00098348    .00098348
  lassocv            3            0     .1029355     .1029355
  ridgecv            4            0     .2158857     .2158857
  lassocv            5            0    .02160404    .02160404
  ridgecv            6            0    .01039274    .01039274
       rf            7            0    .41550343    .41550343
       rf            8            0    9.996e-17    9.996e-17
       rf            9            0    1.301e-16    1.301e-16
gradboost           10            0    .03990042    .03990042
gradboost           11            0    .13674214    .13674214
     nnet           12            0    .01658176    .01658176
     nnet           13            0    .00972295    .00972295
      ols            1            1    .00902852    .00902852
      ols            2            1    2.865e-17    2.865e-17
  lassocv            3            1    .06214047    .06214047
  ridgecv            4            1    .03371948    .03371948
  lassocv            5            1    .23596907    .23596907
  ridgecv            6            1    .08294635    .08294635
       rf            7            1    .47759744    .47759744
       rf            8            1    6.207e-17    6.207e-17
       rf            9            1    1.599e-16    1.599e-16
gradboost           10            1    .00269208    .00269208
gradboost           11            1     .0572381     .0572381
     nnet           12            1    .00836318    .00836318
     nnet           13            1    .03030533    .03030533

D1_pystacked_w_mn[13,3]
               learner  mean_weight        rep_1
    logit            1    .24032951    .24032951
    logit            2    1.930e-17    1.930e-17
  lassocv            3    .12280241    .12280241
  ridgecv            4    .04923946    .04923946
  lassocv            5    .03123819    .03123819
  ridgecv            6    .00933887    .00933887
       rf            7    .27761159    .27761159
       rf            8    4.982e-17    4.982e-17
       rf            9    5.889e-17    5.889e-17
gradboost           10    .02645408    .02645408
gradboost           11    .22068594    .22068594
     nnet           12    4.235e-17    4.235e-17
     nnet           13    .02229995    .02229995

      +--------------------------------+
      | D1_pys~1   D1_pys~2   D1_pys~3 |
      |--------------------------------|
   1. |        1   .2403295   .2403295 |
   2. |        2   1.93e-17   1.93e-17 |
   3. |        3   .1228024   .1228024 |
   4. |        4   .0492395   .0492395 |
   5. |        5   .0312382   .0312382 |
      |--------------------------------|
   6. |        6   .0093389   .0093389 |
   7. |        7   .2776116   .2776116 |
   8. |        8   4.98e-17   4.98e-17 |
      +--------------------------------+
(note: file out_58248/D1_pystacked_w_mn_nnls1_regular_ia.dta not found)
file out_58248/D1_pystacked_w_mn_nnls1_regular_ia.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .25373406    .25373406
    logit            2    1.563e-17    1.563e-17
  lassocv            3    .02276377    .02276377
  ridgecv            4     .1365943     .1365943
  lassocv            5            0            0
  ridgecv            6    2.845e-17    2.845e-17
       rf            7    .28155443    .28155443
       rf            8    9.177e-17    9.177e-17
       rf            9    2.300e-17    2.300e-17
gradboost           10    6.519e-18    6.519e-18
gradboost           11    .30535344    .30535344
     nnet           12            0            0
     nnet           13            0            0

short-stacked weights across resamples for lnearn
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .01791481    .01791481
      ols            2            0    1.143e-16    1.143e-16
  lassocv            3            0    1.479e-18    1.479e-18
  ridgecv            4            0    .16062422    .16062422
  lassocv            5            0    .15847526    .15847526
  ridgecv            6            0    4.332e-17    4.332e-17
       rf            7            0    .56193298    .56193298
       rf            8            0    8.670e-17    8.670e-17
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0    .10105274    .10105274
     nnet           12            0            0            0
     nnet           13            0    3.864e-17    3.864e-17
      ols            1            1    .05647336    .05647336
      ols            2            1            0            0
  lassocv            3            1    .27024232    .27024232
  ridgecv            4            1    .06179022    .06179022
  lassocv            5            1    1.639e-16    1.639e-16
  ridgecv            6            1            0            0
       rf            7            1    .46483949    .46483949
       rf            8            1            0            0
       rf            9            1    7.183e-17    7.183e-17
gradboost           10            1    .03313922    .03313922
gradboost           11            1    .11351539    .11351539
     nnet           12            1    7.758e-17    7.758e-17
     nnet           13            1            0            0

short-stacked weights across resamples for gender_r
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .25373406    .25373406
    logit            2    1.563e-17    1.563e-17
  lassocv            3    .02276377    .02276377
  ridgecv            4     .1365943     .1365943
  lassocv            5            0            0
  ridgecv            6    2.845e-17    2.845e-17
       rf            7    .28155443    .28155443
       rf            8    9.177e-17    9.177e-17
       rf            9    2.300e-17    2.300e-17
gradboost           10    6.519e-18    6.519e-18
gradboost           11    .30535344    .30535344
     nnet           12            0            0
     nnet           13            0            0

short-stacked weights across resamples for lnearn
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .01791481    .01791481
      ols            2            0    1.143e-16    1.143e-16
  lassocv            3            0    1.479e-18    1.479e-18
  ridgecv            4            0    .16062422    .16062422
  lassocv            5            0    .15847526    .15847526
  ridgecv            6            0    4.332e-17    4.332e-17
       rf            7            0    .56193298    .56193298
       rf            8            0    8.670e-17    8.670e-17
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0    .10105274    .10105274
     nnet           12            0            0            0
     nnet           13            0    3.864e-17    3.864e-17
      ols            1            1    .05647336    .05647336
      ols            2            1            0            0
  lassocv            3            1    .27024232    .27024232
  ridgecv            4            1    .06179022    .06179022
  lassocv            5            1    1.639e-16    1.639e-16
  ridgecv            6            1            0            0
       rf            7            1    .46483949    .46483949
       rf            8            1            0            0
       rf            9            1    7.183e-17    7.183e-17
gradboost           10            1    .03313922    .03313922
gradboost           11            1    .11351539    .11351539
     nnet           12            1    7.758e-17    7.758e-17
     nnet           13            1            0            0

Y_lnearn_ss[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .01791481    .01791481
      ols            2            0    1.143e-16    1.143e-16
  lassocv            3            0    1.479e-18    1.479e-18
  ridgecv            4            0    .16062422    .16062422
  lassocv            5            0    .15847526    .15847526
  ridgecv            6            0    4.332e-17    4.332e-17
       rf            7            0    .56193298    .56193298
       rf            8            0    8.670e-17    8.670e-17
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0    .10105274    .10105274
     nnet           12            0            0            0
     nnet           13            0    3.864e-17    3.864e-17
      ols            1            1    .05647336    .05647336
      ols            2            1            0            0
  lassocv            3            1    .27024232    .27024232
  ridgecv            4            1    .06179022    .06179022
  lassocv            5            1    1.639e-16    1.639e-16
  ridgecv            6            1            0            0
       rf            7            1    .46483949    .46483949
       rf            8            1            0            0
       rf            9            1    7.183e-17    7.183e-17
gradboost           10            1    .03313922    .03313922
gradboost           11            1    .11351539    .11351539
     nnet           12            1    7.758e-17    7.758e-17
     nnet           13            1            0            0

      +-------------------------------------------------------------------+
      | Y_lne~1_1   Y_lne~0_1   Y_lne~s1   Y_lnea~2   Y_lnea~3   Y_lnea~4 |
      |-------------------------------------------------------------------|
   1. | 2.5761911   2.7377604          1          0   .0179148   .0179148 |
   2. | 2.9764752    3.230665          2          0   1.14e-16   1.14e-16 |
   3. | 2.8266935   2.8869994          3          0   1.48e-18   1.48e-18 |
   4. | 2.4412546   2.6150057          4          0   .1606242   .1606242 |
   5. | 3.0771141   3.1583724          5          0   .1584753   .1584753 |
      |-------------------------------------------------------------------|
   6. | 2.5418771   2.6709198          6          0   4.33e-17   4.33e-17 |
   7. | 2.4131799   2.6069208          7          0    .561933    .561933 |
   8. | 2.6752025   2.7535247          8          0   8.67e-17   8.67e-17 |
      +-------------------------------------------------------------------+
(note: file out_58248/Y_lnearn_ss_nnls1_short_ia.dta not found)
file out_58248/Y_lnearn_ss_nnls1_short_ia.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .25373406    .25373406
    logit            2    1.563e-17    1.563e-17
  lassocv            3    .02276377    .02276377
  ridgecv            4     .1365943     .1365943
  lassocv            5            0            0
  ridgecv            6    2.845e-17    2.845e-17
       rf            7    .28155443    .28155443
       rf            8    9.177e-17    9.177e-17
       rf            9    2.300e-17    2.300e-17
gradboost           10    6.519e-18    6.519e-18
gradboost           11    .30535344    .30535344
     nnet           12            0            0
     nnet           13            0            0

short-stacked weights across resamples for lnearn
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .01791481    .01791481
      ols            2            0    1.143e-16    1.143e-16
  lassocv            3            0    1.479e-18    1.479e-18
  ridgecv            4            0    .16062422    .16062422
  lassocv            5            0    .15847526    .15847526
  ridgecv            6            0    4.332e-17    4.332e-17
       rf            7            0    .56193298    .56193298
       rf            8            0    8.670e-17    8.670e-17
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0    .10105274    .10105274
     nnet           12            0            0            0
     nnet           13            0    3.864e-17    3.864e-17
      ols            1            1    .05647336    .05647336
      ols            2            1            0            0
  lassocv            3            1    .27024232    .27024232
  ridgecv            4            1    .06179022    .06179022
  lassocv            5            1    1.639e-16    1.639e-16
  ridgecv            6            1            0            0
       rf            7            1    .46483949    .46483949
       rf            8            1            0            0
       rf            9            1    7.183e-17    7.183e-17
gradboost           10            1    .03313922    .03313922
gradboost           11            1    .11351539    .11351539
     nnet           12            1    7.758e-17    7.758e-17
     nnet           13            1            0            0

D_gender_r_ss[13,3]
               learner  mean_weight        rep_1
    logit            1    .25373406    .25373406
    logit            2    1.563e-17    1.563e-17
  lassocv            3    .02276377    .02276377
  ridgecv            4     .1365943     .1365943
  lassocv            5            0            0
  ridgecv            6    2.845e-17    2.845e-17
       rf            7    .28155443    .28155443
       rf            8    9.177e-17    9.177e-17
       rf            9    2.300e-17    2.300e-17
gradboost           10    6.519e-18    6.519e-18
gradboost           11    .30535344    .30535344
     nnet           12            0            0
     nnet           13            0            0

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .77429425          1   .2537341   .2537341 |
   2. |  .3897366          2   1.56e-17   1.56e-17 |
   3. | .09127255          3   .0227638   .0227638 |
   4. | .16775914          4   .1365943   .1365943 |
   5. | .51863479          5          0          0 |
      |--------------------------------------------|
   6. | .84278763          6   2.85e-17   2.85e-17 |
   7. | .77461711          7   .2815544   .2815544 |
   8. | .88775621          8   9.18e-17   9.18e-17 |
      +--------------------------------------------+
(note: file out_58248/D_gender_r_ss_nnls1_short_ia.dta not found)
file out_58248/D_gender_r_ss_nnls1_short_ia.dta saved

pool-stacked weights across resamples for gender_r
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .25568853    .25568853
    logit            2    1.785e-16    1.785e-16
  lassocv            3    .15385909    .15385909
  ridgecv            4    .04812277    .04812277
  lassocv            5    2.429e-16    2.429e-16
  ridgecv            6            0            0
       rf            7    .28973748    .28973748
       rf            8            0            0
       rf            9    5.363e-16    5.363e-16
gradboost           10            0            0
gradboost           11    .23382509    .23382509
     nnet           12            0            0
     nnet           13    .01876705    .01876705

pool-stacked weights across resamples for lnearn
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .01740664    .01740664
      ols            2            0            0            0
  lassocv            3            0    .09157831    .09157831
  ridgecv            4            0    .27711972    .27711972
  lassocv            5            0            0            0
  ridgecv            6            0    5.277e-16    5.277e-16
       rf            7            0    .45377601    .45377601
       rf            8            0    4.495e-16    4.495e-16
       rf            9            0    1.336e-15    1.336e-15
gradboost           10            0            0            0
gradboost           11            0    .15600923    .15600923
     nnet           12            0            0            0
     nnet           13            0    .00411009    .00411009
      ols            1            1    2.096e-15    2.096e-15
      ols            2            1            0            0
  lassocv            3            1    .05879714    .05879714
  ridgecv            4            1    .08078838    .08078838
  lassocv            5            1    .26318434    .26318434
  ridgecv            6            1    .00947549    .00947549
       rf            7            1    .48556664    .48556664
       rf            8            1    1.189e-15    1.189e-15
       rf            9            1    8.811e-16    8.811e-16
gradboost           10            1    3.111e-16    3.111e-16
gradboost           11            1    .07069961    .07069961
     nnet           12            1    2.810e-15    2.810e-15
     nnet           13            1     .0314884     .0314884

pool-stacked weights across resamples for gender_r
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .25568853    .25568853
    logit            2    1.785e-16    1.785e-16
  lassocv            3    .15385909    .15385909
  ridgecv            4    .04812277    .04812277
  lassocv            5    2.429e-16    2.429e-16
  ridgecv            6            0            0
       rf            7    .28973748    .28973748
       rf            8            0            0
       rf            9    5.363e-16    5.363e-16
gradboost           10            0            0
gradboost           11    .23382509    .23382509
     nnet           12            0            0
     nnet           13    .01876705    .01876705

pool-stacked weights across resamples for lnearn
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .01740664    .01740664
      ols            2            0            0            0
  lassocv            3            0    .09157831    .09157831
  ridgecv            4            0    .27711972    .27711972
  lassocv            5            0            0            0
  ridgecv            6            0    5.277e-16    5.277e-16
       rf            7            0    .45377601    .45377601
       rf            8            0    4.495e-16    4.495e-16
       rf            9            0    1.336e-15    1.336e-15
gradboost           10            0            0            0
gradboost           11            0    .15600923    .15600923
     nnet           12            0            0            0
     nnet           13            0    .00411009    .00411009
      ols            1            1    2.096e-15    2.096e-15
      ols            2            1            0            0
  lassocv            3            1    .05879714    .05879714
  ridgecv            4            1    .08078838    .08078838
  lassocv            5            1    .26318434    .26318434
  ridgecv            6            1    .00947549    .00947549
       rf            7            1    .48556664    .48556664
       rf            8            1    1.189e-15    1.189e-15
       rf            9            1    8.811e-16    8.811e-16
gradboost           10            1    3.111e-16    3.111e-16
gradboost           11            1    .07069961    .07069961
     nnet           12            1    2.810e-15    2.810e-15
     nnet           13            1     .0314884     .0314884

Y_lnearn_ps[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .01740664    .01740664
      ols            2            0            0            0
  lassocv            3            0    .09157831    .09157831
  ridgecv            4            0    .27711972    .27711972
  lassocv            5            0            0            0
  ridgecv            6            0    5.277e-16    5.277e-16
       rf            7            0    .45377601    .45377601
       rf            8            0    4.495e-16    4.495e-16
       rf            9            0    1.336e-15    1.336e-15
gradboost           10            0            0            0
gradboost           11            0    .15600923    .15600923
     nnet           12            0            0            0
     nnet           13            0    .00411009    .00411009
      ols            1            1    2.096e-15    2.096e-15
      ols            2            1            0            0
  lassocv            3            1    .05879714    .05879714
  ridgecv            4            1    .08078838    .08078838
  lassocv            5            1    .26318434    .26318434
  ridgecv            6            1    .00947549    .00947549
       rf            7            1    .48556664    .48556664
       rf            8            1    1.189e-15    1.189e-15
       rf            9            1    8.811e-16    8.811e-16
gradboost           10            1    3.111e-16    3.111e-16
gradboost           11            1    .07069961    .07069961
     nnet           12            1    2.810e-15    2.810e-15
     nnet           13            1     .0314884     .0314884

      +-------------------------------------------------------------------+
      | Y_lne~1_1   Y_lne~0_1   Y_lne~s1   Y_lnea~2   Y_lnea~3   Y_lnea~4 |
      |-------------------------------------------------------------------|
   1. | 2.5767154   2.7386923          1          0   .0174066   .0174066 |
   2. | 2.9552909   3.2393049          2          0          0          0 |
   3. | 2.8104402   2.8883999          3          0   .0915783   .0915783 |
   4. | 2.4618309   2.6294149          4          0   .2771197   .2771197 |
   5. |  3.083534   3.1724875          5          0          0          0 |
      |-------------------------------------------------------------------|
   6. | 2.5510908   2.6763076          6          0   5.28e-16   5.28e-16 |
   7. | 2.4063317   2.5959274          7          0    .453776    .453776 |
   8. | 2.7354642   2.7446394          8          0   4.49e-16   4.49e-16 |
      +-------------------------------------------------------------------+
(note: file out_58248/Y_lnearn_ps_nnls1_pooled_ia.dta not found)
file out_58248/Y_lnearn_ps_nnls1_pooled_ia.dta saved

pool-stacked weights across resamples for gender_r
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .25568853    .25568853
    logit            2    1.785e-16    1.785e-16
  lassocv            3    .15385909    .15385909
  ridgecv            4    .04812277    .04812277
  lassocv            5    2.429e-16    2.429e-16
  ridgecv            6            0            0
       rf            7    .28973748    .28973748
       rf            8            0            0
       rf            9    5.363e-16    5.363e-16
gradboost           10            0            0
gradboost           11    .23382509    .23382509
     nnet           12            0            0
     nnet           13    .01876705    .01876705

pool-stacked weights across resamples for lnearn
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .01740664    .01740664
      ols            2            0            0            0
  lassocv            3            0    .09157831    .09157831
  ridgecv            4            0    .27711972    .27711972
  lassocv            5            0            0            0
  ridgecv            6            0    5.277e-16    5.277e-16
       rf            7            0    .45377601    .45377601
       rf            8            0    4.495e-16    4.495e-16
       rf            9            0    1.336e-15    1.336e-15
gradboost           10            0            0            0
gradboost           11            0    .15600923    .15600923
     nnet           12            0            0            0
     nnet           13            0    .00411009    .00411009
      ols            1            1    2.096e-15    2.096e-15
      ols            2            1            0            0
  lassocv            3            1    .05879714    .05879714
  ridgecv            4            1    .08078838    .08078838
  lassocv            5            1    .26318434    .26318434
  ridgecv            6            1    .00947549    .00947549
       rf            7            1    .48556664    .48556664
       rf            8            1    1.189e-15    1.189e-15
       rf            9            1    8.811e-16    8.811e-16
gradboost           10            1    3.111e-16    3.111e-16
gradboost           11            1    .07069961    .07069961
     nnet           12            1    2.810e-15    2.810e-15
     nnet           13            1     .0314884     .0314884

D_gender_r_ps[13,3]
               learner  mean_weight        rep_1
    logit            1    .25568853    .25568853
    logit            2    1.785e-16    1.785e-16
  lassocv            3    .15385909    .15385909
  ridgecv            4    .04812277    .04812277
  lassocv            5    2.429e-16    2.429e-16
  ridgecv            6            0            0
       rf            7    .28973748    .28973748
       rf            8            0            0
       rf            9    5.363e-16    5.363e-16
gradboost           10            0            0
gradboost           11    .23382509    .23382509
     nnet           12            0            0
     nnet           13    .01876705    .01876705

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .76691563          1   .2556885   .2556885 |
   2. | .39776269          2   1.78e-16   1.78e-16 |
   3. | .09231253          3   .1538591   .1538591 |
   4. | .17290619          4   .0481228   .0481228 |
   5. | .52715979          5   2.43e-16   2.43e-16 |
      |--------------------------------------------|
   6. | .84505135          6          0          0 |
   7. | .77433055          7   .2897375   .2897375 |
   8. | .87272231          8          0          0 |
      +--------------------------------------------+
(note: file out_58248/D_gender_r_ps_nnls1_pooled_ia.dta not found)
file out_58248/D_gender_r_ps_nnls1_pooled_ia.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.025    (0.067)
  ss  1  [shortstack]          [ss]          [ss]    -0.034    (0.064)
  ps  1   [poolstack]          [ps]          [ps]    -0.034    (0.064)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |    -.03418   .0643538    -0.53   0.595    -.1603112    .0919512
------------------------------------------------------------------------------
Stacking final estimator: singlebest
Warning: 67 propensity scores trimmed to lower limit .01.
Warning: 6 propensity scores trimmed to upper limit .99.
Warning: . resamples had propensity scores trimmed to upper limit .99.



Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.025    (0.067)
  ss  1  [shortstack]          [ss]          [ss]    -0.034    (0.064)
  ps  1   [poolstack]          [ps]          [ps]    -0.034    (0.064)

Stacking DDML model (ATET)
E[y|X,D=0]   = Y1_pystacked0_1                     Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1
E[D|X]       = D1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0247584   .0667231    -0.37   0.711    -.1555332    .1060165
------------------------------------------------------------------------------
Stacking final estimator: singlebest
Warning: 66 propensity scores trimmed to lower limit .01.
Warning: 5 propensity scores trimmed to upper limit .99.
Warning: . resamples had propensity scores trimmed to upper limit .99.

file out_58248/results.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  ss  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.034    (0.064)
  ss  1  [shortstack]          [ss]          [ss]    -0.034    (0.064)
  ps  1   [poolstack]          [ps]          [ps]    -0.034    (0.064)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |    -.03418   .0643538    -0.53   0.595    -.1603112    .0919512
------------------------------------------------------------------------------
Stacking final estimator: singlebest
Warning: 67 propensity scores trimmed to lower limit .01.
Warning: 6 propensity scores trimmed to upper limit .99.
Warning: . resamples had propensity scores trimmed to upper limit .99.

file out_58248/results.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  ps  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.034    (0.064)
  ss  1  [shortstack]          [ss]          [ss]    -0.034    (0.064)
  ps  1   [poolstack]          [ps]          [ps]    -0.034    (0.064)

Poolstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ps0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ps1
E[D|X]       = D_gender_r_ps_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |    -.03418   .0643538    -0.53   0.595    -.1603112    .0919512
------------------------------------------------------------------------------
Stacking final estimator: singlebest
Warning: 67 propensity scores trimmed to lower limit .01.
Warning: 6 propensity scores trimmed to upper limit .99.
Warning: . resamples had propensity scores trimmed to upper limit .99.

file out_58248/results.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3           .9           .9
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10           .1           .1
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0           .1           .1
  ridgecv            4            0           .1           .1
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0           .8           .8
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1           .1           .1
  ridgecv            6            1            0            0
       rf            7            1           .9           .9
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3           .9           .9
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10           .1           .1
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0           .1           .1
  ridgecv            4            0           .1           .1
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0           .8           .8
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1           .1           .1
  ridgecv            6            1            0            0
       rf            7            1           .9           .9
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

Y1_pystacked_w_mn[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0           .1           .1
  ridgecv            4            0           .1           .1
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0           .8           .8
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1           .1           .1
  ridgecv            6            1            0            0
       rf            7            1           .9           .9
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

      +-------------------------------------------+
      | Y1_pys~1   Y1_pys~2   Y1_pys~3   Y1_pys~4 |
      |-------------------------------------------|
   1. |        1          0          0          0 |
   2. |        2          0          0          0 |
   3. |        3          0         .1         .1 |
   4. |        4          0         .1         .1 |
   5. |        5          0          0          0 |
      |-------------------------------------------|
   6. |        6          0          0          0 |
   7. |        7          0         .8         .8 |
   8. |        8          0          0          0 |
      +-------------------------------------------+
(note: file out_58248/Y1_pystacked_w_mn_singlebest_regular_ia.dta not found)
file out_58248/Y1_pystacked_w_mn_singlebest_regular_ia.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3           .9           .9
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10           .1           .1
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0           .1           .1
  ridgecv            4            0           .1           .1
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0           .8           .8
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1           .1           .1
  ridgecv            6            1            0            0
       rf            7            1           .9           .9
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

D1_pystacked_w_mn[13,3]
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3           .9           .9
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10           .1           .1
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

      +--------------------------------+
      | D1_pys~1   D1_pys~2   D1_pys~3 |
      |--------------------------------|
   1. |        1          0          0 |
   2. |        2          0          0 |
   3. |        3         .9         .9 |
   4. |        4          0          0 |
   5. |        5          0          0 |
      |--------------------------------|
   6. |        6          0          0 |
   7. |        7          0          0 |
   8. |        8          0          0 |
      +--------------------------------+
(note: file out_58248/D1_pystacked_w_mn_singlebest_regular_ia.dta not found)
file out_58248/D1_pystacked_w_mn_singlebest_regular_ia.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3            1            1
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

short-stacked weights across resamples for lnearn
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

short-stacked weights across resamples for gender_r
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3            1            1
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

short-stacked weights across resamples for lnearn
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

Y_lnearn_ss[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

      +-------------------------------------------------------------------+
      | Y_lne~1_1   Y_lne~0_1   Y_lne~s1   Y_lnea~2   Y_lnea~3   Y_lnea~4 |
      |-------------------------------------------------------------------|
   1. | 2.5894296   2.7618253          1          0          0          0 |
   2. | 2.8777959   3.2151403          2          0          0          0 |
   3. | 2.9559746   2.9466252          3          0          0          0 |
   4. | 2.4981003   2.6152329          4          0          0          0 |
   5. | 3.0477288   3.1479254          5          0          0          0 |
      |-------------------------------------------------------------------|
   6. | 2.5024741   2.6527545          6          0          0          0 |
   7. | 2.5140603   2.7341321          7          0          1          1 |
   8. |  2.659548   2.8049769          8          0          0          0 |
      +-------------------------------------------------------------------+
(note: file out_58248/Y_lnearn_ss_singlebest_short_ia.dta not found)
file out_58248/Y_lnearn_ss_singlebest_short_ia.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3            1            1
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

short-stacked weights across resamples for lnearn
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

D_gender_r_ss[13,3]
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3            1            1
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .72125399          1          0          0 |
   2. | .35558507          2          0          0 |
   3. | .02522999          3          1          1 |
   4. | .22709274          4          0          0 |
   5. |  .5587973          5          0          0 |
      |--------------------------------------------|
   6. | .81448257          6          0          0 |
   7. | .81611061          7          0          0 |
   8. | .78807336          8          0          0 |
      +--------------------------------------------+
(note: file out_58248/D_gender_r_ss_singlebest_short_ia.dta not found)
file out_58248/D_gender_r_ss_singlebest_short_ia.dta saved

pool-stacked weights across resamples for gender_r
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3            1            1
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

pool-stacked weights across resamples for lnearn
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

pool-stacked weights across resamples for gender_r
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3            1            1
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

pool-stacked weights across resamples for lnearn
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

Y_lnearn_ps[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

      +-------------------------------------------------------------------+
      | Y_lne~1_1   Y_lne~0_1   Y_lne~s1   Y_lnea~2   Y_lnea~3   Y_lnea~4 |
      |-------------------------------------------------------------------|
   1. | 2.5894296   2.7618253          1          0          0          0 |
   2. | 2.8777959   3.2151403          2          0          0          0 |
   3. | 2.9559746   2.9466252          3          0          0          0 |
   4. | 2.4981003   2.6152329          4          0          0          0 |
   5. | 3.0477288   3.1479254          5          0          0          0 |
      |-------------------------------------------------------------------|
   6. | 2.5024741   2.6527545          6          0          0          0 |
   7. | 2.5140603   2.7341321          7          0          1          1 |
   8. |  2.659548   2.8049769          8          0          0          0 |
      +-------------------------------------------------------------------+
(note: file out_58248/Y_lnearn_ps_singlebest_pooled_ia.dta not found)
file out_58248/Y_lnearn_ps_singlebest_pooled_ia.dta saved

pool-stacked weights across resamples for gender_r
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3            1            1
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

pool-stacked weights across resamples for lnearn
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            0            0
      ols            2            0            0            0
  lassocv            3            0            0            0
  ridgecv            4            0            0            0
  lassocv            5            0            0            0
  ridgecv            6            0            0            0
       rf            7            0            1            1
       rf            8            0            0            0
       rf            9            0            0            0
gradboost           10            0            0            0
gradboost           11            0            0            0
     nnet           12            0            0            0
     nnet           13            0            0            0
      ols            1            1            0            0
      ols            2            1            0            0
  lassocv            3            1            0            0
  ridgecv            4            1            0            0
  lassocv            5            1            0            0
  ridgecv            6            1            0            0
       rf            7            1            1            1
       rf            8            1            0            0
       rf            9            1            0            0
gradboost           10            1            0            0
gradboost           11            1            0            0
     nnet           12            1            0            0
     nnet           13            1            0            0

D_gender_r_ps[13,3]
               learner  mean_weight        rep_1
    logit            1            0            0
    logit            2            0            0
  lassocv            3            1            1
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .72125399          1          0          0 |
   2. | .35558507          2          0          0 |
   3. | .02522999          3          1          1 |
   4. | .22709274          4          0          0 |
   5. |  .5587973          5          0          0 |
      |--------------------------------------------|
   6. | .81448257          6          0          0 |
   7. | .81611061          7          0          0 |
   8. | .78807336          8          0          0 |
      +--------------------------------------------+
(note: file out_58248/D_gender_r_ps_singlebest_pooled_ia.dta not found)
file out_58248/D_gender_r_ps_singlebest_pooled_ia.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -7.974    (1.383)
  ss  1  [shortstack]          [ss]          [ss]     0.033    (0.101)
  ps  1   [poolstack]          [ps]          [ps]     0.243    (0.113)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |   .0333966   .1006853     0.33   0.740     -.163943    .2307361
------------------------------------------------------------------------------
Stacking final estimator: ols
Warning: 108 propensity scores trimmed to lower limit .01.
Warning: 70 propensity scores trimmed to upper limit .99.
Warning: . resamples had propensity scores trimmed to upper limit .99.



Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -7.974    (1.383)
  ss  1  [shortstack]          [ss]          [ss]     0.033    (0.101)
  ps  1   [poolstack]          [ps]          [ps]     0.243    (0.113)

Stacking DDML model (ATET)
E[y|X,D=0]   = Y1_pystacked0_1                     Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1
E[D|X]       = D1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |   -7.97354   1.383034    -5.77   0.000    -10.68424   -5.262842
------------------------------------------------------------------------------
Stacking final estimator: ols
Warning: 2216 propensity scores trimmed to lower limit .01.
Warning: 398 propensity scores trimmed to upper limit .99.
Warning: . resamples had propensity scores trimmed to upper limit .99.

(note: variable final was str3, now str10 to accommodate using data's values)
file out_58248/results.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  ss  1  Y1_pystacked  Y1_pystacked  D1_pystacked     0.033    (0.101)
  ss  1  [shortstack]          [ss]          [ss]     0.033    (0.101)
  ps  1   [poolstack]          [ps]          [ps]     0.243    (0.113)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |   .0333966   .1006853     0.33   0.740     -.163943    .2307361
------------------------------------------------------------------------------
Stacking final estimator: ols
Warning: 108 propensity scores trimmed to lower limit .01.
Warning: 70 propensity scores trimmed to upper limit .99.
Warning: . resamples had propensity scores trimmed to upper limit .99.

(note: variable final was str3, now str10 to accommodate using data's values)
file out_58248/results.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  ps  1  Y1_pystacked  Y1_pystacked  D1_pystacked     0.243    (0.113)
  ss  1  [shortstack]          [ss]          [ss]     0.033    (0.101)
  ps  1   [poolstack]          [ps]          [ps]     0.243    (0.113)

Poolstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ps0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ps1
E[D|X]       = D_gender_r_ps_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |   .2429157   .1132889     2.14   0.032     .0208735    .4649579
------------------------------------------------------------------------------
Stacking final estimator: ols
Warning: 4 propensity scores trimmed to lower limit .01.
Warning: 288 propensity scores trimmed to upper limit .99.
Warning: . resamples had propensity scores trimmed to upper limit .99.

(note: variable final was str3, now str10 to accommodate using data's values)
file out_58248/results.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .20519945    .20519945
    logit            2    .07972106    .07972106
  lassocv            3    .19744025    .19744025
  ridgecv            4    .12800598    .12800598
  lassocv            5   -.03472546   -.03472546
  ridgecv            6   -.04121436   -.04121436
       rf            7    .39544646    .39544646
       rf            8    .16660299    .16660299
       rf            9    -.2625221    -.2625221
gradboost           10     .0668558     .0668558
gradboost           11    .16357202    .16357202
     nnet           12   -2.1244073   -2.1244073
     nnet           13    .01556024    .01556024

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .03010446    .03010446
      ols            2            0   -.03199951   -.03199951
  lassocv            3            0   -.00823513   -.00823513
  ridgecv            4            0    .54726045    .54726045
  lassocv            5            0     .0011516     .0011516
  ridgecv            6            0   -.09878911   -.09878911
       rf            7            0    .67081794    .67081794
       rf            8            0   -.15401345   -.15401345
       rf            9            0    .02476067    .02476067
gradboost           10            0     .0544208     .0544208
gradboost           11            0    .06679233    .06679233
     nnet           12            0   -.46297589   -.46297589
     nnet           13            0   -.00340886   -.00340886
      ols            1            1   -.01807632   -.01807632
      ols            2            1   -.02136206   -.02136206
  lassocv            3            1   -.07745528   -.07745528
  ridgecv            4            1    .22956461    .22956461
  lassocv            5            1    .30565543    .30565543
  ridgecv            6            1    .03284254    .03284254
       rf            7            1    .52018748    .52018748
       rf            8            1    .30707675    .30707675
       rf            9            1   -.18375538   -.18375538
gradboost           10            1   -.06077961   -.06077961
gradboost           11            1    .04565057    .04565057
     nnet           12            1   -.34791896   -.34791896
     nnet           13            1     .0207135     .0207135

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .20519945    .20519945
    logit            2    .07972106    .07972106
  lassocv            3    .19744025    .19744025
  ridgecv            4    .12800598    .12800598
  lassocv            5   -.03472546   -.03472546
  ridgecv            6   -.04121436   -.04121436
       rf            7    .39544646    .39544646
       rf            8    .16660299    .16660299
       rf            9    -.2625221    -.2625221
gradboost           10     .0668558     .0668558
gradboost           11    .16357202    .16357202
     nnet           12   -2.1244073   -2.1244073
     nnet           13    .01556024    .01556024

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .03010446    .03010446
      ols            2            0   -.03199951   -.03199951
  lassocv            3            0   -.00823513   -.00823513
  ridgecv            4            0    .54726045    .54726045
  lassocv            5            0     .0011516     .0011516
  ridgecv            6            0   -.09878911   -.09878911
       rf            7            0    .67081794    .67081794
       rf            8            0   -.15401345   -.15401345
       rf            9            0    .02476067    .02476067
gradboost           10            0     .0544208     .0544208
gradboost           11            0    .06679233    .06679233
     nnet           12            0   -.46297589   -.46297589
     nnet           13            0   -.00340886   -.00340886
      ols            1            1   -.01807632   -.01807632
      ols            2            1   -.02136206   -.02136206
  lassocv            3            1   -.07745528   -.07745528
  ridgecv            4            1    .22956461    .22956461
  lassocv            5            1    .30565543    .30565543
  ridgecv            6            1    .03284254    .03284254
       rf            7            1    .52018748    .52018748
       rf            8            1    .30707675    .30707675
       rf            9            1   -.18375538   -.18375538
gradboost           10            1   -.06077961   -.06077961
gradboost           11            1    .04565057    .04565057
     nnet           12            1   -.34791896   -.34791896
     nnet           13            1     .0207135     .0207135

Y1_pystacked_w_mn[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .03010446    .03010446
      ols            2            0   -.03199951   -.03199951
  lassocv            3            0   -.00823513   -.00823513
  ridgecv            4            0    .54726045    .54726045
  lassocv            5            0     .0011516     .0011516
  ridgecv            6            0   -.09878911   -.09878911
       rf            7            0    .67081794    .67081794
       rf            8            0   -.15401345   -.15401345
       rf            9            0    .02476067    .02476067
gradboost           10            0     .0544208     .0544208
gradboost           11            0    .06679233    .06679233
     nnet           12            0   -.46297589   -.46297589
     nnet           13            0   -.00340886   -.00340886
      ols            1            1   -.01807632   -.01807632
      ols            2            1   -.02136206   -.02136206
  lassocv            3            1   -.07745528   -.07745528
  ridgecv            4            1    .22956461    .22956461
  lassocv            5            1    .30565543    .30565543
  ridgecv            6            1    .03284254    .03284254
       rf            7            1    .52018748    .52018748
       rf            8            1    .30707675    .30707675
       rf            9            1   -.18375538   -.18375538
gradboost           10            1   -.06077961   -.06077961
gradboost           11            1    .04565057    .04565057
     nnet           12            1   -.34791896   -.34791896
     nnet           13            1     .0207135     .0207135

      +---------------------------------------------+
      | Y1_pys~1   Y1_pys~2   Y1_pyst~3   Y1_pyst~4 |
      |---------------------------------------------|
   1. |        1          0    .0301045    .0301045 |
   2. |        2          0   -.0319995   -.0319995 |
   3. |        3          0   -.0082351   -.0082351 |
   4. |        4          0    .5472605    .5472605 |
   5. |        5          0    .0011516    .0011516 |
      |---------------------------------------------|
   6. |        6          0   -.0987891   -.0987891 |
   7. |        7          0    .6708179    .6708179 |
   8. |        8          0   -.1540134   -.1540134 |
      +---------------------------------------------+
(note: file out_58248/Y1_pystacked_w_mn_ols_regular_ia.dta not found)
file out_58248/Y1_pystacked_w_mn_ols_regular_ia.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .20519945    .20519945
    logit            2    .07972106    .07972106
  lassocv            3    .19744025    .19744025
  ridgecv            4    .12800598    .12800598
  lassocv            5   -.03472546   -.03472546
  ridgecv            6   -.04121436   -.04121436
       rf            7    .39544646    .39544646
       rf            8    .16660299    .16660299
       rf            9    -.2625221    -.2625221
gradboost           10     .0668558     .0668558
gradboost           11    .16357202    .16357202
     nnet           12   -2.1244073   -2.1244073
     nnet           13    .01556024    .01556024

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .03010446    .03010446
      ols            2            0   -.03199951   -.03199951
  lassocv            3            0   -.00823513   -.00823513
  ridgecv            4            0    .54726045    .54726045
  lassocv            5            0     .0011516     .0011516
  ridgecv            6            0   -.09878911   -.09878911
       rf            7            0    .67081794    .67081794
       rf            8            0   -.15401345   -.15401345
       rf            9            0    .02476067    .02476067
gradboost           10            0     .0544208     .0544208
gradboost           11            0    .06679233    .06679233
     nnet           12            0   -.46297589   -.46297589
     nnet           13            0   -.00340886   -.00340886
      ols            1            1   -.01807632   -.01807632
      ols            2            1   -.02136206   -.02136206
  lassocv            3            1   -.07745528   -.07745528
  ridgecv            4            1    .22956461    .22956461
  lassocv            5            1    .30565543    .30565543
  ridgecv            6            1    .03284254    .03284254
       rf            7            1    .52018748    .52018748
       rf            8            1    .30707675    .30707675
       rf            9            1   -.18375538   -.18375538
gradboost           10            1   -.06077961   -.06077961
gradboost           11            1    .04565057    .04565057
     nnet           12            1   -.34791896   -.34791896
     nnet           13            1     .0207135     .0207135

D1_pystacked_w_mn[13,3]
               learner  mean_weight        rep_1
    logit            1    .20519945    .20519945
    logit            2    .07972106    .07972106
  lassocv            3    .19744025    .19744025
  ridgecv            4    .12800598    .12800598
  lassocv            5   -.03472546   -.03472546
  ridgecv            6   -.04121436   -.04121436
       rf            7    .39544646    .39544646
       rf            8    .16660299    .16660299
       rf            9    -.2625221    -.2625221
gradboost           10     .0668558     .0668558
gradboost           11    .16357202    .16357202
     nnet           12   -2.1244073   -2.1244073
     nnet           13    .01556024    .01556024

      +----------------------------------+
      | D1_pys~1   D1_pyst~2   D1_pyst~3 |
      |----------------------------------|
   1. |        1    .2051995    .2051995 |
   2. |        2    .0797211    .0797211 |
   3. |        3    .1974403    .1974403 |
   4. |        4     .128006     .128006 |
   5. |        5   -.0347255   -.0347255 |
      |----------------------------------|
   6. |        6   -.0412144   -.0412144 |
   7. |        7    .3954464    .3954464 |
   8. |        8     .166603     .166603 |
      +----------------------------------+
(note: file out_58248/D1_pystacked_w_mn_ols_regular_ia.dta not found)
file out_58248/D1_pystacked_w_mn_ols_regular_ia.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .21353117    .21353117
    logit            2    .05584773    .05584773
  lassocv            3    .75283649    .75283649
  ridgecv            4    .17109049    .17109049
  lassocv            5    -.8835571    -.8835571
  ridgecv            6    .17948713    .17948713
       rf            7    .40908372    .40908372
       rf            8    .13860321    .13860321
       rf            9    -.2486035    -.2486035
gradboost           10    .04179702    .04179702
gradboost           11    .25535878    .25535878
     nnet           12   -.05185762   -.05185762
     nnet           13   -.02257326   -.02257326

short-stacked weights across resamples for lnearn
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .05020071    .05020071
      ols            2            0    -.0961917    -.0961917
  lassocv            3            0   -.52368638   -.52368638
  ridgecv            4            0    .72114667    .72114667
  lassocv            5            0    .22746678    .22746678
  ridgecv            6            0   -.07202619   -.07202619
       rf            7            0    .90534958    .90534958
       rf            8            0   -.17265932   -.17265932
       rf            9            0    .00651981    .00651981
gradboost           10            0    .11604772    .11604772
gradboost           11            0   -.03871438   -.03871438
     nnet           12            0    .01278343    .01278343
     nnet           13            0   -.01887856   -.01887856
      ols            1            1    .05617585    .05617585
      ols            2            1    .00849224    .00849224
  lassocv            3            1    .05483848    .05483848
  ridgecv            4            1    .39938615    .39938615
  lassocv            5            1    .07771268    .07771268
  ridgecv            6            1   -.12592512   -.12592512
       rf            7            1    .48100696    .48100696
       rf            8            1     .2207385     .2207385
       rf            9            1   -.20933738   -.20933738
gradboost           10            1    .08440779    .08440779
gradboost           11            1    .06452057    .06452057
     nnet           12            1     .0599938     .0599938
     nnet           13            1   -.04568091   -.04568091

short-stacked weights across resamples for gender_r
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .21353117    .21353117
    logit            2    .05584773    .05584773
  lassocv            3    .75283649    .75283649
  ridgecv            4    .17109049    .17109049
  lassocv            5    -.8835571    -.8835571
  ridgecv            6    .17948713    .17948713
       rf            7    .40908372    .40908372
       rf            8    .13860321    .13860321
       rf            9    -.2486035    -.2486035
gradboost           10    .04179702    .04179702
gradboost           11    .25535878    .25535878
     nnet           12   -.05185762   -.05185762
     nnet           13   -.02257326   -.02257326

short-stacked weights across resamples for lnearn
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .05020071    .05020071
      ols            2            0    -.0961917    -.0961917
  lassocv            3            0   -.52368638   -.52368638
  ridgecv            4            0    .72114667    .72114667
  lassocv            5            0    .22746678    .22746678
  ridgecv            6            0   -.07202619   -.07202619
       rf            7            0    .90534958    .90534958
       rf            8            0   -.17265932   -.17265932
       rf            9            0    .00651981    .00651981
gradboost           10            0    .11604772    .11604772
gradboost           11            0   -.03871438   -.03871438
     nnet           12            0    .01278343    .01278343
     nnet           13            0   -.01887856   -.01887856
      ols            1            1    .05617585    .05617585
      ols            2            1    .00849224    .00849224
  lassocv            3            1    .05483848    .05483848
  ridgecv            4            1    .39938615    .39938615
  lassocv            5            1    .07771268    .07771268
  ridgecv            6            1   -.12592512   -.12592512
       rf            7            1    .48100696    .48100696
       rf            8            1     .2207385     .2207385
       rf            9            1   -.20933738   -.20933738
gradboost           10            1    .08440779    .08440779
gradboost           11            1    .06452057    .06452057
     nnet           12            1     .0599938     .0599938
     nnet           13            1   -.04568091   -.04568091

Y_lnearn_ss[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .05020071    .05020071
      ols            2            0    -.0961917    -.0961917
  lassocv            3            0   -.52368638   -.52368638
  ridgecv            4            0    .72114667    .72114667
  lassocv            5            0    .22746678    .22746678
  ridgecv            6            0   -.07202619   -.07202619
       rf            7            0    .90534958    .90534958
       rf            8            0   -.17265932   -.17265932
       rf            9            0    .00651981    .00651981
gradboost           10            0    .11604772    .11604772
gradboost           11            0   -.03871438   -.03871438
     nnet           12            0    .01278343    .01278343
     nnet           13            0   -.01887856   -.01887856
      ols            1            1    .05617585    .05617585
      ols            2            1    .00849224    .00849224
  lassocv            3            1    .05483848    .05483848
  ridgecv            4            1    .39938615    .39938615
  lassocv            5            1    .07771268    .07771268
  ridgecv            6            1   -.12592512   -.12592512
       rf            7            1    .48100696    .48100696
       rf            8            1     .2207385     .2207385
       rf            9            1   -.20933738   -.20933738
gradboost           10            1    .08440779    .08440779
gradboost           11            1    .06452057    .06452057
     nnet           12            1     .0599938     .0599938
     nnet           13            1   -.04568091   -.04568091

      +---------------------------------------------------------------------+
      | Y_lne~1_1   Y_lne~0_1   Y_lne~s1   Y_lnea~2   Y_lnear~3   Y_lnear~4 |
      |---------------------------------------------------------------------|
   1. | 2.8928842   3.0514889          1          0    .0502007    .0502007 |
   2. | 3.3681857   3.5547545          2          0   -.0961917   -.0961917 |
   3. | 3.1949561   3.2517025          3          0   -.5236864   -.5236864 |
   4. | 2.7455654   2.8608054          4          0    .7211466    .7211466 |
   5. | 3.4776096   3.4772808          5          0    .2274668    .2274668 |
      |---------------------------------------------------------------------|
   6. | 2.8719509   2.9573604          6          0   -.0720262   -.0720262 |
   7. | 2.7086713   2.9616134          7          0    .9053496    .9053496 |
   8. | 2.9074087   3.0430312          8          0   -.1726593   -.1726593 |
      +---------------------------------------------------------------------+
(note: file out_58248/Y_lnearn_ss_ols_short_ia.dta not found)
file out_58248/Y_lnearn_ss_ols_short_ia.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .21353117    .21353117
    logit            2    .05584773    .05584773
  lassocv            3    .75283649    .75283649
  ridgecv            4    .17109049    .17109049
  lassocv            5    -.8835571    -.8835571
  ridgecv            6    .17948713    .17948713
       rf            7    .40908372    .40908372
       rf            8    .13860321    .13860321
       rf            9    -.2486035    -.2486035
gradboost           10    .04179702    .04179702
gradboost           11    .25535878    .25535878
     nnet           12   -.05185762   -.05185762
     nnet           13   -.02257326   -.02257326

short-stacked weights across resamples for lnearn
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .05020071    .05020071
      ols            2            0    -.0961917    -.0961917
  lassocv            3            0   -.52368638   -.52368638
  ridgecv            4            0    .72114667    .72114667
  lassocv            5            0    .22746678    .22746678
  ridgecv            6            0   -.07202619   -.07202619
       rf            7            0    .90534958    .90534958
       rf            8            0   -.17265932   -.17265932
       rf            9            0    .00651981    .00651981
gradboost           10            0    .11604772    .11604772
gradboost           11            0   -.03871438   -.03871438
     nnet           12            0    .01278343    .01278343
     nnet           13            0   -.01887856   -.01887856
      ols            1            1    .05617585    .05617585
      ols            2            1    .00849224    .00849224
  lassocv            3            1    .05483848    .05483848
  ridgecv            4            1    .39938615    .39938615
  lassocv            5            1    .07771268    .07771268
  ridgecv            6            1   -.12592512   -.12592512
       rf            7            1    .48100696    .48100696
       rf            8            1     .2207385     .2207385
       rf            9            1   -.20933738   -.20933738
gradboost           10            1    .08440779    .08440779
gradboost           11            1    .06452057    .06452057
     nnet           12            1     .0599938     .0599938
     nnet           13            1   -.04568091   -.04568091

D_gender_r_ss[13,3]
               learner  mean_weight        rep_1
    logit            1    .21353117    .21353117
    logit            2    .05584773    .05584773
  lassocv            3    .75283649    .75283649
  ridgecv            4    .17109049    .17109049
  lassocv            5    -.8835571    -.8835571
  ridgecv            6    .17948713    .17948713
       rf            7    .40908372    .40908372
       rf            8    .13860321    .13860321
       rf            9    -.2486035    -.2486035
gradboost           10    .04179702    .04179702
gradboost           11    .25535878    .25535878
     nnet           12   -.05185762   -.05185762
     nnet           13   -.02257326   -.02257326

      +----------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gende~2   D_gende~3 |
      |----------------------------------------------|
   1. |  .7466921          1    .2135312    .2135312 |
   2. |  .3822195          2    .0558477    .0558477 |
   3. | .07464214          3    .7528365    .7528365 |
   4. | .12832562          4    .1710905    .1710905 |
   5. | .53336667          5   -.8835571   -.8835571 |
      |----------------------------------------------|
   6. | .88345997          6    .1794871    .1794871 |
   7. | .82638263          7    .4090837    .4090837 |
   8. | .90721765          8    .1386032    .1386032 |
      +----------------------------------------------+
(note: file out_58248/D_gender_r_ss_ols_short_ia.dta not found)
file out_58248/D_gender_r_ss_ols_short_ia.dta saved

pool-stacked weights across resamples for gender_r
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .20833379    .20833379
    logit            2    .07879726    .07879726
  lassocv            3    .15601816    .15601816
  ridgecv            4    .12502604    .12502604
  lassocv            5   -.00812355   -.00812355
  ridgecv            6   -.03036911   -.03036911
       rf            7    .39670094    .39670094
       rf            8     .1623702     .1623702
       rf            9   -.26324138   -.26324138
gradboost           10    .06645093    .06645093
gradboost           11    .16417587    .16417587
     nnet           12    .01036739    .01036739
     nnet           13    .01661032    .01661032

pool-stacked weights across resamples for lnearn
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .01713937    .01713937
      ols            2            0   -.04104182   -.04104182
  lassocv            3            0   -.00302004   -.00302004
  ridgecv            4            0    .55001473    .55001473
  lassocv            5            0   -.01944538   -.01944538
  ridgecv            6            0   -.08888107   -.08888107
       rf            7            0     .6807695     .6807695
       rf            8            0   -.14251247   -.14251247
       rf            9            0    .01519282    .01519282
gradboost           10            0    .05933025    .05933025
gradboost           11            0    .06845684    .06845684
     nnet           12            0    .00120344    .00120344
     nnet           13            0   -.00252824   -.00252824
      ols            1            1   -.02062991   -.02062991
      ols            2            1   -.02822643   -.02822643
  lassocv            3            1   -.06485097   -.06485097
  ridgecv            4            1    .26915016    .26915016
  lassocv            5            1    .28165753    .28165753
  ridgecv            6            1   -.00587879   -.00587879
       rf            7            1    .51153495    .51153495
       rf            8            1     .3446082     .3446082
       rf            9            1   -.20899078   -.20899078
gradboost           10            1   -.05588984   -.05588984
gradboost           11            1    .05352369    .05352369
     nnet           12            1   -.00269774   -.00269774
     nnet           13            1    .02630791    .02630791

pool-stacked weights across resamples for gender_r
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .20833379    .20833379
    logit            2    .07879726    .07879726
  lassocv            3    .15601816    .15601816
  ridgecv            4    .12502604    .12502604
  lassocv            5   -.00812355   -.00812355
  ridgecv            6   -.03036911   -.03036911
       rf            7    .39670094    .39670094
       rf            8     .1623702     .1623702
       rf            9   -.26324138   -.26324138
gradboost           10    .06645093    .06645093
gradboost           11    .16417587    .16417587
     nnet           12    .01036739    .01036739
     nnet           13    .01661032    .01661032

pool-stacked weights across resamples for lnearn
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .01713937    .01713937
      ols            2            0   -.04104182   -.04104182
  lassocv            3            0   -.00302004   -.00302004
  ridgecv            4            0    .55001473    .55001473
  lassocv            5            0   -.01944538   -.01944538
  ridgecv            6            0   -.08888107   -.08888107
       rf            7            0     .6807695     .6807695
       rf            8            0   -.14251247   -.14251247
       rf            9            0    .01519282    .01519282
gradboost           10            0    .05933025    .05933025
gradboost           11            0    .06845684    .06845684
     nnet           12            0    .00120344    .00120344
     nnet           13            0   -.00252824   -.00252824
      ols            1            1   -.02062991   -.02062991
      ols            2            1   -.02822643   -.02822643
  lassocv            3            1   -.06485097   -.06485097
  ridgecv            4            1    .26915016    .26915016
  lassocv            5            1    .28165753    .28165753
  ridgecv            6            1   -.00587879   -.00587879
       rf            7            1    .51153495    .51153495
       rf            8            1     .3446082     .3446082
       rf            9            1   -.20899078   -.20899078
gradboost           10            1   -.05588984   -.05588984
gradboost           11            1    .05352369    .05352369
     nnet           12            1   -.00269774   -.00269774
     nnet           13            1    .02630791    .02630791

Y_lnearn_ps[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .01713937    .01713937
      ols            2            0   -.04104182   -.04104182
  lassocv            3            0   -.00302004   -.00302004
  ridgecv            4            0    .55001473    .55001473
  lassocv            5            0   -.01944538   -.01944538
  ridgecv            6            0   -.08888107   -.08888107
       rf            7            0     .6807695     .6807695
       rf            8            0   -.14251247   -.14251247
       rf            9            0    .01519282    .01519282
gradboost           10            0    .05933025    .05933025
gradboost           11            0    .06845684    .06845684
     nnet           12            0    .00120344    .00120344
     nnet           13            0   -.00252824   -.00252824
      ols            1            1   -.02062991   -.02062991
      ols            2            1   -.02822643   -.02822643
  lassocv            3            1   -.06485097   -.06485097
  ridgecv            4            1    .26915016    .26915016
  lassocv            5            1    .28165753    .28165753
  ridgecv            6            1   -.00587879   -.00587879
       rf            7            1    .51153495    .51153495
       rf            8            1     .3446082     .3446082
       rf            9            1   -.20899078   -.20899078
gradboost           10            1   -.05588984   -.05588984
gradboost           11            1    .05352369    .05352369
     nnet           12            1   -.00269774   -.00269774
     nnet           13            1    .02630791    .02630791

      +---------------------------------------------------------------------+
      | Y_lne~1_1   Y_lne~0_1   Y_lne~s1   Y_lnea~2   Y_lnear~3   Y_lnear~4 |
      |---------------------------------------------------------------------|
   1. | 2.8327626   2.9806927          1          0    .0171394    .0171394 |
   2. | 3.2151479   3.5280896          2          0   -.0410418   -.0410418 |
   3. | 3.0832991   3.1660394          3          0     -.00302     -.00302 |
   4. | 2.7084589   2.8351564          4          0    .5500147    .5500147 |
   5. | 3.3991191   3.4495676          5          0   -.0194454   -.0194454 |
      |---------------------------------------------------------------------|
   6. | 2.8114939   2.9084699          6          0   -.0888811   -.0888811 |
   7. | 2.6208028   2.8786416          7          0    .6807695    .6807695 |
   8. | 2.9864346   2.9916169          8          0   -.1425125   -.1425125 |
      +---------------------------------------------------------------------+
(note: file out_58248/Y_lnearn_ps_ols_pooled_ia.dta not found)
file out_58248/Y_lnearn_ps_ols_pooled_ia.dta saved

pool-stacked weights across resamples for gender_r
final stacking estimator: ols
               learner  mean_weight        rep_1
    logit            1    .20833379    .20833379
    logit            2    .07879726    .07879726
  lassocv            3    .15601816    .15601816
  ridgecv            4    .12502604    .12502604
  lassocv            5   -.00812355   -.00812355
  ridgecv            6   -.03036911   -.03036911
       rf            7    .39670094    .39670094
       rf            8     .1623702     .1623702
       rf            9   -.26324138   -.26324138
gradboost           10    .06645093    .06645093
gradboost           11    .16417587    .16417587
     nnet           12    .01036739    .01036739
     nnet           13    .01661032    .01661032

pool-stacked weights across resamples for lnearn
final stacking estimator: ols
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .01713937    .01713937
      ols            2            0   -.04104182   -.04104182
  lassocv            3            0   -.00302004   -.00302004
  ridgecv            4            0    .55001473    .55001473
  lassocv            5            0   -.01944538   -.01944538
  ridgecv            6            0   -.08888107   -.08888107
       rf            7            0     .6807695     .6807695
       rf            8            0   -.14251247   -.14251247
       rf            9            0    .01519282    .01519282
gradboost           10            0    .05933025    .05933025
gradboost           11            0    .06845684    .06845684
     nnet           12            0    .00120344    .00120344
     nnet           13            0   -.00252824   -.00252824
      ols            1            1   -.02062991   -.02062991
      ols            2            1   -.02822643   -.02822643
  lassocv            3            1   -.06485097   -.06485097
  ridgecv            4            1    .26915016    .26915016
  lassocv            5            1    .28165753    .28165753
  ridgecv            6            1   -.00587879   -.00587879
       rf            7            1    .51153495    .51153495
       rf            8            1     .3446082     .3446082
       rf            9            1   -.20899078   -.20899078
gradboost           10            1   -.05588984   -.05588984
gradboost           11            1    .05352369    .05352369
     nnet           12            1   -.00269774   -.00269774
     nnet           13            1    .02630791    .02630791

D_gender_r_ps[13,3]
               learner  mean_weight        rep_1
    logit            1    .20833379    .20833379
    logit            2    .07879726    .07879726
  lassocv            3    .15601816    .15601816
  ridgecv            4    .12502604    .12502604
  lassocv            5   -.00812355   -.00812355
  ridgecv            6   -.03036911   -.03036911
       rf            7    .39670094    .39670094
       rf            8     .1623702     .1623702
       rf            9   -.26324138   -.26324138
gradboost           10    .06645093    .06645093
gradboost           11    .16417587    .16417587
     nnet           12    .01036739    .01036739
     nnet           13    .01661032    .01661032

      +----------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gende~2   D_gende~3 |
      |----------------------------------------------|
   1. | .80295328          1    .2083338    .2083338 |
   2. | .42429371          2    .0787973    .0787973 |
   3. | .10577953          3    .1560182    .1560182 |
   4. |   .172671          4     .125026     .125026 |
   5. | .57654568          5   -.0081235   -.0081235 |
      |----------------------------------------------|
   6. | .92301793          6   -.0303691   -.0303691 |
   7. | .84776967          7    .3967009    .3967009 |
   8. | .92630286          8    .1623702    .1623702 |
      +----------------------------------------------+
(note: file out_58248/D_gender_r_ps_ols_pooled_ia.dta not found)
file out_58248/D_gender_r_ps_ols_pooled_ia.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.105    (0.018)
  ss  1  [shortstack]          [ss]          [ss]    -0.105    (0.018)
  ps  1   [poolstack]          [ps]          [ps]    -0.105    (0.018)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1047104   .0180158    -5.81   0.000    -.1400207      -.0694
------------------------------------------------------------------------------
Stacking final estimator: avg



Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.105    (0.018)
  ss  1  [shortstack]          [ss]          [ss]    -0.105    (0.018)
  ps  1   [poolstack]          [ps]          [ps]    -0.105    (0.018)

Stacking DDML model (ATET)
E[y|X,D=0]   = Y1_pystacked0_1                     Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1
E[D|X]       = D1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1047104   .0180158    -5.81   0.000    -.1400207      -.0694
------------------------------------------------------------------------------
Stacking final estimator: avg

(note: variable final was str3, now str10 to accommodate using data's values)
file out_58248/results.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  ss  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.105    (0.018)
  ss  1  [shortstack]          [ss]          [ss]    -0.105    (0.018)
  ps  1   [poolstack]          [ps]          [ps]    -0.105    (0.018)

Shortstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ss0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ss1
E[D|X]       = D_gender_r_ss_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1047104   .0180158    -5.81   0.000    -.1400207      -.0694
------------------------------------------------------------------------------
Stacking final estimator: avg

(note: variable final was str3, now str10 to accommodate using data's values)
file out_58248/results.dta saved


Model:                  interactive, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results (ATET):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  ps  1  Y1_pystacked  Y1_pystacked  D1_pystacked    -0.105    (0.018)
  ss  1  [shortstack]          [ss]          [ss]    -0.105    (0.018)
  ps  1   [poolstack]          [ps]          [ps]    -0.105    (0.018)

Poolstack DDML model (ATET)
E[y|X,D=0]   = Y_lnearn_ps0_1                      Number of obs   =      4836
E[y|X,D=1]   = Y_lnearn_ps1
E[D|X]       = D_gender_r_ps_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1047104   .0180158    -5.81   0.000    -.1400207      -.0694
------------------------------------------------------------------------------
Stacking final estimator: avg

(note: variable final was str3, now str10 to accommodate using data's values)
file out_58248/results.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

Y1_pystacked_w_mn[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

      +-------------------------------------------+
      | Y1_pys~1   Y1_pys~2   Y1_pys~3   Y1_pys~4 |
      |-------------------------------------------|
   1. |        1          0   .0769231   .0769231 |
   2. |        2          0   .0769231   .0769231 |
   3. |        3          0   .0769231   .0769231 |
   4. |        4          0   .0769231   .0769231 |
   5. |        5          0   .0769231   .0769231 |
      |-------------------------------------------|
   6. |        6          0   .0769231   .0769231 |
   7. |        7          0   .0769231   .0769231 |
   8. |        8          0   .0769231   .0769231 |
      +-------------------------------------------+
(note: file out_58248/Y1_pystacked_w_mn_avg_regular_ia.dta not found)
file out_58248/Y1_pystacked_w_mn_avg_regular_ia.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

D1_pystacked_w_mn[13,3]
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

      +--------------------------------+
      | D1_pys~1   D1_pys~2   D1_pys~3 |
      |--------------------------------|
   1. |        1   .0769231   .0769231 |
   2. |        2   .0769231   .0769231 |
   3. |        3   .0769231   .0769231 |
   4. |        4   .0769231   .0769231 |
   5. |        5   .0769231   .0769231 |
      |--------------------------------|
   6. |        6   .0769231   .0769231 |
   7. |        7   .0769231   .0769231 |
   8. |        8   .0769231   .0769231 |
      +--------------------------------+
(note: file out_58248/D1_pystacked_w_mn_avg_regular_ia.dta not found)
file out_58248/D1_pystacked_w_mn_avg_regular_ia.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

short-stacked weights across resamples for lnearn
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

short-stacked weights across resamples for gender_r
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

short-stacked weights across resamples for lnearn
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

Y_lnearn_ss[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

      +-------------------------------------------------------------------+
      | Y_lne~1_1   Y_lne~0_1   Y_lne~s1   Y_lnea~2   Y_lnea~3   Y_lnea~4 |
      |-------------------------------------------------------------------|
   1. | 2.6182954   2.7431968          1          0   .0769231   .0769231 |
   2. | 3.0008595    3.181136          2          0   .0769231   .0769231 |
   3. | 2.7134736   2.8565799          3          0   .0769231   .0769231 |
   4. | 2.4480897   2.5500025          4          0   .0769231   .0769231 |
   5. | 3.1076589    3.210454          5          0   .0769231   .0769231 |
      |-------------------------------------------------------------------|
   6. | 2.5820593    2.728088          6          0   .0769231   .0769231 |
   7. | 2.4901831   2.5592469          7          0   .0769231   .0769231 |
   8. | 2.9153255   2.7842046          8          0   .0769231   .0769231 |
      +-------------------------------------------------------------------+
(note: file out_58248/Y_lnearn_ss_avg_short_ia.dta not found)
file out_58248/Y_lnearn_ss_avg_short_ia.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

short-stacked weights across resamples for lnearn
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

D_gender_r_ss[13,3]
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .72386039          1   .0769231   .0769231 |
   2. | .43726713          2   .0769231   .0769231 |
   3. | .16378685          3   .0769231   .0769231 |
   4. | .26337248          4   .0769231   .0769231 |
   5. |  .5660262          5   .0769231   .0769231 |
      |--------------------------------------------|
   6. |  .7822405          6   .0769231   .0769231 |
   7. | .73368944          7   .0769231   .0769231 |
   8. | .76662081          8   .0769231   .0769231 |
      +--------------------------------------------+
(note: file out_58248/D_gender_r_ss_avg_short_ia.dta not found)
file out_58248/D_gender_r_ss_avg_short_ia.dta saved

pool-stacked weights across resamples for gender_r
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

pool-stacked weights across resamples for lnearn
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

pool-stacked weights across resamples for gender_r
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

pool-stacked weights across resamples for lnearn
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

Y_lnearn_ps[26,4]
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

      +-------------------------------------------------------------------+
      | Y_lne~1_1   Y_lne~0_1   Y_lne~s1   Y_lnea~2   Y_lnea~3   Y_lnea~4 |
      |-------------------------------------------------------------------|
   1. | 2.6182954   2.7431968          1          0   .0769231   .0769231 |
   2. | 3.0008595    3.181136          2          0   .0769231   .0769231 |
   3. | 2.7134736   2.8565799          3          0   .0769231   .0769231 |
   4. | 2.4480897   2.5500025          4          0   .0769231   .0769231 |
   5. | 3.1076589    3.210454          5          0   .0769231   .0769231 |
      |-------------------------------------------------------------------|
   6. | 2.5820593    2.728088          6          0   .0769231   .0769231 |
   7. | 2.4901831   2.5592469          7          0   .0769231   .0769231 |
   8. | 2.9153255   2.7842046          8          0   .0769231   .0769231 |
      +-------------------------------------------------------------------+
(note: file out_58248/Y_lnearn_ps_avg_pooled_ia.dta not found)
file out_58248/Y_lnearn_ps_avg_pooled_ia.dta saved

pool-stacked weights across resamples for gender_r
final stacking estimator: avg
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

pool-stacked weights across resamples for lnearn
final stacking estimator: avg
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .07692308    .07692308
      ols            2            0    .07692308    .07692308
  lassocv            3            0    .07692308    .07692308
  ridgecv            4            0    .07692308    .07692308
  lassocv            5            0    .07692308    .07692308
  ridgecv            6            0    .07692308    .07692308
       rf            7            0    .07692308    .07692308
       rf            8            0    .07692308    .07692308
       rf            9            0    .07692308    .07692308
gradboost           10            0    .07692308    .07692308
gradboost           11            0    .07692308    .07692308
     nnet           12            0    .07692308    .07692308
     nnet           13            0    .07692308    .07692308
      ols            1            1    .07692308    .07692308
      ols            2            1    .07692308    .07692308
  lassocv            3            1    .07692308    .07692308
  ridgecv            4            1    .07692308    .07692308
  lassocv            5            1    .07692308    .07692308
  ridgecv            6            1    .07692308    .07692308
       rf            7            1    .07692308    .07692308
       rf            8            1    .07692308    .07692308
       rf            9            1    .07692308    .07692308
gradboost           10            1    .07692308    .07692308
gradboost           11            1    .07692308    .07692308
     nnet           12            1    .07692308    .07692308
     nnet           13            1    .07692308    .07692308

D_gender_r_ps[13,3]
               learner  mean_weight        rep_1
    logit            1    .07692308    .07692308
    logit            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .72386039          1   .0769231   .0769231 |
   2. | .43726713          2   .0769231   .0769231 |
   3. | .16378685          3   .0769231   .0769231 |
   4. | .26337248          4   .0769231   .0769231 |
   5. |  .5660262          5   .0769231   .0769231 |
      |--------------------------------------------|
   6. |  .7822405          6   .0769231   .0769231 |
   7. | .73368944          7   .0769231   .0769231 |
   8. | .76662081          8   .0769231   .0769231 |
      +--------------------------------------------+
(note: file out_58248/D_gender_r_ps_avg_pooled_ia.dta not found)
file out_58248/D_gender_r_ps_avg_pooled_ia.dta saved
. 
.         forvalues i = 1(1)$L {
  2.                         ddml estimate, y1(Y1_pystacked1_L`i'_1) y0(Y1_pyst
> acked0_L`i'_1) ///
>                                                         d(D1_pystacked_L`i'_1
> ) robust atet foldvar(m0_sample_1  )
  3.                         regsave gender_r using `folder'/results.dta, ci //
> /
>                                                 addlabel(model,interactive,se
> ed,`seed',final,indiv,learner,`i') ///
>                                                 append
  4.         }

E[y|X,D=0]   = Y1_pystacked0_L1_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L1_1
E[D|X]       = D1_pystacked_L1_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1549942   .0994886    -1.56   0.119    -.3499883    .0399998
------------------------------------------------------------------------------
Warning: 136 propensity scores trimmed to lower limit ..
Warning: 41 propensity scores trimmed to upper limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_58248/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L2_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L2_1
E[D|X]       = D1_pystacked_L2_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |   -.120029   .0160782    -7.47   0.000    -.1515417   -.0885162
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_58248/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L3_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L3_1
E[D|X]       = D1_pystacked_L3_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0129499   .0630025    -0.21   0.837    -.1364325    .1105327
------------------------------------------------------------------------------
Warning: 67 propensity scores trimmed to lower limit ..
Warning: 6 propensity scores trimmed to upper limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_58248/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L4_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L4_1
E[D|X]       = D1_pystacked_L4_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0651116   .1348334    -0.48   0.629    -.3293802     .199157
------------------------------------------------------------------------------
Warning: 90 propensity scores trimmed to lower limit ..
Warning: 20 propensity scores trimmed to upper limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_58248/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L5_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L5_1
E[D|X]       = D1_pystacked_L5_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |   .0024415   .0784006     0.03   0.975    -.1512208    .1561038
------------------------------------------------------------------------------
Warning: 73 propensity scores trimmed to lower limit ..
Warning: 9 propensity scores trimmed to upper limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_58248/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L6_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L6_1
E[D|X]       = D1_pystacked_L6_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.2811663   .2723925    -1.03   0.302    -.8150457    .2527131
------------------------------------------------------------------------------
Warning: 57 propensity scores trimmed to lower limit ..
Warning: 12 propensity scores trimmed to upper limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_58248/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L7_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L7_1
E[D|X]       = D1_pystacked_L7_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0862207   .0186856    -4.61   0.000    -.1228439   -.0495976
------------------------------------------------------------------------------
Warning: 4 propensity scores trimmed to lower limit ..
Warning: 1 propensity scores trimmed to upper limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_58248/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L8_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L8_1
E[D|X]       = D1_pystacked_L8_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1050696   .0156188    -6.73   0.000    -.1356819   -.0744573
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_58248/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L9_1                  Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L9_1
E[D|X]       = D1_pystacked_L9_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1102018   .0148929    -7.40   0.000    -.1393914   -.0810123
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_58248/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L10_1                 Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L10_1
E[D|X]       = D1_pystacked_L10_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0876467   .0190285    -4.61   0.000    -.1249419   -.0503515
------------------------------------------------------------------------------
Warning: 3 propensity scores trimmed to lower limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_58248/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L11_1                 Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L11_1
E[D|X]       = D1_pystacked_L11_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0584898   .0483697    -1.21   0.227    -.1532927    .0363131
------------------------------------------------------------------------------
Warning: 95 propensity scores trimmed to lower limit ..
Warning: 20 propensity scores trimmed to upper limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_58248/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L12_1                 Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L12_1
E[D|X]       = D1_pystacked_L12_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1119478   .0173883    -6.44   0.000    -.1460283   -.0778673
------------------------------------------------------------------------------
Warning: 34 propensity scores trimmed to lower limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_58248/results.dta saved

E[y|X,D=0]   = Y1_pystacked0_L13_1                 Number of obs   =      4836
E[y|X,D=1]   = Y1_pystacked1_L13_1
E[D|X]       = D1_pystacked_L13_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |   .0796857   .2371213     0.34   0.737    -.3850635     .544435
------------------------------------------------------------------------------
Warning: 178 propensity scores trimmed to lower limit ..
Warning: 163 propensity scores trimmed to upper limit ..
(note: variable final was str5, now str10 to accommodate using data's values)
file out_58248/results.dta saved
. 
. }       

.         
. *****************************************************************************
> *  
. *** interactive NX: short-stacking                                           
>                                       ***
. *****************************************************************************
> *
. 
. if (`estimator'==3) {
. 
. gen one = 1     
. 
.         cap drop y0base*
.         cap drop dbase*
.         cap drop y1base*
. 
.         *** no cross-fitting
.         pystacked lnearn $X_expanded   $pystring_reg0  if gender_r == 0, type
> (reg) njobs($cores)  
.                 mat nxw_ia_y0 = e(weights)
.                 mat list nxw_ia_y0
.                                 preserve
.                                 svmat nxw_ia_y0
.                                 keep nxw_ia_y0*
.                                 save `folder'/nxw_ia_y0, replace
.                                 restore
.         predict y0base0, xb
.         predict y0base, base
. 
.         pystacked lnearn $X_expanded  $pystring_reg0 if gender_r == 1  , type
> (reg) njobs($cores)  
.                 mat nxw_ia_y1 = e(weights)
.                 mat list nxw_ia_y1
.                                 preserve
.                                 svmat nxw_ia_y1
.                                 keep nxw_ia_y1*
.                                 save `folder'/nxw_ia_y1, replace
.                                 restore
.         predict y1base0, xb
.         predict y1base, base
. 
.         pystacked gender_r $X_expanded $pystring_class  
.                 mat nxw_ia_d = e(weights)
.                 mat list nxw_ia_d
.                                 preserve
.                                 svmat nxw_ia_d
.                                 keep nxw_ia_d*
.                                 save `folder'/nxw_ia_d, replace
.                                 restore         
.         predict dbase0, pr
.         predict dbase, base pr
.         
.         forvalues i = 0(1)$L {
  2.                         _estimate_ate interactive, yname(lnearn) dname(gen
> der_r) ///
>                                                 y0(y0base`i') y1(y1base`i') d
> (dbase`i') ///
>                                                 atet foldid(one) robust model
> (interactive)
  3.                         regsave gender_r using `folder'/results.dta, ///
>                                                 ci addlabel(model,nxinter,see
> d,`seed',final,nx,learner,`i') append
  4.         }
.                 
. }

.         
. *****************************************************************************
> *  
. *** partial NX: short-stacking                                               
>                                       ***
. *****************************************************************************
> *
. 
. if (`estimator'==4) {
.         
. cap gen one = 1 
. 
.         cap drop Ybase* 
.         cap drop Dbase*
. 
.         *** no cross-fitting
.         pystacked lnearn $X_expanded $pystring_reg 
.                 mat nxw_y = e(weights)
.                 mat list nxw_y
.                                 preserve
.                                 svmat nxw_y
.                                 keep nxw_y*
.                                 save `folder'/nxw_y, replace
.                                 restore
.         predict Ybase0
.         predict Ybase, basexb
. 
.         pystacked gender_r $X_expanded $pystring_reg 
.                 mat nxw_d = e(weights)
.                 mat list nxw_d
.                                 preserve
.                                 svmat nxw_d
.                                 keep nxw_d*
.                                 save `folder'/nxw_d, replace
.                                 restore         
.         predict Dbase0
.         predict Dbase, basexb
. 
.         forvalues i = 0(1)$L {
  2.                 cap drop Ytil
  3.                 cap drop Dtil
  4.                 gen Ytil = lnearn - Ybase`i'
  5.                 gen Dtil = gender_r - Dbase`i'
  6.                 reg Ytil Dtil, robust
  7.                 regsave Dtil using `folder'/results.dta, ///
>                         ci addlabel(model,nxpartial,seed,`seed',final,nx,lear
> ner,`i') append
  8.         }
. 
. }

.         
. cap log close
