-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /cluster/home/kahrens/ddml_applied/GWG/Output/GWG_36931_1.txt
  log type:  text
 opened on:  10 Dec 2023, 19:14:52

. 
. which ddml
/cluster/home/kahrens/ado/plus/d/ddml.ado
*! ddml v1.4.3
*! last edited: 17aug2023
*! authors: aa/ms

. which pystacked
/cluster/home/kahrens/ado/plus/p/pystacked.ado
*! pystacked v0.7.5
*! last edited: 7aug2023
*! authors: aa/ms

. 
. set seed `seed'

. local folder out_`seed'

. 
. use "../Data/gender_gap_ML_processed", clear

. 
. cap mkdir `folder'

. 
. *****************************************************************************
> ***
. ***  controls
. *****************************************************************************
> ***
. 
. // create squared age and tenure here
. gen age_r2 = age_r^2

. gen tenure2 = tenure^2
(2 missing values generated)

. 
. // no base categories
. global continuous                                                            
>                                                            ///
>         age_r                                                                
>                                                                    /// no mis
> sing
>         yrsqual         /* years of education (derived) */                   
>                                    /// 355 missing
>         /// leavedu             /* age when left education (derived) */      
>                            /// 1,081 missing
>         pvlit1          /* literacy score: plausible value 1 (also 2-10 avail
> ) */       /// no missing
>         pvnum1          /* numeracy score: plausible value 1 (also 2-10 avail
> ) */       /// no missing
>         tenure          /* tenure = years in work for current employer */    
>                    /// 2 missing
>                                                                              
>                                                                            //

. // add second order terms here
. global continuous $continuous age_r2 tenure2

. 
. global discrete0                                                             
>                                                            ///             
>         b_q01a          /* education, highest level attained */              
>                            /// no missing
>         b_q01b          /* area of study */                                  
>                                                    /// 434 missing
>         d_q06c          /* part of a larger organization */                  
>                                    /// 13 missing
>         d_q08a          /* management position */                            
>                                            /// no missing
>         d_q09           /* type of contract */                               
>                                            /// 12 missing
>         d_q10_t1        /* hours per week at this job or business */         
>                    /// 1 missing
>         d_q14           /* job satisfaction */                               
>                                            /// 1 missing
>         i_q08           /* health status */                                  
>                                                    /// 2 missing
>         j_q02a          /* living with a partner */                          
>                                            /// 899 missing
>         j_q03d1_c       /* age of youngest child */                          
>                                            /// 2,718 missing
>         j_q04c1_c       /* immigration: age */                               
>                                            /// 4,375 missing
>         j_q06b          /* mother's highest level of educ */                 
>                            /// 445 missing
>         j_q07b          /* father's highest level of educ */                 
>                            /// 515 missing
>         j_q03b          /* number of children*/                              
>                                            /// 1,856 missing
>         impar           /* immigration: parents */                           
>                                            /// 21 missing
>         imgen           /* immigration: generation */                        
>                                    /// 344 missing
>         nfe12jr         /* informal job-related educ in prev 12 months */    
>                    /// 116 missing
>         nfe12njr        /* informal non-job-related educ in prev 12 months */
>            /// 116 missing
>                                                                              
>                                                                            //
>                                                                              
>                                                          

. global personality                                                           
>                                                            ///
>         i_q04b          /* Learning strategies, Relate new ideas into real li
> fe */      /// 16 missing
>         i_q04d          /* Learning strategies, Like learning new things */  
>                    /// no missing
>         i_q04h          /* Learning strategies, Attribute something new */   
>                    /// 10 missing
>         i_q04j          /* Learning strategies, Deal with difficult things */
>            /// no missing
>         i_q04l          /* Learning strategies, Fit different ideas together 
> */         /// 5 missing
>         i_q04m          /* Learning strategies, Looking for additional info *
> /          /// 1 missing
>         i_q05f          /* Cultural engagement, Voluntary non-profit work */ 
>            /// no missing
>         i_q06a          /* Political efficacy, No influence on the government
>  */        /// 14 missing
>         i_q07a          /* Social trust, Trust only few people */            
>                            /// 4 missing
>         i_q07b          /* Social trust, Other people take advantage of you *
> /          /// 6 missing
>                                                                              
>                                                                            //

. global discrete $discrete0                                                   
>                                                    ///
>         new_reg_tl2     /* geographical region */                            
>                                            /// 2 missing
>         new_isco1c      /* occupation */                                     
>                                                    /// no missing
>         new_isic1c      /* industry */                                       
>                                                    // no missing

. 
. global X_simple                                                         ///
>         i.(b_q01a d_q10_t1 j_q03b)                              ///
>         c.($continuous)

. 
. global X_fullinteracted                                         ///
>         i.($discrete0 )                                                 ///
>         i.new_isco1c#i.new_isic1c#i.new_reg_tl2 ///
>         c.($continuous)                  

.         
. global X_cont                                                           ///
>         c.($continuous)##i.($discrete)

. 
. global X_expanded                                                       ///
>         i.($discrete)                                                   ///
>         c.($continuous)                                                 ///
>         c.age_r#i.($discrete)                                   ///
>         c.tenure#i.($discrete)

. 
.         
. 
. *****************************************************************************
> ***
. ***  estimation sample
. *****************************************************************************
> ***
. 
. gen byte touse=1

. markout touse lnearn $X_expanded

. keep if touse
(53 observations deleted)

. 
. 
. *****************************************************************************
> ***
. ***  learners
. *****************************************************************************
> ***
. 
. global cores = 5

. 
. global rf1 min_samples_leaf(1)  max_features(sqrt) n_estimators(500)

. global rf2 min_samples_leaf(50)  max_features(sqrt) n_estimators(500)

. global rf3 min_samples_leaf(100)  max_features(sqrt) n_estimators(500)

. global grad1 n_estimators(500) n_iter_no_change(10)  

. global grad2 n_estimators(500)  

. global nnet1 hidden_layer_sizes(40 20 1 20 50) early_stopping 

. global nnet2 hidden_layer_sizes(30 30 30) early_stopping  

. 
. global pystring_reg0                                                         
>    || ///
>                                         m(ols)                               
>                            || ///
>                                         m(ols) xvars($X_simple)              
>            || ///
>                                         m(lassocv)                           
>                            || ///
>                                         m(ridgecv)                           
>                            || ///
>                                         m(lassocv)      xvars($X_cont)       
>            || ///
>                                         m(ridgecv)      xvars($X_cont)       
>            || ///
>                                         m(rf) opt($rf1)                      
>                    || ///
>                                         m(rf) opt($rf2)                      
>                    || ///
>                                         m(rf) opt($rf3)                      
>                    || ///
>                                         m(gradboost) opt($grad1)             
>            || ///
>                                         m(gradboost) opt($grad2)             
>            || ///
>                                         m(nnet) opt($nnet1)                  
>            || ///
>                                         m(nnet) opt($nnet2)                  
>            || //

. 
. global pystring_reg  $pystring_reg0 , type(reg) njobs($cores) 

.  
. global pystring_class0                                                       
>            || ///
>                                         m(logit)                             
>                            || ///
>                                         m(logit) xvars($X_simple)            
>            || ///
>                                         m(lassocv)                           
>                            || ///
>                                         m(ridgecv)                           
>                            || ///
>                                         m(lassocv)      xvars($X_cont)       
>            || ///
>                                         m(ridgecv)      xvars($X_cont)       
>            || ///
>                                         m(rf) opt($rf1)                      
>                    || ///
>                                         m(rf) opt($rf2)                      
>                    || ///
>                                         m(rf) opt($rf3)                      
>                    || ///
>                                         m(gradboost) opt($grad1)             
>            || ///
>                                         m(gradboost) opt($grad2)             
>            || ///
>                                         m(nnet) opt($nnet1)                  
>            || ///
>                                         m(nnet) opt($nnet2)                  
>            || //                   

.                                 
. global pystring_class $pystring_class0 , type(class) njobs($cores)

.                                         
. global R =1  

. global K=10 

. global L =13

.         
. *****************************************************************************
> *  
. *** ddml: estimation                                                         
>                                               ***
. *****************************************************************************
> *
. 
. if (`estimator'==1) {
. 
.         ddml init partial,  reps($R) kfolds($K)
.         ddml E[Y|X]: pystacked lnearn $X_expanded $pystring_reg
Learner Y1_pystacked added successfully.
.         ddml E[D|X]: pystacked gender_r $X_expanded $pystring_reg
Learner D1_pystacked added successfully.
.         ddml crossfit, shortstack poolstack
Cross-fitting E[y|X] equation: lnearn
Cross-fitting fold 1 2 3 4 5 6 7 8 9 10 ...completed cross-fitting...completed 
> short-stacking...completed pooled-stacking
Cross-fitting E[D|X] equation: gender_r
Cross-fitting fold 1 2 3 4 5 6 7 8 9 10 ...completed cross-fitting...completed 
> short-stacking...completed pooled-stacking
.         ddml estimate, robust


Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  st  1  Y1_pystacked  D1_pystacked    -0.106    (0.017)
  ss  1  [shortstack]          [ss]    -0.104    (0.016)
  ps  1   [poolstack]          [ps]    -0.105    (0.016)

Shortstack DDML model
y-E[y|X]  = y-Y_lnearn_ss_1                        Number of obs   =      4836
D-E[D|X]  = D-D_gender_r_ss_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1041745    .016445    -6.33   0.000    -.1364061   -.0719429
       _cons |  -.0021962   .0063028    -0.35   0.728    -.0145495    .0101572
------------------------------------------------------------------------------
Stacking final estimator: nnls1

.         
.         foreach mat in lnearn_mse gender_r_mse {
  2.                         ddml extract, show(mse)
  3.                         mat `mat' = r(`mat')
  4.                         mat list `mat'
  5.                                 preserve
  6.                                 svmat `mat'
  7.                                 keep `mat'*
  8.                                 keep if _n<=$L
  9.                                 gen stack_type = "conventional" if _n==1
 10.                                 replace stack_type = "pooled" if _n==2
 11.                                 replace stack_type = "short" if _n==3
 12.                                 gen model = "plm"
 13.                                 list if _n<=$L
 14.                                 save `folder'/`mat'_plm_mse, replace
 15.                                 restore 
 16.         }       

MSEs for gender_r:
                 rep   full smp      fold 1      fold 2      fold 3      fold 4
>       fold 5      fold 6      fold 7      fold 8      fold 9     fold 10 
    D1_pystacked   1      0.157       0.151       0.166       0.158       0.161
>        0.155       0.152       0.150       0.161       0.170       0.149  
   D_gender_r_ps   1      0.157       0.151       0.165       0.158       0.160
>        0.155       0.152       0.150       0.161       0.168       0.149  
   D_gender_r_ss   1      0.157       0.150       0.165       0.157       0.160
>        0.155       0.152       0.149       0.161       0.167       0.149  

MSEs for lnearn:
                 rep   full smp      fold 1      fold 2      fold 3      fold 4
>       fold 5      fold 6      fold 7      fold 8      fold 9     fold 10 
    Y1_pystacked   1      0.195       0.257       0.139       0.136       0.164
>        0.156       0.221       0.177       0.243       0.297       0.159  
     Y_lnearn_ps   1      0.194       0.255       0.139       0.136       0.161
>        0.155       0.221       0.177       0.244       0.295       0.160  
     Y_lnearn_ss   1      0.194       0.254       0.140       0.136       0.159
>        0.155       0.220       0.174       0.243       0.295       0.159  

lnearn_mse[3,12]
                      rep  full_sample        fold1        fold2        fold3
Y1_pystacked            1    .19504493    .25664861    .13946864    .13633325
 Y_lnearn_ps            1    .19430519       .25507    .13935363    .13596626
 Y_lnearn_ss            1    .19351711     .2535594    .13959166    .13553491

                    fold4        fold5        fold6        fold7        fold8
Y1_pystacked    .16393212    .15621875    .22108097    .17707323    .24304831
 Y_lnearn_ps    .16051677     .1549002    .22062531    .17696044    .24435424
 Y_lnearn_ss    .15949346    .15542266    .21991811    .17429438    .24326817

                    fold9       fold10
Y1_pystacked    .29739861    .15940576
 Y_lnearn_ps    .29533048    .16013733
 Y_lnearn_ss    .29493021    .15931971
(4,823 observations deleted)
(12 missing values generated)
(1 real change made)
(1 real change made)

     +-----------------------------------------------------------------+
  1. | lnear~e1 | lnear~e2 | lnearn~3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        1 | .1950449 | .2566486 | .1394686 | .1363332 | .1639321 |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     | .1562188 |  .221081 | .1770732 | .2430483 | .2973986 | .1594058 |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |           conventional            |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  2. | lnear~e1 | lnear~e2 | lnearn~3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        1 | .1943052 |   .25507 | .1393536 | .1359663 | .1605168 |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     | .1549002 | .2206253 | .1769604 | .2443542 | .2953305 | .1601373 |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                 pooled            |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  3. | lnear~e1 | lnear~e2 | lnearn~3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        1 | .1935171 | .2535594 | .1395916 | .1355349 | .1594935 |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     | .1554227 | .2199181 | .1742944 | .2432682 | .2949302 | .1593197 |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                  short            |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  4. | lnear~e1 | lnear~e2 | lnearn~3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  5. | lnear~e1 | lnear~e2 | lnearn~3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  6. | lnear~e1 | lnear~e2 | lnearn~3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  7. | lnear~e1 | lnear~e2 | lnearn~3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  8. | lnear~e1 | lnear~e2 | lnearn~3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  9. | lnear~e1 | lnear~e2 | lnearn~3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 10. | lnear~e1 | lnear~e2 | lnearn~3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 11. | lnear~e1 | lnear~e2 | lnearn~3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 12. | lnear~e1 | lnear~e2 | lnearn~3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 13. | lnear~e1 | lnear~e2 | lnearn~3 | lnearn~4 | lnearn~5 | lnearn~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | lnearn~7 | lnearn~8 | lnearn~9 | lnear~10 | lnear~11 | lnear~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+
(note: file out_36931/lnearn_mse_plm_mse.dta not found)
file out_36931/lnearn_mse_plm_mse.dta saved

MSEs for gender_r:
                 rep   full smp      fold 1      fold 2      fold 3      fold 4
>       fold 5      fold 6      fold 7      fold 8      fold 9     fold 10 
    D1_pystacked   1      0.157       0.151       0.166       0.158       0.161
>        0.155       0.152       0.150       0.161       0.170       0.149  
   D_gender_r_ps   1      0.157       0.151       0.165       0.158       0.160
>        0.155       0.152       0.150       0.161       0.168       0.149  
   D_gender_r_ss   1      0.157       0.150       0.165       0.157       0.160
>        0.155       0.152       0.149       0.161       0.167       0.149  

MSEs for lnearn:
                 rep   full smp      fold 1      fold 2      fold 3      fold 4
>       fold 5      fold 6      fold 7      fold 8      fold 9     fold 10 
    Y1_pystacked   1      0.195       0.257       0.139       0.136       0.164
>        0.156       0.221       0.177       0.243       0.297       0.159  
     Y_lnearn_ps   1      0.194       0.255       0.139       0.136       0.161
>        0.155       0.221       0.177       0.244       0.295       0.160  
     Y_lnearn_ss   1      0.194       0.254       0.140       0.136       0.159
>        0.155       0.220       0.174       0.243       0.295       0.159  

gender_r_mse[3,12]
                      rep  full_sample        fold1        fold2        fold3
D1_pystacked            1    .15732821    .15074417    .16574354    .15822312
D_gender_r~s            1    .15682077    .15091301     .1650471    .15750735
D_gender_r~s            1    .15658765    .15002088    .16481975    .15732696

                    fold4        fold5        fold6        fold7        fold8
D1_pystacked     .1613688     .1545837    .15213053    .15047764    .16147623
D_gender_r~s    .16038603    .15483615    .15236328    .14960602    .16128984
D_gender_r~s    .16046417    .15452026    .15236864    .14871791    .16103398

                    fold9       fold10
D1_pystacked     .1699456    .14857482
D_gender_r~s    .16754514      .148703
D_gender_r~s    .16725659    .14933584
(4,823 observations deleted)
(12 missing values generated)
(1 real change made)
(1 real change made)

     +-----------------------------------------------------------------+
  1. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        1 | .1573282 | .1507442 | .1657435 | .1582231 | .1613688 |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     | .1545837 | .1521305 | .1504776 | .1614762 | .1699456 | .1485748 |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |           conventional            |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  2. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        1 | .1568208 |  .150913 | .1650471 | .1575074 |  .160386 |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     | .1548361 | .1523633 |  .149606 | .1612898 | .1675451 |  .148703 |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                 pooled            |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  3. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        1 | .1565877 | .1500209 | .1648197 |  .157327 | .1604642 |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     | .1545203 | .1523686 | .1487179 |  .161034 | .1672566 | .1493358 |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                  short            |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  4. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  5. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  6. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  7. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  8. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  9. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 10. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 11. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 12. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 13. | gende~e1 | gende~e2 | gender~3 | gender~4 | gender~5 | gender~6 |
     |        . |        . |        . |        . |        . |        . |
     |----------+----------+----------+----------+----------+----------|
     | gender~7 | gender~8 | gender~9 | gende~10 | gende~11 | gende~12 |
     |        . |        . |        . |        . |        . |        . |
     |-----------------------------------------------------------------|
     |             stack_type            |            model            |
     |                                   |              plm            |
     +-----------------------------------------------------------------+
(note: file out_36931/gender_r_mse_plm_mse.dta not found)
file out_36931/gender_r_mse_plm_mse.dta saved
. 
.         cap drop mse_*
.         foreach var of varlist Y1_* {
  2.                  cap drop sqerr_`var'
  3.                  gen double sqerr_`var'=(lnearn-`var')^2
  4.                  sum sqerr_`var', meanonly
  5.                  gen double mse_`var'=r(mean) if _n ==1 
  6.         }
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
.         foreach var of varlist D1_* {
  2.                  cap drop sqerr_`var'
  3.                  gen double sqerr_`var'=(gender_r-`var')^2
  4.                  sum sqerr_`var', meanonly
  5.                  gen double mse_`var'=r(mean) if _n ==1 
  6.         }
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
(4,835 missing values generated)
.         preserve
.                 keep mse_*
.                 keep if _n==1
(4,835 observations deleted)
.                 save `folder'/plm_mse, replace
(note: file out_36931/plm_mse.dta not found)
file out_36931/plm_mse.dta saved
.         restore
.         cap drop mse_*
. 
.         ** initialize results file
.         regsave gender_r using `folder'/results.dta, ci addlabel(model,partia
> l,seed,`seed',final,init,learner,-99) replace
(note: file out_36931/results.dta not found)
file out_36931/results.dta saved
. 
.         foreach final in nnls1 singlebest ols avg {
  2. 
.                 ddml estimate, robust finalest(`final')
  3.         
.                         // regular stacking results
.                         ddml estimate, mname(m0) spec(st) replay  
  4.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,partial,seed,`seed',final,`final',learner,-1) append
  5.                         
.                         // shortstacking results
.                         ddml estimate, mname(m0) spec(ss) replay 
  6.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,partial,seed,`seed',final,`final',learner,-2) append
  7.                         
.                         // poolstacking results
.                         ddml estimate, mname(m0) spec(ps) replay  
  8.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,partial,seed,`seed',final,`final',learner,-3) append     
  9.                 
.                         // pystacked weights
.                         ddml extract, show(stweights)   
 10.                         foreach mat in Y1_pystacked_w_mn D1_pystacked_w_mn
>  {
 11.                                         ddml extract, show(stweights)   
 12.                                         mat `mat' = r(`mat')
 13.                                         mat list `mat'
 14.                                                 preserve
 15.                                                 svmat `mat'
 16.                                                 keep `mat'*
 17.                                                 list if _n<=4
 18.                                                 save `folder'/`mat'_`final
> '_regular, replace
 19.                                                 restore
 20.                         }       
 21.                         // shortstacked weights
.                         ddml extract, show(ssweights)
 22.                         foreach mat in Y_lnearn_ss D_gender_r_ss {
 23.                                         qui ddml extract, show(ssweights)
 24.                                         mat `mat' = r(`mat')
 25.                                         mat list `mat'
 26.                                                 preserve
 27.                                                 svmat `mat'
 28.                                                 keep `mat'*
 29.                                                 list if _n<=4
 30.                                                 save `folder'/`mat'_`final
> '_short, replace
 31.                                                 restore
 32.                         }       
 33.                         // poolstacked weights
. 
.                         foreach mat in Y_lnearn_ps D_gender_r_ps {
 34.                                         qui ddml extract, show(psweights)
 35.                                         mat `mat' = r(`mat')
 36.                                         mat list `mat'
 37.                                                 preserve
 38.                                                 svmat `mat'
 39.                                                 keep `mat'*
 40.                                                 list if _n<=4
 41.                                                 save `folder'/`mat'_`final
> '_pooled, replace
 42.                                                 restore
 43.                         }       
 44.         
.         }


Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  st  1  Y1_pystacked  D1_pystacked    -0.106    (0.017)
  ss  1  [shortstack]          [ss]    -0.104    (0.016)
  ps  1   [poolstack]          [ps]    -0.105    (0.016)

Shortstack DDML model
y-E[y|X]  = y-Y_lnearn_ss_1                        Number of obs   =      4836
D-E[D|X]  = D-D_gender_r_ss_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1041745    .016445    -6.33   0.000    -.1364061   -.0719429
       _cons |  -.0021962   .0063028    -0.35   0.728    -.0145495    .0101572
------------------------------------------------------------------------------
Stacking final estimator: nnls1



Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  st  1  Y1_pystacked  D1_pystacked    -0.106    (0.017)
  ss  1  [shortstack]          [ss]    -0.104    (0.016)
  ps  1   [poolstack]          [ps]    -0.105    (0.016)

Stacking DDML model
y-E[y|X]  = y-Y1_pystacked_1                       Number of obs   =      4836
D-E[D|X]  = D-D1_pystacked_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1057781   .0165409    -6.39   0.000    -.1381976   -.0733586
       _cons |    -.00164   .0063276    -0.26   0.795    -.0140418    .0107618
------------------------------------------------------------------------------
Stacking final estimator: nnls1

file out_36931/results.dta saved


Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  ss  1  Y1_pystacked  D1_pystacked    -0.104    (0.016)
  ss  1  [shortstack]          [ss]    -0.104    (0.016)
  ps  1   [poolstack]          [ps]    -0.105    (0.016)

Shortstack DDML model
y-E[y|X]  = y-Y_lnearn_ss_1                        Number of obs   =      4836
D-E[D|X]  = D-D_gender_r_ss_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1041745    .016445    -6.33   0.000    -.1364061   -.0719429
       _cons |  -.0021962   .0063028    -0.35   0.728    -.0145495    .0101572
------------------------------------------------------------------------------
Stacking final estimator: nnls1

file out_36931/results.dta saved


Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  ps  1  Y1_pystacked  D1_pystacked    -0.105    (0.016)
  ss  1  [shortstack]          [ss]    -0.104    (0.016)
  ps  1   [poolstack]          [ps]    -0.105    (0.016)

Poolstack DDML model
y-E[y|X]  = y-Y_lnearn_ps_1                        Number of obs   =      4836
D-E[D|X]  = D-D_gender_r_ps_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1048387   .0164487    -6.37   0.000    -.1370775   -.0725998
       _cons |   -.002097    .006315    -0.33   0.740    -.0144742    .0102802
------------------------------------------------------------------------------
Stacking final estimator: nnls1

file out_36931/results.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: nnls1
               learner  mean_weight        rep_1
      ols            1    .08457548    .08457548
      ols            2    5.634e-17    5.634e-17
  lassocv            3    .25707593    .25707593
  ridgecv            4    5.509e-17    5.509e-17
  lassocv            5    4.759e-17    4.759e-17
  ridgecv            6    .00159897    .00159897
       rf            7    .39201952    .39201952
       rf            8    5.369e-17    5.369e-17
       rf            9    8.277e-17    8.277e-17
gradboost           10    .02748506    .02748506
gradboost           11    .20088216    .20088216
     nnet           12    .02021111    .02021111
     nnet           13    .01615178    .01615178

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: nnls1
               learner  mean_weight        rep_1
      ols            1    .03583925    .03583925
      ols            2    9.889e-17    9.889e-17
  lassocv            3    .08260116    .08260116
  ridgecv            4    .07448152    .07448152
  lassocv            5    .05000737    .05000737
  ridgecv            6    .17605209    .17605209
       rf            7    .41298442    .41298442
       rf            8    8.751e-17    8.751e-17
       rf            9    1.411e-16    1.411e-16
gradboost           10    .01644922    .01644922
gradboost           11    .12243388    .12243388
     nnet           12    .00934711    .00934711
     nnet           13    .01980399    .01980399

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: nnls1
               learner  mean_weight        rep_1
      ols            1    .08457548    .08457548
      ols            2    5.634e-17    5.634e-17
  lassocv            3    .25707593    .25707593
  ridgecv            4    5.509e-17    5.509e-17
  lassocv            5    4.759e-17    4.759e-17
  ridgecv            6    .00159897    .00159897
       rf            7    .39201952    .39201952
       rf            8    5.369e-17    5.369e-17
       rf            9    8.277e-17    8.277e-17
gradboost           10    .02748506    .02748506
gradboost           11    .20088216    .20088216
     nnet           12    .02021111    .02021111
     nnet           13    .01615178    .01615178

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: nnls1
               learner  mean_weight        rep_1
      ols            1    .03583925    .03583925
      ols            2    9.889e-17    9.889e-17
  lassocv            3    .08260116    .08260116
  ridgecv            4    .07448152    .07448152
  lassocv            5    .05000737    .05000737
  ridgecv            6    .17605209    .17605209
       rf            7    .41298442    .41298442
       rf            8    8.751e-17    8.751e-17
       rf            9    1.411e-16    1.411e-16
gradboost           10    .01644922    .01644922
gradboost           11    .12243388    .12243388
     nnet           12    .00934711    .00934711
     nnet           13    .01980399    .01980399

Y1_pystacked_w_mn[13,3]
               learner  mean_weight        rep_1
      ols            1    .03583925    .03583925
      ols            2    9.889e-17    9.889e-17
  lassocv            3    .08260116    .08260116
  ridgecv            4    .07448152    .07448152
  lassocv            5    .05000737    .05000737
  ridgecv            6    .17605209    .17605209
       rf            7    .41298442    .41298442
       rf            8    8.751e-17    8.751e-17
       rf            9    1.411e-16    1.411e-16
gradboost           10    .01644922    .01644922
gradboost           11    .12243388    .12243388
     nnet           12    .00934711    .00934711
     nnet           13    .01980399    .01980399

      +--------------------------------+
      | Y1_pys~1   Y1_pys~2   Y1_pys~3 |
      |--------------------------------|
   1. |        1   .0358392   .0358392 |
   2. |        2   9.89e-17   9.89e-17 |
   3. |        3   .0826012   .0826012 |
   4. |        4   .0744815   .0744815 |
      +--------------------------------+
(note: file out_36931/Y1_pystacked_w_mn_nnls1_regular.dta not found)
file out_36931/Y1_pystacked_w_mn_nnls1_regular.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: nnls1
               learner  mean_weight        rep_1
      ols            1    .08457548    .08457548
      ols            2    5.634e-17    5.634e-17
  lassocv            3    .25707593    .25707593
  ridgecv            4    5.509e-17    5.509e-17
  lassocv            5    4.759e-17    4.759e-17
  ridgecv            6    .00159897    .00159897
       rf            7    .39201952    .39201952
       rf            8    5.369e-17    5.369e-17
       rf            9    8.277e-17    8.277e-17
gradboost           10    .02748506    .02748506
gradboost           11    .20088216    .20088216
     nnet           12    .02021111    .02021111
     nnet           13    .01615178    .01615178

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: nnls1
               learner  mean_weight        rep_1
      ols            1    .03583925    .03583925
      ols            2    9.889e-17    9.889e-17
  lassocv            3    .08260116    .08260116
  ridgecv            4    .07448152    .07448152
  lassocv            5    .05000737    .05000737
  ridgecv            6    .17605209    .17605209
       rf            7    .41298442    .41298442
       rf            8    8.751e-17    8.751e-17
       rf            9    1.411e-16    1.411e-16
gradboost           10    .01644922    .01644922
gradboost           11    .12243388    .12243388
     nnet           12    .00934711    .00934711
     nnet           13    .01980399    .01980399

D1_pystacked_w_mn[13,3]
               learner  mean_weight        rep_1
      ols            1    .08457548    .08457548
      ols            2    5.634e-17    5.634e-17
  lassocv            3    .25707593    .25707593
  ridgecv            4    5.509e-17    5.509e-17
  lassocv            5    4.759e-17    4.759e-17
  ridgecv            6    .00159897    .00159897
       rf            7    .39201952    .39201952
       rf            8    5.369e-17    5.369e-17
       rf            9    8.277e-17    8.277e-17
gradboost           10    .02748506    .02748506
gradboost           11    .20088216    .20088216
     nnet           12    .02021111    .02021111
     nnet           13    .01615178    .01615178

      +--------------------------------+
      | D1_pys~1   D1_pys~2   D1_pys~3 |
      |--------------------------------|
   1. |        1   .0845755   .0845755 |
   2. |        2   5.63e-17   5.63e-17 |
   3. |        3   .2570759   .2570759 |
   4. |        4   5.51e-17   5.51e-17 |
      +--------------------------------+
(note: file out_36931/D1_pystacked_w_mn_nnls1_regular.dta not found)
file out_36931/D1_pystacked_w_mn_nnls1_regular.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: nnls1
               learner  mean_weight        rep_1
      ols            1    .17870465    .17870465
      ols            2    9.233e-17    9.233e-17
  lassocv            3     .1655108     .1655108
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7    .44536442    .44536442
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11    .21042014    .21042014
     nnet           12            0            0
     nnet           13    1.095e-16    1.095e-16

short-stacked weights across resamples for lnearn
final stacking estimator: nnls1
               learner  mean_weight        rep_1
      ols            1    1.379e-16    1.379e-16
      ols            2    1.566e-16    1.566e-16
  lassocv            3    1.080e-16    1.080e-16
  ridgecv            4    1.983e-16    1.983e-16
  lassocv            5    7.175e-17    7.175e-17
  ridgecv            6    .42430928    .42430928
       rf            7    .35197158    .35197158
       rf            8    5.180e-17    5.180e-17
       rf            9    2.749e-16    2.749e-16
gradboost           10     .0715962     .0715962
gradboost           11    .15212295    .15212295
     nnet           12    2.817e-16    2.817e-16
     nnet           13    2.193e-16    2.193e-16

Y_lnearn_ss[13,3]
               learner  mean_weight        rep_1
      ols            1    1.379e-16    1.379e-16
      ols            2    1.566e-16    1.566e-16
  lassocv            3    1.080e-16    1.080e-16
  ridgecv            4    1.983e-16    1.983e-16
  lassocv            5    7.175e-17    7.175e-17
  ridgecv            6    .42430928    .42430928
       rf            7    .35197158    .35197158
       rf            8    5.180e-17    5.180e-17
       rf            9    2.749e-16    2.749e-16
gradboost           10     .0715962     .0715962
gradboost           11    .15212295    .15212295
     nnet           12    2.817e-16    2.817e-16
     nnet           13    2.193e-16    2.193e-16

      +--------------------------------------------+
      | Y_lnea~_1   Y_lne~s1   Y_lnea~2   Y_lnea~3 |
      |--------------------------------------------|
   1. |  2.620841          1   1.38e-16   1.38e-16 |
   2. | 3.1625793          2   1.57e-16   1.57e-16 |
   3. |  2.819393          3   1.08e-16   1.08e-16 |
   4. | 2.4754234          4   1.98e-16   1.98e-16 |
      +--------------------------------------------+
(note: file out_36931/Y_lnearn_ss_nnls1_short.dta not found)
file out_36931/Y_lnearn_ss_nnls1_short.dta saved

D_gender_r_ss[13,3]
               learner  mean_weight        rep_1
      ols            1    .17870465    .17870465
      ols            2    9.233e-17    9.233e-17
  lassocv            3     .1655108     .1655108
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7    .44536442    .44536442
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11    .21042014    .21042014
     nnet           12            0            0
     nnet           13    1.095e-16    1.095e-16

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .71709711          1   .1787046   .1787046 |
   2. | .44042135          2   9.23e-17   9.23e-17 |
   3. | .11839602          3   .1655108   .1655108 |
   4. | .31467174          4          0          0 |
      +--------------------------------------------+
(note: file out_36931/D_gender_r_ss_nnls1_short.dta not found)
file out_36931/D_gender_r_ss_nnls1_short.dta saved

Y_lnearn_ps[13,3]
               learner  mean_weight        rep_1
      ols            1    .02450749    .02450749
      ols            2    3.799e-16    3.799e-16
  lassocv            3    .16138544    .16138544
  ridgecv            4    .09826729    .09826729
  lassocv            5            0            0
  ridgecv            6     .1010848     .1010848
       rf            7    .45115905    .45115905
       rf            8    3.517e-16    3.517e-16
       rf            9    6.129e-17    6.129e-17
gradboost           10    2.520e-16    2.520e-16
gradboost           11    .14086447    .14086447
     nnet           12    6.193e-16    6.193e-16
     nnet           13    .02273146    .02273146

      +--------------------------------------------+
      | Y_lnea~_1   Y_lne~s1   Y_lnea~2   Y_lnea~3 |
      |--------------------------------------------|
   1. | 2.6108343          1   .0245075   .0245075 |
   2. | 3.1535195          2   3.80e-16   3.80e-16 |
   3. |  2.825121          3   .1613854   .1613854 |
   4. | 2.4836125          4   .0982673   .0982673 |
      +--------------------------------------------+
(note: file out_36931/Y_lnearn_ps_nnls1_pooled.dta not found)
file out_36931/Y_lnearn_ps_nnls1_pooled.dta saved

D_gender_r_ps[13,3]
               learner  mean_weight        rep_1
      ols            1    .06983065    .06983065
      ols            2            0            0
  lassocv            3    .29732959    .29732959
  ridgecv            4            0            0
  lassocv            5    5.331e-16    5.331e-16
  ridgecv            6    3.102e-16    3.102e-16
       rf            7    .40393519    .40393519
       rf            8            0            0
       rf            9    3.145e-15    3.145e-15
gradboost           10            0            0
gradboost           11    .21752399    .21752399
     nnet           12    1.411e-16    1.411e-16
     nnet           13    .01138059    .01138059

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .71613669          1   .0698306   .0698306 |
   2. | .43592334          2          0          0 |
   3. | .12588776          3   .2973296   .2973296 |
   4. | .31345818          4          0          0 |
      +--------------------------------------------+
(note: file out_36931/D_gender_r_ps_nnls1_pooled.dta not found)
file out_36931/D_gender_r_ps_nnls1_pooled.dta saved


Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  st  1  Y1_pystacked  D1_pystacked    -0.104    (0.016)
  ss  1  [shortstack]          [ss]    -0.098    (0.016)
  ps  1   [poolstack]          [ps]    -0.108    (0.017)

Shortstack DDML model
y-E[y|X]  = y-Y_lnearn_ss_1                        Number of obs   =      4836
D-E[D|X]  = D-D_gender_r_ss_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0984796   .0162691    -6.05   0.000    -.1303664   -.0665928
       _cons |  -.0010688   .0063895    -0.17   0.867     -.013592    .0114543
------------------------------------------------------------------------------
Stacking final estimator: singlebest



Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  st  1  Y1_pystacked  D1_pystacked    -0.104    (0.016)
  ss  1  [shortstack]          [ss]    -0.098    (0.016)
  ps  1   [poolstack]          [ps]    -0.108    (0.017)

Stacking DDML model
y-E[y|X]  = y-Y1_pystacked_1                       Number of obs   =      4836
D-E[D|X]  = D-D1_pystacked_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1036542   .0163708    -6.33   0.000    -.1357404    -.071568
       _cons |  -.0009978    .006443    -0.15   0.877    -.0136258    .0116303
------------------------------------------------------------------------------
Stacking final estimator: singlebest

file out_36931/results.dta saved


Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  ss  1  Y1_pystacked  D1_pystacked    -0.098    (0.016)
  ss  1  [shortstack]          [ss]    -0.098    (0.016)
  ps  1   [poolstack]          [ps]    -0.108    (0.017)

Shortstack DDML model
y-E[y|X]  = y-Y_lnearn_ss_1                        Number of obs   =      4836
D-E[D|X]  = D-D_gender_r_ss_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0984796   .0162691    -6.05   0.000    -.1303664   -.0665928
       _cons |  -.0010688   .0063895    -0.17   0.867     -.013592    .0114543
------------------------------------------------------------------------------
Stacking final estimator: singlebest

file out_36931/results.dta saved


Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  ps  1  Y1_pystacked  D1_pystacked    -0.108    (0.017)
  ss  1  [shortstack]          [ss]    -0.098    (0.016)
  ps  1   [poolstack]          [ps]    -0.108    (0.017)

Poolstack DDML model
y-E[y|X]  = y-Y_lnearn_ps_1                        Number of obs   =      4836
D-E[D|X]  = D-D_gender_r_ps_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1081972   .0166354    -6.50   0.000     -.140802   -.0755923
       _cons |  -.0029675   .0063885    -0.46   0.642    -.0154888    .0095537
------------------------------------------------------------------------------
Stacking final estimator: singlebest

file out_36931/results.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: singlebest
               learner  mean_weight        rep_1
      ols            1            0            0
      ols            2            0            0
  lassocv            3           .6           .6
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7           .3           .3
       rf            8            0            0
       rf            9            0            0
gradboost           10           .1           .1
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: singlebest
               learner  mean_weight        rep_1
      ols            1            0            0
      ols            2            0            0
  lassocv            3           .1           .1
  ridgecv            4            0            0
  lassocv            5           .2           .2
  ridgecv            6           .3           .3
       rf            7           .4           .4
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: singlebest
               learner  mean_weight        rep_1
      ols            1            0            0
      ols            2            0            0
  lassocv            3           .6           .6
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7           .3           .3
       rf            8            0            0
       rf            9            0            0
gradboost           10           .1           .1
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: singlebest
               learner  mean_weight        rep_1
      ols            1            0            0
      ols            2            0            0
  lassocv            3           .1           .1
  ridgecv            4            0            0
  lassocv            5           .2           .2
  ridgecv            6           .3           .3
       rf            7           .4           .4
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

Y1_pystacked_w_mn[13,3]
               learner  mean_weight        rep_1
      ols            1            0            0
      ols            2            0            0
  lassocv            3           .1           .1
  ridgecv            4            0            0
  lassocv            5           .2           .2
  ridgecv            6           .3           .3
       rf            7           .4           .4
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

      +--------------------------------+
      | Y1_pys~1   Y1_pys~2   Y1_pys~3 |
      |--------------------------------|
   1. |        1          0          0 |
   2. |        2          0          0 |
   3. |        3         .1         .1 |
   4. |        4          0          0 |
      +--------------------------------+
(note: file out_36931/Y1_pystacked_w_mn_singlebest_regular.dta not found)
file out_36931/Y1_pystacked_w_mn_singlebest_regular.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: singlebest
               learner  mean_weight        rep_1
      ols            1            0            0
      ols            2            0            0
  lassocv            3           .6           .6
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7           .3           .3
       rf            8            0            0
       rf            9            0            0
gradboost           10           .1           .1
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: singlebest
               learner  mean_weight        rep_1
      ols            1            0            0
      ols            2            0            0
  lassocv            3           .1           .1
  ridgecv            4            0            0
  lassocv            5           .2           .2
  ridgecv            6           .3           .3
       rf            7           .4           .4
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

D1_pystacked_w_mn[13,3]
               learner  mean_weight        rep_1
      ols            1            0            0
      ols            2            0            0
  lassocv            3           .6           .6
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7           .3           .3
       rf            8            0            0
       rf            9            0            0
gradboost           10           .1           .1
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

      +--------------------------------+
      | D1_pys~1   D1_pys~2   D1_pys~3 |
      |--------------------------------|
   1. |        1          0          0 |
   2. |        2          0          0 |
   3. |        3         .6         .6 |
   4. |        4          0          0 |
      +--------------------------------+
(note: file out_36931/D1_pystacked_w_mn_singlebest_regular.dta not found)
file out_36931/D1_pystacked_w_mn_singlebest_regular.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: singlebest
               learner  mean_weight        rep_1
      ols            1            0            0
      ols            2            0            0
  lassocv            3            0            0
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            1            1
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

short-stacked weights across resamples for lnearn
final stacking estimator: singlebest
               learner  mean_weight        rep_1
      ols            1            0            0
      ols            2            0            0
  lassocv            3            0            0
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            1            1
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

Y_lnearn_ss[13,3]
               learner  mean_weight        rep_1
      ols            1            0            0
      ols            2            0            0
  lassocv            3            0            0
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            1            1
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

      +--------------------------------------------+
      | Y_lnea~_1   Y_lne~s1   Y_lnea~2   Y_lnea~3 |
      |--------------------------------------------|
   1. | 2.6347899          1          0          0 |
   2. | 3.1467297          2          0          0 |
   3. | 2.8158879          3          0          0 |
   4. | 2.4530172          4          0          0 |
      +--------------------------------------------+
(note: file out_36931/Y_lnearn_ss_singlebest_short.dta not found)
file out_36931/Y_lnearn_ss_singlebest_short.dta saved

D_gender_r_ss[13,3]
               learner  mean_weight        rep_1
      ols            1            0            0
      ols            2            0            0
  lassocv            3            0            0
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            1            1
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .75400001          1          0          0 |
   2. | .51599997          2          0          0 |
   3. |       .13          3          0          0 |
   4. |      .214          4          0          0 |
      +--------------------------------------------+
(note: file out_36931/D_gender_r_ss_singlebest_short.dta not found)
file out_36931/D_gender_r_ss_singlebest_short.dta saved

Y_lnearn_ps[13,3]
               learner  mean_weight        rep_1
      ols            1            0            0
      ols            2            0            0
  lassocv            3            0            0
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            1            1
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

      +--------------------------------------------+
      | Y_lnea~_1   Y_lne~s1   Y_lnea~2   Y_lnea~3 |
      |--------------------------------------------|
   1. |  2.583617          1          0          0 |
   2. | 3.0539806          2          0          0 |
   3. | 2.8516467          3          0          0 |
   4. | 2.5104506          4          0          0 |
      +--------------------------------------------+
(note: file out_36931/Y_lnearn_ps_singlebest_pooled.dta not found)
file out_36931/Y_lnearn_ps_singlebest_pooled.dta saved

D_gender_r_ps[13,3]
               learner  mean_weight        rep_1
      ols            1            0            0
      ols            2            0            0
  lassocv            3            1            1
  ridgecv            4            0            0
  lassocv            5            0            0
  ridgecv            6            0            0
       rf            7            0            0
       rf            8            0            0
       rf            9            0            0
gradboost           10            0            0
gradboost           11            0            0
     nnet           12            0            0
     nnet           13            0            0

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .68212616          1          0          0 |
   2. | .37094787          2          0          0 |
   3. | .21059774          3          1          1 |
   4. | .39978138          4          0          0 |
      +--------------------------------------------+
(note: file out_36931/D_gender_r_ps_singlebest_pooled.dta not found)
file out_36931/D_gender_r_ps_singlebest_pooled.dta saved


Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  st  1  Y1_pystacked  D1_pystacked    -1.013    (0.026)
  ss  1  [shortstack]          [ss]    -0.102    (0.016)
  ps  1   [poolstack]          [ps]    -0.105    (0.016)

Shortstack DDML model
y-E[y|X]  = y-Y_lnearn_ss_1                        Number of obs   =      4836
D-E[D|X]  = D-D_gender_r_ss_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1024841   .0164045    -6.25   0.000    -.1346363    -.070332
       _cons |  -.1280306   .0062717   -20.41   0.000    -.1403229   -.1157384
------------------------------------------------------------------------------
Stacking final estimator: ols



Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  st  1  Y1_pystacked  D1_pystacked    -1.013    (0.026)
  ss  1  [shortstack]          [ss]    -0.102    (0.016)
  ps  1   [poolstack]          [ps]    -0.105    (0.016)

Stacking DDML model
y-E[y|X]  = y-Y1_pystacked_1                       Number of obs   =      4836
D-E[D|X]  = D-D1_pystacked_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |   -1.01272      .0255   -39.71   0.000    -1.062699    -.962741
       _cons |   1.581583   .0237706    66.54   0.000     1.534994    1.628173
------------------------------------------------------------------------------
Stacking final estimator: ols

(note: variable final was str3, now str10 to accommodate using data's values)
file out_36931/results.dta saved


Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  ss  1  Y1_pystacked  D1_pystacked    -0.102    (0.016)
  ss  1  [shortstack]          [ss]    -0.102    (0.016)
  ps  1   [poolstack]          [ps]    -0.105    (0.016)

Shortstack DDML model
y-E[y|X]  = y-Y_lnearn_ss_1                        Number of obs   =      4836
D-E[D|X]  = D-D_gender_r_ss_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1024841   .0164045    -6.25   0.000    -.1346363    -.070332
       _cons |  -.1280306   .0062717   -20.41   0.000    -.1403229   -.1157384
------------------------------------------------------------------------------
Stacking final estimator: ols

(note: variable final was str3, now str10 to accommodate using data's values)
file out_36931/results.dta saved


Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  ps  1  Y1_pystacked  D1_pystacked    -0.105    (0.016)
  ss  1  [shortstack]          [ss]    -0.102    (0.016)
  ps  1   [poolstack]          [ps]    -0.105    (0.016)

Poolstack DDML model
y-E[y|X]  = y-Y_lnearn_ps_1                        Number of obs   =      4836
D-E[D|X]  = D-D_gender_r_ps_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1049508   .0164912    -6.36   0.000     -.137273   -.0726285
       _cons |  -.0866388   .0062098   -13.95   0.000    -.0988098   -.0744678
------------------------------------------------------------------------------
Stacking final estimator: ols

(note: variable final was str3, now str10 to accommodate using data's values)
file out_36931/results.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: ols
               learner  mean_weight        rep_1
      ols            1    .07100691    .07100691
      ols            2    .18061815    .18061815
  lassocv            3    .37474775    .37474775
  ridgecv            4    .10256013    .10256013
  lassocv            5   -.22424111   -.22424111
  ridgecv            6   -.01373517   -.01373517
       rf            7    .48963272    .48963272
       rf            8    .61235826    .61235826
       rf            9   -.74668811   -.74668811
gradboost           10     .1284332     .1284332
gradboost           11    .10181994    .10181994
     nnet           12   -.36138483   -.36138483
     nnet           13    .01452818    .01452818

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: ols
               learner  mean_weight        rep_1
      ols            1    .01150465    .01150465
      ols            2   -.00838065   -.00838065
  lassocv            3   -.00672148   -.00672148
  ridgecv            4    .16274166    .16274166
  lassocv            5    .01811257    .01811257
  ridgecv            6    .29633132    .29633132
       rf            7    .54733609    .54733609
       rf            8    .22893308    .22893308
       rf            9   -.40719409   -.40719409
gradboost           10    .10742687    .10742687
gradboost           11    .04514352    .04514352
     nnet           12   -.51571188   -.51571188
     nnet           13    .00955899    .00955899

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: ols
               learner  mean_weight        rep_1
      ols            1    .07100691    .07100691
      ols            2    .18061815    .18061815
  lassocv            3    .37474775    .37474775
  ridgecv            4    .10256013    .10256013
  lassocv            5   -.22424111   -.22424111
  ridgecv            6   -.01373517   -.01373517
       rf            7    .48963272    .48963272
       rf            8    .61235826    .61235826
       rf            9   -.74668811   -.74668811
gradboost           10     .1284332     .1284332
gradboost           11    .10181994    .10181994
     nnet           12   -.36138483   -.36138483
     nnet           13    .01452818    .01452818

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: ols
               learner  mean_weight        rep_1
      ols            1    .01150465    .01150465
      ols            2   -.00838065   -.00838065
  lassocv            3   -.00672148   -.00672148
  ridgecv            4    .16274166    .16274166
  lassocv            5    .01811257    .01811257
  ridgecv            6    .29633132    .29633132
       rf            7    .54733609    .54733609
       rf            8    .22893308    .22893308
       rf            9   -.40719409   -.40719409
gradboost           10    .10742687    .10742687
gradboost           11    .04514352    .04514352
     nnet           12   -.51571188   -.51571188
     nnet           13    .00955899    .00955899

Y1_pystacked_w_mn[13,3]
               learner  mean_weight        rep_1
      ols            1    .01150465    .01150465
      ols            2   -.00838065   -.00838065
  lassocv            3   -.00672148   -.00672148
  ridgecv            4    .16274166    .16274166
  lassocv            5    .01811257    .01811257
  ridgecv            6    .29633132    .29633132
       rf            7    .54733609    .54733609
       rf            8    .22893308    .22893308
       rf            9   -.40719409   -.40719409
gradboost           10    .10742687    .10742687
gradboost           11    .04514352    .04514352
     nnet           12   -.51571188   -.51571188
     nnet           13    .00955899    .00955899

      +----------------------------------+
      | Y1_pys~1   Y1_pyst~2   Y1_pyst~3 |
      |----------------------------------|
   1. |        1    .0115046    .0115046 |
   2. |        2   -.0083806   -.0083806 |
   3. |        3   -.0067215   -.0067215 |
   4. |        4    .1627417    .1627417 |
      +----------------------------------+
(note: file out_36931/Y1_pystacked_w_mn_ols_regular.dta not found)
file out_36931/Y1_pystacked_w_mn_ols_regular.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: ols
               learner  mean_weight        rep_1
      ols            1    .07100691    .07100691
      ols            2    .18061815    .18061815
  lassocv            3    .37474775    .37474775
  ridgecv            4    .10256013    .10256013
  lassocv            5   -.22424111   -.22424111
  ridgecv            6   -.01373517   -.01373517
       rf            7    .48963272    .48963272
       rf            8    .61235826    .61235826
       rf            9   -.74668811   -.74668811
gradboost           10     .1284332     .1284332
gradboost           11    .10181994    .10181994
     nnet           12   -.36138483   -.36138483
     nnet           13    .01452818    .01452818

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: ols
               learner  mean_weight        rep_1
      ols            1    .01150465    .01150465
      ols            2   -.00838065   -.00838065
  lassocv            3   -.00672148   -.00672148
  ridgecv            4    .16274166    .16274166
  lassocv            5    .01811257    .01811257
  ridgecv            6    .29633132    .29633132
       rf            7    .54733609    .54733609
       rf            8    .22893308    .22893308
       rf            9   -.40719409   -.40719409
gradboost           10    .10742687    .10742687
gradboost           11    .04514352    .04514352
     nnet           12   -.51571188   -.51571188
     nnet           13    .00955899    .00955899

D1_pystacked_w_mn[13,3]
               learner  mean_weight        rep_1
      ols            1    .07100691    .07100691
      ols            2    .18061815    .18061815
  lassocv            3    .37474775    .37474775
  ridgecv            4    .10256013    .10256013
  lassocv            5   -.22424111   -.22424111
  ridgecv            6   -.01373517   -.01373517
       rf            7    .48963272    .48963272
       rf            8    .61235826    .61235826
       rf            9   -.74668811   -.74668811
gradboost           10     .1284332     .1284332
gradboost           11    .10181994    .10181994
     nnet           12   -.36138483   -.36138483
     nnet           13    .01452818    .01452818

      +--------------------------------+
      | D1_pys~1   D1_pys~2   D1_pys~3 |
      |--------------------------------|
   1. |        1   .0710069   .0710069 |
   2. |        2   .1806182   .1806182 |
   3. |        3   .3747478   .3747478 |
   4. |        4   .1025601   .1025601 |
      +--------------------------------+
(note: file out_36931/D1_pystacked_w_mn_ols_regular.dta not found)
file out_36931/D1_pystacked_w_mn_ols_regular.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: ols
               learner  mean_weight        rep_1
      ols            1    .15848561    .15848561
      ols            2     .1559768     .1559768
  lassocv            3    .65787473    .65787473
  ridgecv            4    .05446949    .05446949
  lassocv            5   -.49797214   -.49797214
  ridgecv            6   -.04121269   -.04121269
       rf            7    .56184462    .56184462
       rf            8    .53629714    .53629714
       rf            9    -.6932148    -.6932148
gradboost           10    .07875087    .07875087
gradboost           11    .14393781    .14393781
     nnet           12   -.10365002   -.10365002
     nnet           13   -.00487242   -.00487242

short-stacked weights across resamples for lnearn
final stacking estimator: ols
               learner  mean_weight        rep_1
      ols            1    -.0250711    -.0250711
      ols            2    .03206593    .03206593
  lassocv            3   -.19721052   -.19721052
  ridgecv            4    .13603668    .13603668
  lassocv            5   -.02038972   -.02038972
  ridgecv            6    .56452177    .56452177
       rf            7    .57698471    .57698471
       rf            8   -.19028077   -.19028077
       rf            9   -.12400995   -.12400995
gradboost           10    .24160871    .24160871
gradboost           11    .06793494    .06793494
     nnet           12    .01369751    .01369751
     nnet           13   -.03092977   -.03092977

Y_lnearn_ss[13,3]
               learner  mean_weight        rep_1
      ols            1    -.0250711    -.0250711
      ols            2    .03206593    .03206593
  lassocv            3   -.19721052   -.19721052
  ridgecv            4    .13603668    .13603668
  lassocv            5   -.02038972   -.02038972
  ridgecv            6    .56452177    .56452177
       rf            7    .57698471    .57698471
       rf            8   -.19028077   -.19028077
       rf            9   -.12400995   -.12400995
gradboost           10    .24160871    .24160871
gradboost           11    .06793494    .06793494
     nnet           12    .01369751    .01369751
     nnet           13   -.03092977   -.03092977

      +----------------------------------------------+
      | Y_lnea~_1   Y_lne~s1   Y_lnear~2   Y_lnear~3 |
      |----------------------------------------------|
   1. | 2.7342416          1   -.0250711   -.0250711 |
   2. | 3.2944844          2    .0320659    .0320659 |
   3. | 2.9499715          3   -.1972105   -.1972105 |
   4. | 2.5857507          4    .1360367    .1360367 |
      +----------------------------------------------+
(note: file out_36931/Y_lnearn_ss_ols_short.dta not found)
file out_36931/Y_lnearn_ss_ols_short.dta saved

D_gender_r_ss[13,3]
               learner  mean_weight        rep_1
      ols            1    .15848561    .15848561
      ols            2     .1559768     .1559768
  lassocv            3    .65787473    .65787473
  ridgecv            4    .05446949    .05446949
  lassocv            5   -.49797214   -.49797214
  ridgecv            6   -.04121269   -.04121269
       rf            7    .56184462    .56184462
       rf            8    .53629714    .53629714
       rf            9    -.6932148    -.6932148
gradboost           10    .07875087    .07875087
gradboost           11    .14393781    .14393781
     nnet           12   -.10365002   -.10365002
     nnet           13   -.00487242   -.00487242

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .68087627          1   .1584856   .1584856 |
   2. | .43164721          2   .1559768   .1559768 |
   3. | .10670153          3   .6578747   .6578747 |
   4. | .19415221          4   .0544695   .0544695 |
      +--------------------------------------------+
(note: file out_36931/D_gender_r_ss_ols_short.dta not found)
file out_36931/D_gender_r_ss_ols_short.dta saved

Y_lnearn_ps[13,3]
               learner  mean_weight        rep_1
      ols            1    .00776275    .00776275
      ols            2   -.01228424   -.01228424
  lassocv            3    .13669086    .13669086
  ridgecv            4    .25605635    .25605635
  lassocv            5   -.12629196   -.12629196
  ridgecv            6    .19669026    .19669026
       rf            7    .56308012    .56308012
       rf            8    .23803918    .23803918
       rf            9   -.42293282   -.42293282
gradboost           10    .10980297    .10980297
gradboost           11    .05539428    .05539428
     nnet           12    .01314118    .01314118
     nnet           13    .01291978    .01291978

      +----------------------------------------------+
      | Y_lnea~_1   Y_lne~s1   Y_lnear~2   Y_lnear~3 |
      |----------------------------------------------|
   1. | 2.6659427          1    .0077628    .0077628 |
   2. | 3.2240824          2   -.0122842   -.0122842 |
   3. |  2.900898          3    .1366909    .1366909 |
   4. | 2.5455169          4    .2560563    .2560563 |
      +----------------------------------------------+
(note: file out_36931/Y_lnearn_ps_ols_pooled.dta not found)
file out_36931/Y_lnearn_ps_ols_pooled.dta saved

D_gender_r_ps[13,3]
               learner  mean_weight        rep_1
      ols            1    .05529243    .05529243
      ols            2     .1833645     .1833645
  lassocv            3    .38396482    .38396482
  ridgecv            4    .11894755    .11894755
  lassocv            5   -.22370867   -.22370867
  ridgecv            6   -.01146642   -.01146642
       rf            7    .49542729    .49542729
       rf            8    .62004082    .62004082
       rf            9   -.75956723   -.75956723
gradboost           10    .12269751    .12269751
gradboost           11    .11019087    .11019087
     nnet           12    .00173074    .00173074
     nnet           13    .01087683    .01087683

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .77636457          1   .0552924   .0552924 |
   2. | .49030864          2   .1833645   .1833645 |
   3. | .12924981          3   .3839648   .3839648 |
   4. | .25725045          4   .1189475   .1189475 |
      +--------------------------------------------+
(note: file out_36931/D_gender_r_ps_ols_pooled.dta not found)
file out_36931/D_gender_r_ps_ols_pooled.dta saved


Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  st  1  Y1_pystacked  D1_pystacked    -0.108    (0.017)
  ss  1  [shortstack]          [ss]    -0.108    (0.017)
  ps  1   [poolstack]          [ps]    -0.108    (0.017)

Shortstack DDML model
y-E[y|X]  = y-Y_lnearn_ss_1                        Number of obs   =      4836
D-E[D|X]  = D-D_gender_r_ss_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1084516   .0167504    -6.47   0.000    -.1412819   -.0756214
       _cons |  -.0013128   .0063968    -0.21   0.837    -.0138503    .0112247
------------------------------------------------------------------------------
Stacking final estimator: avg



Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  st  1  Y1_pystacked  D1_pystacked    -0.108    (0.017)
  ss  1  [shortstack]          [ss]    -0.108    (0.017)
  ps  1   [poolstack]          [ps]    -0.108    (0.017)

Stacking DDML model
y-E[y|X]  = y-Y1_pystacked_1                       Number of obs   =      4836
D-E[D|X]  = D-D1_pystacked_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1084516   .0167504    -6.47   0.000    -.1412819   -.0756214
       _cons |  -.0013128   .0063968    -0.21   0.837    -.0138503    .0112247
------------------------------------------------------------------------------
Stacking final estimator: avg

(note: variable final was str3, now str10 to accommodate using data's values)
file out_36931/results.dta saved


Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  ss  1  Y1_pystacked  D1_pystacked    -0.108    (0.017)
  ss  1  [shortstack]          [ss]    -0.108    (0.017)
  ps  1   [poolstack]          [ps]    -0.108    (0.017)

Shortstack DDML model
y-E[y|X]  = y-Y_lnearn_ss_1                        Number of obs   =      4836
D-E[D|X]  = D-D_gender_r_ss_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1084516   .0167504    -6.47   0.000    -.1412819   -.0756214
       _cons |  -.0013128   .0063968    -0.21   0.837    -.0138503    .0112247
------------------------------------------------------------------------------
Stacking final estimator: avg

(note: variable final was str3, now str10 to accommodate using data's values)
file out_36931/results.dta saved


Model:                  partial, crossfit folds k=10, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): lnearn
 lnearn learners:       Y1_pystacked
D equations (1):        gender_r
 gender_r learners:     D1_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE 
  ps  1  Y1_pystacked  D1_pystacked    -0.108    (0.017)
  ss  1  [shortstack]          [ss]    -0.108    (0.017)
  ps  1   [poolstack]          [ps]    -0.108    (0.017)

Poolstack DDML model
y-E[y|X]  = y-Y_lnearn_ps_1                        Number of obs   =      4836
D-E[D|X]  = D-D_gender_r_ps_1 
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1084516   .0167504    -6.47   0.000    -.1412819   -.0756214
       _cons |  -.0013128   .0063968    -0.21   0.837    -.0138503    .0112247
------------------------------------------------------------------------------
Stacking final estimator: avg

(note: variable final was str3, now str10 to accommodate using data's values)
file out_36931/results.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: avg
               learner  mean_weight        rep_1
      ols            1    .07692308    .07692308
      ols            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: avg
               learner  mean_weight        rep_1
      ols            1    .07692308    .07692308
      ols            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: avg
               learner  mean_weight        rep_1
      ols            1    .07692308    .07692308
      ols            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: avg
               learner  mean_weight        rep_1
      ols            1    .07692308    .07692308
      ols            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

Y1_pystacked_w_mn[13,3]
               learner  mean_weight        rep_1
      ols            1    .07692308    .07692308
      ols            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

      +--------------------------------+
      | Y1_pys~1   Y1_pys~2   Y1_pys~3 |
      |--------------------------------|
   1. |        1   .0769231   .0769231 |
   2. |        2   .0769231   .0769231 |
   3. |        3   .0769231   .0769231 |
   4. |        4   .0769231   .0769231 |
      +--------------------------------+
(note: file out_36931/Y1_pystacked_w_mn_avg_regular.dta not found)
file out_36931/Y1_pystacked_w_mn_avg_regular.dta saved

mean stacking weights across folds/resamples for D1_pystacked (gender_r)
final stacking estimator: avg
               learner  mean_weight        rep_1
      ols            1    .07692308    .07692308
      ols            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

mean stacking weights across folds/resamples for Y1_pystacked (lnearn)
final stacking estimator: avg
               learner  mean_weight        rep_1
      ols            1    .07692308    .07692308
      ols            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

D1_pystacked_w_mn[13,3]
               learner  mean_weight        rep_1
      ols            1    .07692308    .07692308
      ols            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

      +--------------------------------+
      | D1_pys~1   D1_pys~2   D1_pys~3 |
      |--------------------------------|
   1. |        1   .0769231   .0769231 |
   2. |        2   .0769231   .0769231 |
   3. |        3   .0769231   .0769231 |
   4. |        4   .0769231   .0769231 |
      +--------------------------------+
(note: file out_36931/D1_pystacked_w_mn_avg_regular.dta not found)
file out_36931/D1_pystacked_w_mn_avg_regular.dta saved

short-stacked weights across resamples for gender_r
final stacking estimator: avg
               learner  mean_weight        rep_1
      ols            1    .07692308    .07692308
      ols            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

short-stacked weights across resamples for lnearn
final stacking estimator: avg
               learner  mean_weight        rep_1
      ols            1    .07692308    .07692308
      ols            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

Y_lnearn_ss[13,3]
               learner  mean_weight        rep_1
      ols            1    .07692308    .07692308
      ols            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

      +--------------------------------------------+
      | Y_lnea~_1   Y_lne~s1   Y_lnea~2   Y_lnea~3 |
      |--------------------------------------------|
   1. |   2.65917          1   .0769231   .0769231 |
   2. | 3.1522662          2   .0769231   .0769231 |
   3. | 2.8140942          3   .0769231   .0769231 |
   4. | 2.5152736          4   .0769231   .0769231 |
      +--------------------------------------------+
(note: file out_36931/Y_lnearn_ss_avg_short.dta not found)
file out_36931/Y_lnearn_ss_avg_short.dta saved

D_gender_r_ss[13,3]
               learner  mean_weight        rep_1
      ols            1    .07692308    .07692308
      ols            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .72381665          1   .0769231   .0769231 |
   2. | .42594428          2   .0769231   .0769231 |
   3. | .18305728          3   .0769231   .0769231 |
   4. | .40566526          4   .0769231   .0769231 |
      +--------------------------------------------+
(note: file out_36931/D_gender_r_ss_avg_short.dta not found)
file out_36931/D_gender_r_ss_avg_short.dta saved

Y_lnearn_ps[13,3]
               learner  mean_weight        rep_1
      ols            1    .07692308    .07692308
      ols            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

      +--------------------------------------------+
      | Y_lnea~_1   Y_lne~s1   Y_lnea~2   Y_lnea~3 |
      |--------------------------------------------|
   1. |   2.65917          1   .0769231   .0769231 |
   2. | 3.1522662          2   .0769231   .0769231 |
   3. | 2.8140942          3   .0769231   .0769231 |
   4. | 2.5152736          4   .0769231   .0769231 |
      +--------------------------------------------+
(note: file out_36931/Y_lnearn_ps_avg_pooled.dta not found)
file out_36931/Y_lnearn_ps_avg_pooled.dta saved

D_gender_r_ps[13,3]
               learner  mean_weight        rep_1
      ols            1    .07692308    .07692308
      ols            2    .07692308    .07692308
  lassocv            3    .07692308    .07692308
  ridgecv            4    .07692308    .07692308
  lassocv            5    .07692308    .07692308
  ridgecv            6    .07692308    .07692308
       rf            7    .07692308    .07692308
       rf            8    .07692308    .07692308
       rf            9    .07692308    .07692308
gradboost           10    .07692308    .07692308
gradboost           11    .07692308    .07692308
     nnet           12    .07692308    .07692308
     nnet           13    .07692308    .07692308

      +--------------------------------------------+
      | D_gend~_1   D_gen~s1   D_gend~2   D_gend~3 |
      |--------------------------------------------|
   1. | .72381665          1   .0769231   .0769231 |
   2. | .42594428          2   .0769231   .0769231 |
   3. | .18305728          3   .0769231   .0769231 |
   4. | .40566526          4   .0769231   .0769231 |
      +--------------------------------------------+
(note: file out_36931/D_gender_r_ps_avg_pooled.dta not found)
file out_36931/D_gender_r_ps_avg_pooled.dta saved
. 
.         forvalues i = 1(1)$L {
  2.                         ddml estimate, y(Y1_pystacked_L`i'_1) ///
>                                                         d(D1_pystacked_L`i'_1
> ) robust
  3.                         regsave gender_r using `folder'/results.dta, ci //
> /
>                                                 addlabel(model,partial,seed,`
> seed',final,indiv,learner,`i') ///
>                                                 append
  4.         }

y-E[y|X]  = Y1_pystacked_L1_1                      Number of obs   =      4836
D-E[D|X]  = D1_pystacked_L1_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1030689   .0191597    -5.38   0.000    -.1406212   -.0655166
       _cons |  -.0002827    .006778    -0.04   0.967    -.0135673    .0130019
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_36931/results.dta saved

y-E[y|X]  = Y1_pystacked_L2_1                      Number of obs   =      4836
D-E[D|X]  = D1_pystacked_L2_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1211169   .0153968    -7.87   0.000    -.1512941   -.0909397
       _cons |  -.0005784   .0068577    -0.08   0.933    -.0140193    .0128625
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_36931/results.dta saved

y-E[y|X]  = Y1_pystacked_L3_1                      Number of obs   =      4836
D-E[D|X]  = D1_pystacked_L3_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |   -.102216   .0166289    -6.15   0.000    -.1348082   -.0696239
       _cons |  -.0003572   .0064126    -0.06   0.956    -.0129256    .0122112
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_36931/results.dta saved

y-E[y|X]  = Y1_pystacked_L4_1                      Number of obs   =      4836
D-E[D|X]  = D1_pystacked_L4_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1011694   .0165834    -6.10   0.000    -.1336723   -.0686665
       _cons |   -.000408   .0064157    -0.06   0.949    -.0129825    .0121665
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_36931/results.dta saved

y-E[y|X]  = Y1_pystacked_L5_1                      Number of obs   =      4836
D-E[D|X]  = D1_pystacked_L5_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1045375   .0165556    -6.31   0.000     -.136986   -.0720891
       _cons |  -.0014882   .0063987    -0.23   0.816    -.0140294    .0110531
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_36931/results.dta saved

y-E[y|X]  = Y1_pystacked_L6_1                      Number of obs   =      4836
D-E[D|X]  = D1_pystacked_L6_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1057271   .0167069    -6.33   0.000    -.1384721   -.0729821
       _cons |  -.0011845   .0063816    -0.19   0.853    -.0136923    .0113233
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_36931/results.dta saved

y-E[y|X]  = Y1_pystacked_L7_1                      Number of obs   =      4836
D-E[D|X]  = D1_pystacked_L7_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |   -.104779   .0163324    -6.42   0.000      -.13679    -.072768
       _cons |  -.0027567   .0063955    -0.43   0.666    -.0152918    .0097783
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_36931/results.dta saved

y-E[y|X]  = Y1_pystacked_L8_1                      Number of obs   =      4836
D-E[D|X]  = D1_pystacked_L8_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1118944     .01687    -6.63   0.000    -.1449589   -.0788298
       _cons |    .000281   .0066336     0.04   0.966    -.0127206    .0132826
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_36931/results.dta saved

y-E[y|X]  = Y1_pystacked_L9_1                      Number of obs   =      4836
D-E[D|X]  = D1_pystacked_L9_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1137427   .0166671    -6.82   0.000    -.1464097   -.0810758
       _cons |   .0001228   .0067539     0.02   0.985    -.0131146    .0133601
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_36931/results.dta saved

y-E[y|X]  = Y1_pystacked_L10_1                     Number of obs   =      4836
D-E[D|X]  = D1_pystacked_L10_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0917119   .0163515    -5.61   0.000    -.1237602   -.0596637
       _cons |  -.0017681   .0064211    -0.28   0.783    -.0143533     .010817
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_36931/results.dta saved

y-E[y|X]  = Y1_pystacked_L11_1                     Number of obs   =      4836
D-E[D|X]  = D1_pystacked_L11_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0897329   .0162088    -5.54   0.000    -.1215016   -.0579642
       _cons |  -.0042597   .0065512    -0.65   0.516    -.0170997    .0085803
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_36931/results.dta saved

y-E[y|X]  = Y1_pystacked_L12_1                     Number of obs   =      4836
D-E[D|X]  = D1_pystacked_L12_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.1120581   .0168152    -6.66   0.000    -.1450153   -.0791009
       _cons |   -.002638   .0079884    -0.33   0.741    -.0182949     .013019
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_36931/results.dta saved

y-E[y|X]  = Y1_pystacked_L13_1                     Number of obs   =      4836
D-E[D|X]  = D1_pystacked_L13_1
------------------------------------------------------------------------------
             |               Robust
      lnearn |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    gender_r |  -.0857115   .0218072    -3.93   0.000    -.1284527   -.0429702
       _cons |  -.0019459   .0080983    -0.24   0.810    -.0178183    .0139264
------------------------------------------------------------------------------
(note: variable final was str5, now str10 to accommodate using data's values)
file out_36931/results.dta saved
. 
. }

.         
. *****************************************************************************
> *  
. *** interactive: estimation                                                  
>                                       ***
. *****************************************************************************
> *
.         
. if (`estimator'==2) {   
. 
.         ddml init interactive, kfolds($K) reps($R)
.         ddml E[Y|X,D]: pystacked lnearn $X_expanded $pystring_reg
.         ddml E[D|X]: pystacked gender_r $X_expanded $pystring_class
.         ddml crossfit, shortstack poolstack
.         ddml estimate, robust atet
. 
.         cap drop mse_*
.         foreach var of varlist Y1_pystacked0* {
  2.                  cap drop sqerr_`var'
  3.                  gen double sqerr_`var'=(lnearn-`var')^2 if gender_r==0
  4.                  sum sqerr_`var' if gender_r==0, meanonly
  5.                  gen double mse_`var'=r(mean) if _n ==1 
  6.         }
.         foreach var of varlist Y1_pystacked1* {
  2.                  cap drop sqerr_`var'
  3.                  gen double sqerr_`var'=(lnearn-`var')^2 if gender_r==1
  4.                  sum sqerr_`var' if gender_r==1, meanonly
  5.                  gen double mse_`var'=r(mean) if _n ==1 
  6.         }
.         foreach var of varlist D1_* {
  2.                  cap drop sqerr_`var'
  3.                  gen double sqerr_`var'=(gender_r-`var')^2
  4.                  sum sqerr_`var', meanonly
  5.                  gen double mse_`var'=r(mean) if _n ==1 
  6.         }
.         preserve
.                 keep mse_*
.                 keep if _n==1
.                 save `folder'/inter_mse, replace
.         restore
.         cap drop mse_*
.         
.         local mat gender_r_mse
.                         ddml extract, show(mse)
.                         mat `mat' = r(`mat')
.                         mat list `mat'
.                                 preserve
.                                 svmat `mat'
.                                 keep `mat'*
.                                 keep if _n<=$L
.                                 gen stack_type = "conventional" if _n==1
.                                 replace stack_type = "pooled" if _n==2
.                                 replace stack_type = "short" if _n==3
.                                 gen model = "interactive"
.                                 list if _n<=$L
.                                 save `folder'/`mat'_inter_gender_mse, replace
.                                 restore 
.                                 
.         local mat lnearn_mse
.                         ddml extract, show(mse)
.                         mat `mat' = r(`mat')
.                         mat list `mat'
.                                 preserve
.                                 svmat `mat'
.                                 keep `mat'*
.                                 keep if _n<=(2*$L)
.                                 gen stack_type = "conventional" if _n<=2
.                                 replace stack_type = "pooled" if _n>=3 & _n<=
> 4
.                                 replace stack_type = "short" if _n>4
.                                 gen model = "interactive"
.                                 list if _n<=(2*$L)
.                                 save `folder'/`mat'_inter_lnearn_mse, replace
.                                 restore 
.         
.         foreach final in nnls1 singlebest ols avg {
  2. 
.                 ddml estimate, robust finalest(`final') atet
  3.         
.                         // regular stacking results
.                         ddml estimate, mname(m0) spec(st) replay atet
  4.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,interactive,seed,`seed',final,`final',learner,-1) append
  5.                         
.                         // shortstacking results
.                         ddml estimate, mname(m0) spec(ss) replay atet
  6.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,interactive,seed,`seed',final,`final',learner,-2) append
  7.                         
.                         // poolstacking results
.                         ddml estimate, mname(m0) spec(ps) replay atet
  8.                         regsave gender_r using `folder'/results.dta, ci ad
> dlabel(model,interactive,seed,`seed',final,`final',learner,-3) append
  9.                 
.                         // pystacked weights
.                         ddml extract, show(stweights)
 10.                         foreach mat in Y1_pystacked_w_mn D1_pystacked_w_mn
>  {
 11.                                         ddml extract, show(stweights)
 12.                                         mat `mat' = r(`mat')
 13.                                         mat list `mat'
 14.                                                 preserve
 15.                                                 svmat `mat'
 16.                                                 keep `mat'*
 17.                                                 list if _n<=8
 18.                                                 save `folder'/`mat'_`final
> '_regular_ia, replace
 19.                                                 restore
 20.                         }       
 21.                         // shortstacked weights
.                         ddml extract, show(ssweights)
 22.                         foreach mat in Y_lnearn_ss D_gender_r_ss {
 23.                                         ddml extract, show(ssweights)
 24.                                         mat `mat' = r(`mat')
 25.                                         mat list `mat'
 26.                                                 preserve
 27.                                                 svmat `mat'
 28.                                                 keep `mat'*
 29.                                                 list if _n<=8
 30.                                                 save `folder'/`mat'_`final
> '_short_ia, replace
 31.                                                 restore
 32.                         }       
 33.                         // poolstacked weights
.                         ddml extract, show(psweights)
 34.                         foreach mat in Y_lnearn_ps D_gender_r_ps {
 35.                                         ddml extract, show(psweights)
 36.                                         mat `mat' = r(`mat')
 37.                                         mat list `mat'
 38.                                                 preserve
 39.                                                 svmat `mat'
 40.                                                 keep `mat'*
 41.                                                 list if _n<=8
 42.                                                 save `folder'/`mat'_`final
> '_pooled_ia, replace
 43.                                                 restore
 44.                         }       
 45.         
.         }
. 
.         forvalues i = 1(1)$L {
  2.                         ddml estimate, y1(Y1_pystacked1_L`i'_1) y0(Y1_pyst
> acked0_L`i'_1) ///
>                                                         d(D1_pystacked_L`i'_1
> ) robust atet foldvar(m0_sample_1  )
  3.                         regsave gender_r using `folder'/results.dta, ci //
> /
>                                                 addlabel(model,interactive,se
> ed,`seed',final,indiv,learner,`i') ///
>                                                 append
  4.         }
. 
. }       

.         
. *****************************************************************************
> *  
. *** interactive NX: short-stacking                                           
>                                       ***
. *****************************************************************************
> *
. 
. if (`estimator'==3) {
. 
. gen one = 1     
. 
.         cap drop y0base*
.         cap drop dbase*
.         cap drop y1base*
. 
.         *** no cross-fitting
.         pystacked lnearn $X_expanded   $pystring_reg0  if gender_r == 0, type
> (reg) njobs($cores)  
.                 mat nxw_ia_y0 = e(weights)
.                 mat list nxw_ia_y0
.                                 preserve
.                                 svmat nxw_ia_y0
.                                 keep nxw_ia_y0*
.                                 save `folder'/nxw_ia_y0, replace
.                                 restore
.         predict y0base0, xb
.         predict y0base, base
. 
.         pystacked lnearn $X_expanded  $pystring_reg0 if gender_r == 1  , type
> (reg) njobs($cores)  
.                 mat nxw_ia_y1 = e(weights)
.                 mat list nxw_ia_y1
.                                 preserve
.                                 svmat nxw_ia_y1
.                                 keep nxw_ia_y1*
.                                 save `folder'/nxw_ia_y1, replace
.                                 restore
.         predict y1base0, xb
.         predict y1base, base
. 
.         pystacked gender_r $X_expanded $pystring_class  
.                 mat nxw_ia_d = e(weights)
.                 mat list nxw_ia_d
.                                 preserve
.                                 svmat nxw_ia_d
.                                 keep nxw_ia_d*
.                                 save `folder'/nxw_ia_d, replace
.                                 restore         
.         predict dbase0, pr
.         predict dbase, base pr
.         
.         forvalues i = 0(1)$L {
  2.                         _estimate_ate interactive, yname(lnearn) dname(gen
> der_r) ///
>                                                 y0(y0base`i') y1(y1base`i') d
> (dbase`i') ///
>                                                 atet foldid(one) robust model
> (interactive)
  3.                         regsave gender_r using `folder'/results.dta, ///
>                                                 ci addlabel(model,nxinter,see
> d,`seed',final,nx,learner,`i') append
  4.         }
.                 
. }

.         
. *****************************************************************************
> *  
. *** partial NX: short-stacking                                               
>                                       ***
. *****************************************************************************
> *
. 
. if (`estimator'==4) {
.         
. cap gen one = 1 
. 
.         cap drop Ybase* 
.         cap drop Dbase*
. 
.         *** no cross-fitting
.         pystacked lnearn $X_expanded $pystring_reg 
.                 mat nxw_y = e(weights)
.                 mat list nxw_y
.                                 preserve
.                                 svmat nxw_y
.                                 keep nxw_y*
.                                 save `folder'/nxw_y, replace
.                                 restore
.         predict Ybase0
.         predict Ybase, basexb
. 
.         pystacked gender_r $X_expanded $pystring_reg 
.                 mat nxw_d = e(weights)
.                 mat list nxw_d
.                                 preserve
.                                 svmat nxw_d
.                                 keep nxw_d*
.                                 save `folder'/nxw_d, replace
.                                 restore         
.         predict Dbase0
.         predict Dbase, basexb
. 
.         forvalues i = 0(1)$L {
  2.                 cap drop Ytil
  3.                 cap drop Dtil
  4.                 gen Ytil = lnearn - Ybase`i'
  5.                 gen Dtil = gender_r - Dbase`i'
  6.                 reg Ytil Dtil, robust
  7.                 regsave Dtil using `folder'/results.dta, ///
>                         ci addlabel(model,nxpartial,seed,`seed',final,nx,lear
> ner,`i') append
  8.         }
. 
. }

.         
. cap log close
